; ModuleID = 'std::hash::poly1305'
source_filename = "std::hash::poly1305"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%Poly1305 = type { [3 x i64], i128, i128, [16 x i8], i64, i64, i64, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

@"$ct.std.hash.poly1305.Poly1305" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 112, i64 0, i64 8, [0 x i64] zeroinitializer }, align 8
@std.hash.poly1305.TAG_SIZE = weak local_unnamed_addr constant i32 16, align 4, !dbg !0
@std.hash.poly1305.BLOCK_SIZE = weak local_unnamed_addr constant i32 16, align 4, !dbg !4
@std.hash.poly1305.KEY_SIZE = weak local_unnamed_addr constant i32 32, align 4, !dbg !6
@"$ct.long" = linkonce global %.introspect { i8 2, i64 0, ptr null, i64 8, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@.panic_msg = internal constant [60 x i8] c"Array index out of bounds (array had size %d, index was %d)\00", align 1
@.file = internal constant [12 x i8] c"poly1305.c3\00", align 1
@.func = internal constant [8 x i8] c"_blocks\00", align 1
@.panic_msg.3 = internal constant [62 x i8] c"Index exceeds array length (array had size %d, index was %d).\00", align 1
@.panic_msg.4 = internal constant [63 x i8] c"Reference parameter 'self' was passed a null pointer argument.\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "TAG_SIZE", linkageName: "std.hash.poly1305.TAG_SIZE", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 32)
!2 = !DIFile(filename: "poly1305.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/hash")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "BLOCK_SIZE", linkageName: "std.hash.poly1305.BLOCK_SIZE", scope: !2, file: !2, line: 13, type: !3, isLocal: false, isDefinition: true, align: 32)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "KEY_SIZE", linkageName: "std.hash.poly1305.KEY_SIZE", scope: !2, file: !2, line: 16, type: !3, isLocal: false, isDefinition: true, align: 32)
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 2, !"wchar_size", i32 4}
!11 = !{i32 4, !"PIC Level", i32 2}
!12 = !{i32 1, !"uwtable", i32 1}
!13 = !{i32 2, !"frame-pointer", i32 1}
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !15, splitDebugInlining: false)
!15 = !{!0, !4, !6}
!16 = distinct !DISubprogram(name: "init", linkageName: "std.hash.poly1305.Poly1305.init", scope: !2, file: !2, line: 62, type: !17, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !43)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19, !40}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Poly1305", scope: !2, file: !2, line: 19, size: 896, align: 128, elements: !21, identifier: "std.hash.poly1305.Poly1305")
!21 = !{!22, !27, !29, !30, !35, !37, !38, !39}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !20, file: !2, line: 21, baseType: !23, size: 192, align: 64)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 192, align: 64, elements: !25)
!24 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!25 = !{!26}
!26 = !DISubrange(count: 3, lowerBound: 0)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !20, file: !2, line: 22, baseType: !28, size: 128, align: 128, offset: 256)
!28 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !20, file: !2, line: 23, baseType: !28, size: 128, align: 128, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !20, file: !2, line: 24, baseType: !31, size: 128, align: 8, offset: 512)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, align: 8, elements: !33)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34}
!34 = !DISubrange(count: 16, lowerBound: 0)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !20, file: !2, line: 25, baseType: !36, size: 64, align: 64, offset: 640)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !24)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "r0", scope: !20, file: !2, line: 27, baseType: !24, size: 64, align: 64, offset: 704)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !20, file: !2, line: 28, baseType: !24, size: 64, align: 64, offset: 768)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "s1", scope: !20, file: !2, line: 29, baseType: !24, size: 64, align: 64, offset: 832)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 256, align: 8, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 32, lowerBound: 0)
!43 = !{}
!44 = !DILocation(line: 63, column: 1, scope: !16)
!45 = !DILocalVariable(name: "self", arg: 1, scope: !16, file: !2, line: 62, type: !19)
!46 = !DILocation(line: 62, column: 23, scope: !16)
!47 = !DILocalVariable(name: "key", arg: 2, scope: !16, file: !2, line: 62, type: !40)
!48 = !DILocation(line: 62, column: 45, scope: !16)
!49 = !DILocation(line: 257, column: 26, scope: !50, inlinedAt: !52)
!50 = distinct !DISubprogram(name: "load", linkageName: "load", scope: !51, file: !51, line: 255, scopeLine: 255, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!51 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!52 = !DILocation(line: 65, column: 19, scope: !16)
!53 = !DILocation(line: 66, column: 44, scope: !16)
!54 = !DILocation(line: 257, column: 26, scope: !55, inlinedAt: !56)
!55 = distinct !DISubprogram(name: "load", linkageName: "load", scope: !51, file: !51, line: 255, scopeLine: 255, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!56 = !DILocation(line: 66, column: 19, scope: !16)
!57 = !DILocation(line: 64, column: 6, scope: !16)
!58 = !DILocation(line: 69, column: 41, scope: !59, inlinedAt: !60)
!59 = distinct !DISubprogram(name: "@unaligned_load", linkageName: "@unaligned_load", scope: !51, file: !51, line: 201, scopeLine: 201, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!60 = !DILocation(line: 69, column: 15, scope: !16)
!61 = !DILocation(line: 69, column: 49, scope: !59, inlinedAt: !60)
!62 = !DILocation(line: 69, column: 5, scope: !16)
!63 = !DILocation(line: 70, column: 41, scope: !64, inlinedAt: !65)
!64 = distinct !DISubprogram(name: "@unaligned_load", linkageName: "@unaligned_load", scope: !51, file: !51, line: 201, scopeLine: 201, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!65 = !DILocation(line: 70, column: 15, scope: !16)
!66 = !DILocation(line: 70, column: 49, scope: !64, inlinedAt: !65)
!67 = !DILocation(line: 70, column: 5, scope: !16)
!68 = !DILocation(line: 72, column: 15, scope: !16)
!69 = !DILocation(line: 72, column: 26, scope: !16)
!70 = !DILocation(line: 72, column: 5, scope: !16)
!71 = distinct !DISubprogram(name: "update", linkageName: "std.hash.poly1305.Poly1305.update", scope: !2, file: !2, line: 76, type: !72, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !43)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !19, !74}
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !75, identifier: "char[]")
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !74, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, baseType: !36, size: 64, align: 64, offset: 64)
!79 = !DILocation(line: 77, column: 1, scope: !71)
!80 = !DILocalVariable(name: "self", arg: 1, scope: !71, file: !2, line: 76, type: !19)
!81 = !DILocation(line: 76, column: 25, scope: !71)
!82 = !DILocalVariable(name: "input", arg: 2, scope: !71, file: !2, line: 76, type: !74)
!83 = !DILocation(line: 76, column: 39, scope: !71)
!84 = !DILocation(line: 78, column: 9, scope: !71)
!85 = !DILocalVariable(name: "rem", scope: !86, file: !2, line: 80, type: !36, align: 64)
!86 = distinct !DILexicalBlock(scope: !71, file: !2, line: 79, column: 5)
!87 = !DILocation(line: 80, column: 13, scope: !86)
!88 = !DILocation(line: 80, column: 32, scope: !86)
!89 = !DILocation(line: 80, column: 19, scope: !86)
!90 = !DILocation(line: 81, column: 13, scope: !86)
!91 = !DILocation(line: 81, column: 25, scope: !86)
!92 = !DILocation(line: 83, column: 45, scope: !93)
!93 = distinct !DILexicalBlock(scope: !86, file: !2, line: 82, column: 9)
!94 = !DILocation(line: 83, column: 51, scope: !93)
!95 = !DILocation(line: 83, column: 13, scope: !93)
!96 = !DILocation(line: 83, column: 23, scope: !93)
!97 = !DILocation(line: 83, column: 32, scope: !93)
!98 = !DILocation(line: 84, column: 13, scope: !93)
!99 = !DILocation(line: 84, column: 25, scope: !93)
!100 = !DILocation(line: 85, column: 19, scope: !93)
!101 = !DILocation(line: 88, column: 35, scope: !86)
!102 = !DILocation(line: 88, column: 41, scope: !86)
!103 = !DILocation(line: 88, column: 42, scope: !86)
!104 = !DILocation(line: 88, column: 9, scope: !86)
!105 = !DILocation(line: 88, column: 19, scope: !86)
!106 = !DILocation(line: 88, column: 28, scope: !86)
!107 = !DILocation(line: 89, column: 23, scope: !86)
!108 = !DILocation(line: 138, column: 63, scope: !109, inlinedAt: !110)
!109 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !2, file: !2, line: 138, scopeLine: 138, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!110 = !DILocation(line: 89, column: 9, scope: !86)
!111 = !DILocation(line: 90, column: 17, scope: !86)
!112 = !DILocation(line: 90, column: 23, scope: !86)
!113 = !DILocalVariable(name: "even_length", scope: !71, file: !2, line: 93, type: !36, align: 64)
!114 = !DILocation(line: 93, column: 9, scope: !71)
!115 = !DILocation(line: 93, column: 23, scope: !71)
!116 = !DILocation(line: 93, column: 36, scope: !71)
!117 = !DILocation(line: 94, column: 9, scope: !71)
!118 = !DILocation(line: 96, column: 23, scope: !119)
!119 = distinct !DILexicalBlock(scope: !71, file: !2, line: 95, column: 5)
!120 = !DILocation(line: 96, column: 29, scope: !119)
!121 = !DILocation(line: 96, column: 30, scope: !119)
!122 = !DILocation(line: 138, column: 63, scope: !123, inlinedAt: !124)
!123 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !2, file: !2, line: 138, scopeLine: 138, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!124 = !DILocation(line: 96, column: 9, scope: !119)
!125 = !DILocation(line: 97, column: 17, scope: !119)
!126 = !DILocation(line: 97, column: 23, scope: !119)
!127 = !DILocation(line: 100, column: 9, scope: !71)
!128 = !DILocation(line: 100, column: 44, scope: !71)
!129 = !DILocation(line: 100, column: 50, scope: !71)
!130 = !DILocation(line: 100, column: 20, scope: !71)
!131 = !DILocation(line: 100, column: 31, scope: !71)
!132 = !DILocation(line: 102, column: 16, scope: !71)
!133 = !DILocation(line: 102, column: 5, scope: !71)
!134 = distinct !DISubprogram(name: "final", linkageName: "std.hash.poly1305.Poly1305.final", scope: !2, file: !2, line: 106, type: !135, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !43)
!135 = !DISubroutineType(types: !136)
!136 = !{!31, !19}
!137 = !DILocation(line: 107, column: 1, scope: !134)
!138 = !DILocalVariable(name: "self", arg: 1, scope: !134, file: !2, line: 106, type: !19)
