; ModuleID = 'std::collections::object'
source_filename = "std::collections::object"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%Object = type { i64, %any, %.anon }
%.anon = type { i128, [32 x i8] }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"char[][]" = type { ptr, i64 }
%"HashMap{String, Object*}" = type { %"Entry{String, Object*}*[]", %any, i32, i32, float }
%"Entry{String, Object*}*[]" = type { ptr, i64 }

@"$ct.std.collections.object.Object.$anon" = linkonce global %.introspect { i8 11, i64 0, ptr null, i64 48, i64 0, i64 7, [0 x i64] zeroinitializer }, align 8
@"$ct.std.collections.object.Object" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 80, i64 0, i64 3, [0 x i64] zeroinitializer }, align 8
@"$ct.bool" = linkonce global %.introspect { i8 1, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@std.collections.object.TRUE_OBJECT = weak constant { i64, %any, [8 x i8], { i8, [47 x i8] } } { i64 ptrtoint (ptr @"$ct.bool" to i64), %any zeroinitializer, [8 x i8] undef, { i8, [47 x i8] } { i8 1, [47 x i8] undef } }, align 16, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "TRUE_OBJECT", linkageName: "std.collections.object.TRUE_OBJECT", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 128)
!2 = !DIFile(filename: "object.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 640, align: 128, elements: !4, identifier: "std.collections.object.Object")
!4 = !{!5, !7, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !3, file: !2, line: 13, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 14, baseType: !8, size: 128, align: 64, offset: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !6, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, scope: !3, file: !2, line: 15, baseType: !14, size: 384, align: 128, offset: 256)
!14 = !DICompositeType(tag: DW_TAG_union_type, scope: !3, file: !2, line: 15, size: 384, align: 128, elements: !15)
!15 = !{!16, !18, !20, !22, !32, !33, !43}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !14, file: !2, line: 17, baseType: !17, size: 128, align: 128)
!17 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !14, file: !2, line: 18, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !14, file: !2, line: 19, baseType: !21, size: 8, align: 8)
!21 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !14, file: !2, line: 20, baseType: !23, size: 128, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !31)
!31 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !14, file: !2, line: 21, baseType: !11, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !14, file: !2, line: 22, baseType: !34, size: 320, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 465, baseType: !35, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{Object*}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !36, identifier: "std.collections.list.List$p$std.collections.object.Object$")
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !2, line: 20, baseType: !30, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !35, file: !2, line: 21, baseType: !30, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !35, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !35, file: !2, line: 23, baseType: !41, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !14, file: !2, line: 23, baseType: !44, size: 384, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 464, baseType: !45, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap{String, Object*}", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !46, identifier: "std.collections.map.HashMap$String$p$std.collections.object.Object$")
!46 = !{!47, !61, !62, !63, !64}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !45, file: !2, line: 31, baseType: !48, size: 128, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{String, Object*}*[]", size: 128, align: 64, elements: !49, identifier: "Entry{String, Object*}*[]")
!49 = !{!50, !60}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !48, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{String, Object*}", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !54, identifier: "std.collections.map.Entry$String$p$std.collections.object.Object$")
!54 = !{!55, !57, !58, !59}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !53, file: !2, line: 23, baseType: !56, size: 32, align: 32)
!56 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !53, file: !2, line: 24, baseType: !23, size: 128, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !53, file: !2, line: 25, baseType: !42, size: 64, align: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !53, file: !2, line: 26, baseType: !52, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !48, baseType: !30, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !45, file: !2, line: 32, baseType: !8, size: 128, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !45, file: !2, line: 34, baseType: !56, size: 32, align: 32, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !45, file: !2, line: 36, baseType: !56, size: 32, align: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !45, file: !2, line: 37, baseType: !65, size: 32, align: 32, offset: 320)
!65 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "FALSE_OBJECT", linkageName: "std.collections.object.FALSE_OBJECT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 128)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "NULL_OBJECT", linkageName: "std.collections.object.NULL_OBJECT", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 128)
!70 = !{i32 2, !"Dwarf Version", i32 4}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{i32 2, !"wchar_size", i32 4}
!73 = !{i32 4, !"PIC Level", i32 2}
!74 = !{i32 1, !"uwtable", i32 1}
!75 = !{i32 2, !"frame-pointer", i32 1}
!76 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !77, splitDebugInlining: false)
!77 = !{!0, !66, !68}
!78 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.object.Object.to_format", scope: !2, file: !2, line: 28, type: !79, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !76, retainedNodes: !99)
!79 = !DISubroutineType(types: !80)
!80 = !{!31, !42, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 65, size: 320, align: 64, elements: !83, identifier: "std.io.Formatter")
!83 = !{!84, !85, !90}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !82, file: !2, line: 67, baseType: !11, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !82, file: !2, line: 68, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 18, baseType: !87, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !11, !28}
!90 = !DIDerivedType(tag: DW_TAG_member, scope: !82, file: !2, line: 69, baseType: !91, size: 192, align: 64, offset: 128)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !82, file: !2, line: 69, size: 192, align: 64, elements: !92)
!92 = !{!93, !94, !95, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !91, file: !2, line: 71, baseType: !56, size: 32, align: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !91, file: !2, line: 72, baseType: !56, size: 32, align: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !91, file: !2, line: 73, baseType: !56, size: 32, align: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !91, file: !2, line: 74, baseType: !97, size: 64, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !98)
!98 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!99 = !{}
!100 = !DILocation(line: 29, column: 1, scope: !78)
!101 = !DILocalVariable(name: "self", arg: 1, scope: !78, file: !2, line: 28, type: !42)
!102 = !DILocation(line: 28, column: 26, scope: !78)
!103 = !DILocalVariable(name: "formatter", arg: 2, scope: !78, file: !2, line: 28, type: !81)
!104 = !DILocation(line: 28, column: 44, scope: !78)
!105 = !DILocation(line: 30, column: 10, scope: !106)
!106 = distinct !DILexicalBlock(scope: !78, file: !2, line: 30, column: 2)
!107 = !DILocation(line: 32, column: 8, scope: !106)
!108 = !DILocation(line: 33, column: 11, scope: !109)
!109 = distinct !DILexicalBlock(scope: !106, file: !2, line: 33, column: 4)
!110 = !DILocation(line: 34, column: 8, scope: !106)
!111 = !DILocation(line: 35, column: 11, scope: !112)
!112 = distinct !DILexicalBlock(scope: !106, file: !2, line: 35, column: 4)
!113 = !DILocation(line: 36, column: 8, scope: !106)
!114 = !DILocation(line: 37, column: 36, scope: !115)
!115 = distinct !DILexicalBlock(scope: !106, file: !2, line: 37, column: 4)
!116 = !DILocation(line: 37, column: 11, scope: !115)
!117 = !DILocation(line: 38, column: 8, scope: !106)
!118 = !DILocation(line: 39, column: 28, scope: !119)
!119 = distinct !DILexicalBlock(scope: !106, file: !2, line: 39, column: 4)
!120 = !DILocation(line: 39, column: 46, scope: !119)
!121 = !DILocation(line: 39, column: 11, scope: !119)
!122 = !DILocation(line: 40, column: 8, scope: !106)
!123 = !DILocalVariable(name: "n", scope: !124, file: !2, line: 41, type: !30, align: 64)
!124 = distinct !DILexicalBlock(scope: !106, file: !2, line: 41, column: 4)
!125 = !DILocation(line: 41, column: 8, scope: !124)
!126 = !DILocation(line: 41, column: 12, scope: !124)
!127 = !DILocation(line: 42, column: 21, scope: !128)
!128 = distinct !DILexicalBlock(scope: !124, file: !2, line: 42, column: 4)
!129 = !DILocalVariable(name: ".temp", scope: !128, file: !2, line: 42, type: !30, align: 64)
!130 = !DILocation(line: 42, column: 13, scope: !128)
!131 = !DILocalVariable(name: "i", scope: !132, file: !2, line: 42, type: !30, align: 64)
!132 = distinct !DILexicalBlock(scope: !128, file: !2, line: 43, column: 4)
!133 = !DILocation(line: 42, column: 13, scope: !132)
!134 = !DILocalVariable(name: "ol", scope: !132, file: !2, line: 42, type: !42, align: 64)
!135 = !DILocation(line: 42, column: 16, scope: !132)
!136 = !DILocation(line: 393, column: 26, scope: !137, inlinedAt: !135)
!137 = distinct !DILexicalBlock(scope: !139, file: !138, line: 394, column: 1)
!138 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!139 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !138, file: !138, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !76)
!140 = !DILocation(line: 391, column: 11, scope: !137, inlinedAt: !135)
!141 = !DILocation(line: 391, column: 19, scope: !137, inlinedAt: !135)
!142 = !DILocation(line: 42, column: 16, scope: !137, inlinedAt: !135)
!143 = !DILocation(line: 395, column: 9, scope: !139, inlinedAt: !135)
!144 = !DILocation(line: 395, column: 22, scope: !139, inlinedAt: !135)
!145 = !DILocation(line: 44, column: 9, scope: !146)
!146 = distinct !DILexicalBlock(scope: !132, file: !2, line: 43, column: 4)
!147 = !DILocation(line: 44, column: 16, scope: !146)
!148 = !DILocation(line: 44, column: 21, scope: !146)
!149 = !DILocation(line: 45, column: 5, scope: !146)
!150 = !DILocation(line: 45, column: 10, scope: !146)
!151 = !DILocation(line: 47, column: 4, scope: !124)
!152 = !DILocation(line: 47, column: 9, scope: !124)
!153 = !DILocation(line: 48, column: 11, scope: !124)
!154 = !DILocation(line: 49, column: 8, scope: !106)
!155 = !DILocalVariable(name: "n", scope: !156, file: !2, line: 50, type: !30, align: 64)
!156 = distinct !DILexicalBlock(scope: !106, file: !2, line: 50, column: 4)
!157 = !DILocation(line: 50, column: 8, scope: !156)
!158 = !DILocation(line: 50, column: 12, scope: !156)
!159 = !DILocalVariable(name: "buffer", scope: !160, file: !2, line: 610, type: !162, align: 8)
!160 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !161, file: !161, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !76, retainedNodes: !99)
!161 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, align: 8, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 1024, lowerBound: 0)
!165 = !DILocation(line: 610, column: 14, scope: !160, inlinedAt: !166)
!166 = !DILocation(line: 51, column: 4, scope: !156)
!167 = !DILocalVariable(name: "allocator", scope: !160, file: !2, line: 611, type: !168, align: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !169, identifier: "std.core.mem.allocator.OnStackAllocator")
!169 = !{!170, !171, !172, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !168, file: !2, line: 14, baseType: !8, size: 128, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !2, line: 15, baseType: !24, size: 128, align: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !168, file: !2, line: 16, baseType: !30, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !168, file: !2, line: 17, baseType: !174, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !176, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.7818")
!176 = !{!177, !178, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !175, file: !2, line: 22, baseType: !21, size: 8, align: 8)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !175, file: !2, line: 23, baseType: !174, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !175, file: !2, line: 24, baseType: !11, size: 64, align: 64, offset: 128)
!180 = !DILocation(line: 611, column: 19, scope: !160, inlinedAt: !166)
!181 = !DILocation(line: 612, column: 18, scope: !160, inlinedAt: !166)
!182 = !DILocation(line: 612, column: 26, scope: !160, inlinedAt: !166)
!183 = !DILocation(line: 612, column: 2, scope: !160, inlinedAt: !166)
!184 = !DILocalVariable(name: "mem", scope: !156, file: !2, line: 51, type: !8, align: 64)
!185 = !DILocation(line: 51, column: 31, scope: !156)
!186 = !DILocation(line: 614, column: 8, scope: !187, inlinedAt: !166)
!187 = distinct !DILexicalBlock(scope: !160, file: !161, line: 614, column: 2)
!188 = !DILocation(line: 53, column: 23, scope: !189)
!189 = distinct !DILexicalBlock(scope: !190, file: !2, line: 53, column: 5)
!190 = distinct !DILexicalBlock(scope: !156, file: !2, line: 52, column: 4)
!191 = !DILocation(line: 53, column: 37, scope: !189)
!192 = !DILocalVariable(name: ".temp", scope: !189, file: !2, line: 53, type: !30, align: 64)
!193 = !DILocation(line: 53, column: 14, scope: !189)
!194 = !DILocalVariable(name: "i", scope: !195, file: !2, line: 53, type: !30, align: 64)
!195 = distinct !DILexicalBlock(scope: !189, file: !2, line: 54, column: 5)
!196 = !DILocation(line: 53, column: 14, scope: !195)
!197 = !DILocalVariable(name: "key", scope: !195, file: !2, line: 53, type: !23, align: 64)
!198 = !DILocation(line: 53, column: 17, scope: !195)
!199 = !DILocation(line: 53, column: 23, scope: !195)
!200 = !DILocation(line: 55, column: 10, scope: !201)
!201 = distinct !DILexicalBlock(scope: !195, file: !2, line: 54, column: 5)
!202 = !DILocation(line: 55, column: 17, scope: !201)
!203 = !DILocation(line: 55, column: 22, scope: !201)
!204 = !DILocation(line: 613, column: 8, scope: !205, inlinedAt: !166)
!205 = distinct !DILexicalBlock(scope: !160, file: !161, line: 613, column: 8)
!206 = !DILocation(line: 56, column: 6, scope: !201)
!207 = !DILocation(line: 56, column: 37, scope: !201)
!208 = !DILocation(line: 56, column: 11, scope: !201)
!209 = !DILocation(line: 613, column: 8, scope: !210, inlinedAt: !166)
!210 = distinct !DILexicalBlock(scope: !160, file: !161, line: 613, column: 8)
!211 = !DILocation(line: 57, column: 6, scope: !201)
!212 = !DILocation(line: 57, column: 11, scope: !201)
!213 = !DILocation(line: 613, column: 8, scope: !214, inlinedAt: !166)
!214 = distinct !DILexicalBlock(scope: !160, file: !161, line: 613, column: 8)
!215 = !DILocation(line: 613, column: 8, scope: !216, inlinedAt: !166)
!216 = distinct !DILexicalBlock(scope: !160, file: !161, line: 613, column: 8)
!217 = !DILocation(line: 60, column: 4, scope: !156)
!218 = !DILocation(line: 60, column: 9, scope: !156)
!219 = !DILocation(line: 61, column: 11, scope: !156)
!220 = !DILocation(line: 63, column: 12, scope: !221)
!221 = distinct !DILexicalBlock(scope: !222, file: !2, line: 63, column: 4)
!222 = distinct !DILexicalBlock(scope: !106, file: !2, line: 63, column: 4)
!223 = !DILocation(line: 66, column: 44, scope: !224)
!224 = distinct !DILexicalBlock(scope: !221, file: !2, line: 66, column: 6)
!225 = !DILocation(line: 66, column: 36, scope: !224)
!226 = !DILocation(line: 66, column: 13, scope: !224)
!227 = !DILocation(line: 68, column: 45, scope: !228)
!228 = distinct !DILexicalBlock(scope: !221, file: !2, line: 68, column: 6)
!229 = !DILocation(line: 68, column: 36, scope: !228)
!230 = !DILocation(line: 68, column: 13, scope: !228)
!231 = !DILocation(line: 70, column: 36, scope: !232)
!232 = distinct !DILexicalBlock(scope: !221, file: !2, line: 70, column: 6)
!233 = !DILocation(line: 70, column: 13, scope: !232)
!234 = !DILocation(line: 72, column: 36, scope: !235)
!235 = distinct !DILexicalBlock(scope: !221, file: !2, line: 72, column: 6)
!236 = !DILocation(line: 72, column: 13, scope: !235)
!237 = !DILocation(line: 74, column: 13, scope: !238)
!238 = distinct !DILexicalBlock(scope: !221, file: !2, line: 74, column: 6)
