; ModuleID = 'std::encoding::csv'
source_filename = "std::encoding::csv"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%CsvRow = type { %"char[][]", %"char[]", %any }
%CsvReader = type { %any, %"char[]" }

@"$ct.std.encoding.csv.CsvReader" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 32, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.encoding.csv.CsvRow" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 48, i64 0, i64 3, [0 x i64] zeroinitializer }, align 8
@.panic_msg = internal constant [63 x i8] c"Reference parameter 'self' was passed a null pointer argument.\00", align 1
@.file = internal constant [7 x i8] c"csv.c3\00", align 1
@.func = internal constant [10 x i8] c"to_format\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@.str = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@"$ct.sa$String" = linkonce global %.introspect { i8 16, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.String" to i64), i64 0, [0 x i64] zeroinitializer }, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "csv.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/encoding")
!8 = distinct !DISubprogram(name: "to_format", linkageName: "std.encoding.csv.CsvRow.to_format", scope: !7, file: !7, line: 18, type: !9, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !12, !37}
!11 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvRow", scope: !7, file: !7, line: 11, size: 384, align: 64, elements: !14, identifier: "std.encoding.csv.CsvRow")
!14 = !{!15, !29, !30}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !13, file: !7, line: 13, baseType: !16, size: 128, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !17, identifier: "String[]")
!17 = !{!18, !28}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !16, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !22, identifier: "char[]")
!22 = !{!23, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !21, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !21, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !11)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !16, baseType: !27, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !13, file: !7, line: 14, baseType: !20, size: 128, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !13, file: !7, line: 15, baseType: !31, size: 128, align: 64, offset: 256)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !32, identifier: "Allocator")
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !31, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !31, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64, dwarfAddressSpace: 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !7, file: !7, line: 65, size: 320, align: 64, elements: !39, identifier: "std.io.Formatter")
!39 = !{!40, !41, !46}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !38, file: !7, line: 67, baseType: !34, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !38, file: !7, line: 68, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !7, file: !7, line: 18, baseType: !43, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !34, !25}
!46 = !DIDerivedType(tag: DW_TAG_member, scope: !38, file: !7, line: 69, baseType: !47, size: 192, align: 64, offset: 128)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !38, file: !7, line: 69, size: 192, align: 64, elements: !48)
!48 = !{!49, !51, !52, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !47, file: !7, line: 71, baseType: !50, size: 32, align: 32)
!50 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !47, file: !7, line: 72, baseType: !50, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !47, file: !7, line: 73, baseType: !50, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !47, file: !7, line: 74, baseType: !54, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !55)
!55 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!56 = !{}
!57 = !DILocation(line: 19, column: 1, scope: !8)
!58 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 18, type: !12)
!59 = !DILocation(line: 18, column: 26, scope: !8)
!60 = !DILocalVariable(name: "f", arg: 2, scope: !8, file: !7, line: 18, type: !37)
!61 = !DILocation(line: 18, column: 44, scope: !8)
!62 = !DILocation(line: 20, column: 24, scope: !8)
!63 = !DILocation(line: 20, column: 9, scope: !8)
!64 = distinct !DISubprogram(name: "len", linkageName: "std.encoding.csv.CsvRow.len", scope: !7, file: !7, line: 23, type: !65, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!65 = !DISubroutineType(types: !66)
!66 = !{!27, !12}
!67 = !DILocation(line: 24, column: 1, scope: !64)
!68 = !DILocalVariable(name: "self", arg: 1, scope: !64, file: !7, line: 23, type: !12)
!69 = !DILocation(line: 23, column: 19, scope: !64)
!70 = !DILocation(line: 25, column: 9, scope: !64)
!71 = distinct !DISubprogram(name: "get_col", linkageName: "std.encoding.csv.CsvRow.get_col", scope: !7, file: !7, line: 31, type: !72, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!72 = !DISubroutineType(types: !73)
!73 = !{!20, !12, !11}
!74 = !DILocation(line: 32, column: 1, scope: !71)
!75 = !DILocalVariable(name: "self", arg: 1, scope: !71, file: !7, line: 31, type: !12)
!76 = !DILocation(line: 31, column: 26, scope: !71)
!77 = !DILocalVariable(name: "col", arg: 2, scope: !71, file: !7, line: 31, type: !27)
!78 = !DILocation(line: 31, column: 37, scope: !71)
!79 = !DILocation(line: 29, column: 11, scope: !80)
!80 = distinct !DILexicalBlock(scope: !71, file: !7, line: 32, column: 1)
!81 = !DILocation(line: 29, column: 17, scope: !80)
!82 = !DILocation(line: 33, column: 9, scope: !71)
!83 = !DILocation(line: 33, column: 19, scope: !71)
!84 = distinct !DISubprogram(name: "init", linkageName: "std.encoding.csv.CsvReader.init", scope: !7, file: !7, line: 36, type: !85, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !87, !91, !20}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvReader", scope: !7, file: !7, line: 5, size: 256, align: 64, elements: !89, identifier: "std.encoding.csv.CsvReader")
!89 = !{!90, !95}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !88, file: !7, line: 7, baseType: !91, size: 128, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !92, identifier: "InStream")
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !91, baseType: !34, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, baseType: !36, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "separator", scope: !88, file: !7, line: 8, baseType: !20, size: 128, align: 64, offset: 128)
!96 = !DILocation(line: 37, column: 1, scope: !84)
!97 = !DILocalVariable(name: "self", arg: 1, scope: !84, file: !7, line: 36, type: !87)
!98 = !DILocation(line: 36, column: 24, scope: !84)
!99 = !DILocalVariable(name: "stream", arg: 2, scope: !84, file: !7, line: 36, type: !91)
!100 = !DILocation(line: 36, column: 40, scope: !84)
!101 = !DILocalVariable(name: "separator", arg: 3, scope: !84, file: !7, line: 36, type: !20)
!102 = !DILocation(line: 36, column: 55, scope: !84)
!103 = !DILocation(line: 38, column: 2, scope: !84)
!104 = !DILocation(line: 39, column: 2, scope: !84)
!105 = distinct !DISubprogram(name: "read_row", linkageName: "std.encoding.csv.CsvReader.read_row", scope: !7, file: !7, line: 44, type: !106, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!106 = !DISubroutineType(types: !107)
!107 = !{!13, !88, !31}
!108 = !DILocalVariable(name: "self", arg: 1, scope: !105, file: !7, line: 44, type: !88)
!109 = !DILocation(line: 44, column: 31, scope: !105)
!110 = !DILocalVariable(name: "allocator", arg: 2, scope: !105, file: !7, line: 44, type: !31)
!111 = !DILocation(line: 44, column: 47, scope: !105)
!112 = !DILocalVariable(name: "row", scope: !105, file: !7, line: 46, type: !20, align: 64)
!113 = !DILocation(line: 46, column: 9, scope: !105)
!114 = !DILocation(line: 69, column: 34, scope: !115, inlinedAt: !118)
!115 = distinct !DILexicalBlock(scope: !117, file: !116, line: 70, column: 1)
!116 = !DIFile(filename: "io.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io")
!117 = distinct !DISubprogram(name: "readline", linkageName: "readline", scope: !116, file: !116, line: 69, scopeLine: 69, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!118 = !DILocation(line: 46, column: 15, scope: !105)
!119 = !DILocation(line: 71, column: 9, scope: !117, inlinedAt: !118)
!120 = !DILocalVariable(name: "list", scope: !105, file: !7, line: 48, type: !16, align: 64)
!121 = !DILocation(line: 48, column: 11, scope: !105)
!122 = !DILocation(line: 48, column: 18, scope: !105)
!123 = !DILocation(line: 48, column: 28, scope: !105)
!124 = !DILocation(line: 48, column: 39, scope: !105)
!125 = !DILocation(line: 376, column: 11, scope: !105)
!126 = !DILocation(line: 49, column: 11, scope: !105)
!127 = !DILocation(line: 49, column: 17, scope: !105)
!128 = !DILocation(line: 49, column: 22, scope: !105)
!129 = distinct !DISubprogram(name: "tread_row", linkageName: "std.encoding.csv.CsvReader.tread_row", scope: !7, file: !7, line: 52, type: !130, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!130 = !DISubroutineType(types: !131)
!131 = !{!13, !88}
!132 = !DILocalVariable(name: "self", arg: 1, scope: !129, file: !7, line: 52, type: !88)
!133 = !DILocation(line: 52, column: 32, scope: !129)
!134 = !DILocation(line: 54, column: 23, scope: !129)
!135 = !DILocation(line: 54, column: 9, scope: !129)
!136 = distinct !DISubprogram(name: "free", linkageName: "std.encoding.csv.CsvRow.free", scope: !7, file: !7, line: 60, type: !137, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !12}
!139 = !DILocation(line: 61, column: 1, scope: !136)
!140 = !DILocalVariable(name: "self", arg: 1, scope: !136, file: !7, line: 60, type: !12)
!141 = !DILocation(line: 60, column: 21, scope: !136)
!142 = !DILocation(line: 58, column: 11, scope: !143)
!143 = distinct !DILexicalBlock(scope: !136, file: !7, line: 61, column: 1)
!144 = !DILocation(line: 62, column: 18, scope: !136)
!145 = !DILocation(line: 62, column: 34, scope: !136)
!146 = !DILocation(line: 119, column: 6, scope: !147, inlinedAt: !149)
!147 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !148, file: !148, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!148 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!149 = !DILocation(line: 62, column: 2, scope: !136)
!150 = !DILocation(line: 119, column: 18, scope: !147, inlinedAt: !149)
!151 = !DILocation(line: 123, column: 20, scope: !147, inlinedAt: !149)
!152 = !DILocation(line: 123, column: 2, scope: !147, inlinedAt: !149)
!153 = !DILocation(line: 63, column: 18, scope: !136)
!154 = !DILocation(line: 63, column: 34, scope: !136)
!155 = !DILocation(line: 119, column: 6, scope: !156, inlinedAt: !157)
!156 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !148, file: !148, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!157 = !DILocation(line: 63, column: 2, scope: !136)
!158 = !DILocation(line: 119, column: 18, scope: !156, inlinedAt: !157)
!159 = !DILocation(line: 123, column: 20, scope: !156, inlinedAt: !157)
!160 = !DILocation(line: 123, column: 2, scope: !156, inlinedAt: !157)
!161 = !DILocation(line: 64, column: 2, scope: !136)
!162 = distinct !DISubprogram(name: "skip_row", linkageName: "std.encoding.csv.CsvReader.skip_row", scope: !7, file: !7, line: 67, type: !163, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !56)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !88}
!165 = !DILocalVariable(name: "self", arg: 1, scope: !162, file: !7, line: 67, type: !88)
!166 = !DILocation(line: 67, column: 29, scope: !162)
!167 = !DILocalVariable(name: "state", scope: !168, file: !7, line: 679, type: !170, align: 64)
!168 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !169, file: !169, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !56)
!169 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !7, file: !7, line: 496, baseType: !171, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64, dwarfAddressSpace: 0)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 31, size: 704, align: 64, elements: !173, identifier: "std.core.mem.allocator.TempAllocator")
!173 = !{!174, !175, !187, !188, !190, !191, !192, !193, !194, !195, !196}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !172, file: !7, line: 33, baseType: !31, size: 128, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !172, file: !7, line: 34, baseType: !176, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 54, size: 256, align: 64, elements: !178, identifier: "std.core.mem.allocator.TempAllocatorPage")
!178 = !{!179, !180, !181, !182, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !177, file: !7, line: 56, baseType: !176, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !177, file: !7, line: 57, baseType: !34, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !177, file: !7, line: 58, baseType: !27, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !177, file: !7, line: 59, baseType: !27, size: 64, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !177, file: !7, line: 60, baseType: !184, align: 8, offset: 256)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, align: 8, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 0, lowerBound: 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !172, file: !7, line: 35, baseType: !171, size: 64, align: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !172, file: !7, line: 36, baseType: !189, size: 8, align: 8, offset: 256)
!189 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !172, file: !7, line: 37, baseType: !27, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !172, file: !7, line: 38, baseType: !27, size: 64, align: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !172, file: !7, line: 39, baseType: !27, size: 64, align: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !172, file: !7, line: 40, baseType: !27, size: 64, align: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !172, file: !7, line: 41, baseType: !27, size: 64, align: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !172, file: !7, line: 42, baseType: !27, size: 64, align: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !172, file: !7, line: 43, baseType: !184, align: 8, offset: 704)
!197 = !DILocation(line: 679, column: 12, scope: !168, inlinedAt: !198)
!198 = !DILocation(line: 67, column: 50, scope: !162)
!199 = !DILocation(line: 679, column: 41, scope: !168, inlinedAt: !198)
!200 = !DILocation(line: 679, column: 20, scope: !168, inlinedAt: !198)
!201 = !DILocation(line: 86, column: 18, scope: !202, inlinedAt: !203)
!202 = distinct !DISubprogram(name: "treadline", linkageName: "treadline", scope: !116, file: !116, line: 84, scopeLine: 84, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!203 = !DILocation(line: 69, column: 2, scope: !204)
!204 = distinct !DILexicalBlock(scope: !162, file: !7, line: 68, column: 1)
!205 = !DILocation(line: 69, column: 34, scope: !206, inlinedAt: !208)
!206 = distinct !DILexicalBlock(scope: !207, file: !116, line: 70, column: 1)
!207 = distinct !DISubprogram(name: "readline", linkageName: "readline", scope: !116, file: !116, line: 69, scopeLine: 69, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!208 = !DILocation(line: 86, column: 9, scope: !202, inlinedAt: !203)
!209 = !DILocation(line: 71, column: 9, scope: !207, inlinedAt: !208)
!210 = !DILocation(line: 682, column: 23, scope: !211, inlinedAt: !198)
!211 = distinct !DILexicalBlock(scope: !168, file: !169, line: 681, column: 2)
!212 = !DILocation(line: 682, column: 3, scope: !211, inlinedAt: !198)
