; ModuleID = 'std::net::tcp'
source_filename = "std::net::tcp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%Socket = type { i32, i32, [128 x i8] }
%TcpSocketPair = type { %Socket, %Socket }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

@"$ct.std.net.tcp.TcpSocket" = linkonce global %.introspect { i8 18, i64 ptrtoint (ptr @"$ct.std.net.Socket" to i64), ptr null, i64 136, i64 ptrtoint (ptr @"$ct.std.net.Socket" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.std.net.Socket" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 136, i64 0, i64 3, [0 x i64] zeroinitializer }, align 8
@"$ct.std.net.tcp.TcpServerSocket" = linkonce global %.introspect { i8 18, i64 ptrtoint (ptr @"$ct.std.net.Socket" to i64), ptr null, i64 136, i64 ptrtoint (ptr @"$ct.std.net.Socket" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.std.net.tcp.TcpSocketPair" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 272, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@.enum.UNSPECIFIED = internal constant [12 x i8] c"UNSPECIFIED\00", align 1
@.enum.IPV4 = internal constant [5 x i8] c"IPV4\00", align 1
@.enum.IPV6 = internal constant [5 x i8] c"IPV6\00", align 1

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "tcp.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/net")
!8 = !{!9, !18}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SocketOption", scope: !7, file: !7, line: 110, baseType: !10, size: 8, align: 8, elements: !11)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!12, !13, !14, !15, !16, !17}
!12 = !DIEnumerator(name: "REUSEADDR", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "REUSEPORT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "KEEPALIVE", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "BROADCAST", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "OOBINLINE", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "DONTROUTE", value: 5, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IpProtocol", scope: !7, file: !7, line: 4, baseType: !10, size: 8, align: 8, elements: !19)
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "UNSPECIFIED", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "IPV4", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "IPV6", value: 2, isUnsigned: true)
!23 = distinct !DISubprogram(name: "init", linkageName: "std.net.tcp.TcpSocketPair.init", scope: !7, file: !7, line: 80, type: !24, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "TcpSocketPair", scope: !7, file: !7, line: 74, size: 2176, align: 32, elements: !28, identifier: "std.net.tcp.TcpSocketPair")
!28 = !{!29, !43}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !27, file: !7, line: 76, baseType: !30, size: 1088, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "TcpSocket", scope: !7, file: !7, line: 10, baseType: !31, align: 32)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Socket", scope: !7, file: !7, line: 4, size: 1088, align: 32, elements: !32, identifier: "std.net.Socket")
!32 = !{!33, !36, !39}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !31, file: !7, line: 6, baseType: !34, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeSocket", scope: !7, file: !7, line: 7, baseType: !35, align: 32)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !31, file: !7, line: 7, baseType: !37, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "Socklen_t", scope: !7, file: !7, line: 9, baseType: !38, align: 32)
!38 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr_storage", scope: !31, file: !7, line: 10, baseType: !40, size: 1024, align: 8, offset: 64)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, align: 8, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 128, lowerBound: 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !27, file: !7, line: 77, baseType: !30, size: 1088, align: 32, offset: 1088)
!44 = !{}
!45 = !DILocation(line: 81, column: 1, scope: !23)
!46 = !DILocalVariable(name: "self", arg: 1, scope: !23, file: !7, line: 80, type: !26)
!47 = !DILocation(line: 80, column: 39, scope: !23)
!48 = !DILocalVariable(name: "sockets", scope: !23, file: !7, line: 103, type: !49, align: 32)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 64, align: 32, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 2, lowerBound: 0)
!52 = !DILocation(line: 103, column: 19, scope: !23)
!53 = !DILocalVariable(name: "sockpair_result", scope: !23, file: !7, line: 104, type: !54, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !55)
!55 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!56 = !DILocation(line: 104, column: 7, scope: !23)
!57 = !DILocation(line: 104, column: 25, scope: !23)
!58 = !DILocation(line: 105, column: 7, scope: !23)
!59 = !DILocation(line: 105, column: 35, scope: !23)
!60 = !DILocalVariable(name: "send_sock", scope: !23, file: !7, line: 107, type: !31, align: 32)
!61 = !DILocation(line: 107, column: 10, scope: !23)
!62 = !DILocation(line: 107, column: 40, scope: !23)
!63 = !DILocalVariable(name: "tcp_send_sock", scope: !23, file: !7, line: 108, type: !30, align: 32)
!64 = !DILocation(line: 108, column: 13, scope: !23)
!65 = !DILocation(line: 108, column: 29, scope: !23)
!66 = !DILocalVariable(name: "recv_sock", scope: !23, file: !7, line: 110, type: !31, align: 32)
!67 = !DILocation(line: 110, column: 10, scope: !23)
!68 = !DILocation(line: 110, column: 40, scope: !23)
!69 = !DILocalVariable(name: "tcp_recv_sock", scope: !23, file: !7, line: 111, type: !30, align: 32)
!70 = !DILocation(line: 111, column: 13, scope: !23)
!71 = !DILocation(line: 111, column: 29, scope: !23)
!72 = !DILocation(line: 114, column: 20, scope: !23)
!73 = !DILocation(line: 114, column: 44, scope: !23)
!74 = !DILocation(line: 114, column: 3, scope: !23)
!75 = !DILocation(line: 115, column: 9, scope: !23)
!76 = distinct !DISubprogram(name: "destroy", linkageName: "std.net.tcp.TcpSocketPair.destroy", scope: !7, file: !7, line: 118, type: !77, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !26}
!79 = !DILocation(line: 119, column: 1, scope: !76)
!80 = !DILocalVariable(name: "self", arg: 1, scope: !76, file: !7, line: 118, type: !26)
!81 = !DILocation(line: 118, column: 32, scope: !76)
!82 = !DILocation(line: 122, column: 3, scope: !83)
!83 = distinct !DILexicalBlock(scope: !76, file: !7, line: 120, column: 2)
!84 = !DILocation(line: 121, column: 21, scope: !85)
!85 = distinct !DILexicalBlock(scope: !83, file: !7, line: 121, column: 15)
!86 = !DILocation(line: 121, column: 15, scope: !85)
!87 = !DILocation(line: 124, column: 2, scope: !76)
!88 = distinct !DISubprogram(name: "connect", linkageName: "std.net.tcp.connect", scope: !7, file: !7, line: 13, type: !89, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!89 = !DISubroutineType(types: !90)
!90 = !{!31, !91, !38, !99, !100, !18}
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !93, identifier: "char[]")
!93 = !{!94, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !92, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !92, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !98)
!98 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "Duration", scope: !7, file: !7, line: 5, baseType: !55, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "SocketOption[]", size: 128, align: 64, elements: !101, identifier: "SocketOption[]")
!101 = !{!102, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !100, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !100, baseType: !97, size: 64, align: 64, offset: 64)
!105 = !DILocalVariable(name: "host", arg: 1, scope: !88, file: !7, line: 13, type: !91)
!106 = !DILocation(line: 13, column: 30, scope: !88)
!107 = !DILocalVariable(name: "port", arg: 2, scope: !88, file: !7, line: 13, type: !38)
!108 = !DILocation(line: 13, column: 41, scope: !88)
!109 = !DILocalVariable(name: "timeout", arg: 3, scope: !88, file: !7, line: 13, type: !99)
!110 = !DILocation(line: 13, column: 56, scope: !88)
!111 = !DILocalVariable(name: "options", arg: 4, scope: !88, file: !7, line: 13, type: !100)
!112 = !DILocation(line: 13, column: 103, scope: !88)
!113 = !DILocalVariable(name: "ip_protocol", arg: 5, scope: !88, file: !7, line: 13, type: !18)
!114 = !DILocation(line: 13, column: 123, scope: !88)
!115 = !DILocalVariable(name: "ai", scope: !88, file: !7, line: 15, type: !116, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddrInfo", scope: !7, file: !7, line: 14, size: 384, align: 64, elements: !118, identifier: "std.net.os.AddrInfo")
!118 = !{!119, !121, !123, !125, !127, !128, !136}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !117, file: !7, line: 16, baseType: !120, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFlags", scope: !7, file: !7, line: 7, baseType: !35, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !117, file: !7, line: 17, baseType: !122, size: 32, align: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFamily", scope: !7, file: !7, line: 4, baseType: !35, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !117, file: !7, line: 18, baseType: !124, size: 32, align: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AISockType", scope: !7, file: !7, line: 6, baseType: !35, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !117, file: !7, line: 19, baseType: !126, size: 32, align: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIProtocol", scope: !7, file: !7, line: 5, baseType: !35, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !117, file: !7, line: 20, baseType: !37, size: 32, align: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, scope: !117, file: !7, line: 21, baseType: !129, size: 128, align: 64, offset: 192)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddrInfo.$anon", scope: !117, file: !7, line: 21, size: 128, align: 64, elements: !130)
!130 = !{!131, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !129, file: !7, line: 23, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !7, file: !7, line: 13, baseType: !95, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !129, file: !7, line: 24, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "SockAddrPtr", scope: !7, file: !7, line: 12, baseType: !135, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !117, file: !7, line: 31, baseType: !116, size: 64, align: 64, offset: 320)
!137 = !DILocation(line: 15, column: 12, scope: !88)
!138 = !DILocation(line: 15, column: 44, scope: !88)
!139 = !DILocation(line: 15, column: 18, scope: !88)
!140 = !DILocation(line: 17, column: 6, scope: !88)
!141 = !DILocation(line: 19, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !88, file: !7, line: 18, column: 2)
!143 = !DILocation(line: 16, column: 25, scope: !144)
!144 = distinct !DILexicalBlock(scope: !88, file: !7, line: 16, column: 8)
!145 = !DILocation(line: 16, column: 8, scope: !144)
!146 = !DILocation(line: 16, column: 25, scope: !147)
!147 = distinct !DILexicalBlock(scope: !88, file: !7, line: 16, column: 8)
!148 = !DILocation(line: 16, column: 8, scope: !147)
!149 = !DILocation(line: 21, column: 9, scope: !88)
!150 = !DILocation(line: 16, column: 25, scope: !151)
!151 = distinct !DILexicalBlock(scope: !88, file: !7, line: 16, column: 8)
!152 = !DILocation(line: 16, column: 8, scope: !151)
!153 = !DILocation(line: 16, column: 25, scope: !154)
!154 = distinct !DILexicalBlock(scope: !88, file: !7, line: 16, column: 8)
!155 = !DILocation(line: 16, column: 8, scope: !154)
!156 = distinct !DISubprogram(name: "connect_async", linkageName: "std.net.tcp.connect_async", scope: !7, file: !7, line: 24, type: !157, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!157 = !DISubroutineType(types: !158)
!158 = !{!31, !91, !38, !100, !18}
!159 = !DILocalVariable(name: "host", arg: 1, scope: !156, file: !7, line: 24, type: !91)
!160 = !DILocation(line: 24, column: 36, scope: !156)
!161 = !DILocalVariable(name: "port", arg: 2, scope: !156, file: !7, line: 24, type: !38)
!162 = !DILocation(line: 24, column: 47, scope: !156)
!163 = !DILocalVariable(name: "options", arg: 3, scope: !156, file: !7, line: 24, type: !100)
!164 = !DILocation(line: 24, column: 69, scope: !156)
!165 = !DILocalVariable(name: "ip_protocol", arg: 4, scope: !156, file: !7, line: 24, type: !18)
!166 = !DILocation(line: 24, column: 89, scope: !156)
!167 = !DILocalVariable(name: "ai", scope: !156, file: !7, line: 26, type: !116, align: 64)
!168 = !DILocation(line: 26, column: 12, scope: !156)
!169 = !DILocation(line: 26, column: 43, scope: !156)
!170 = !DILocation(line: 26, column: 17, scope: !156)
!171 = !DILocation(line: 28, column: 9, scope: !156)
!172 = !DILocation(line: 27, column: 25, scope: !173)
!173 = distinct !DILexicalBlock(scope: !156, file: !7, line: 27, column: 8)
!174 = !DILocation(line: 27, column: 8, scope: !173)
!175 = !DILocation(line: 27, column: 25, scope: !176)
!176 = distinct !DILexicalBlock(scope: !156, file: !7, line: 27, column: 8)
!177 = !DILocation(line: 27, column: 8, scope: !176)
!178 = distinct !DISubprogram(name: "connect_to", linkageName: "std.net.tcp.connect_to", scope: !7, file: !7, line: 31, type: !179, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!179 = !DISubroutineType(types: !180)
!180 = !{!31, !116, !100}
!181 = !DILocalVariable(name: "ai", arg: 1, scope: !178, file: !7, line: 31, type: !116)
!182 = !DILocation(line: 31, column: 36, scope: !178)
!183 = !DILocalVariable(name: "options", arg: 2, scope: !178, file: !7, line: 31, type: !100)
!184 = !DILocation(line: 31, column: 56, scope: !178)
!185 = !DILocation(line: 33, column: 9, scope: !178)
!186 = distinct !DISubprogram(name: "connect_async_to", linkageName: "std.net.tcp.connect_async_to", scope: !7, file: !7, line: 36, type: !179, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!187 = !DILocalVariable(name: "ai", arg: 1, scope: !186, file: !7, line: 36, type: !116)
!188 = !DILocation(line: 36, column: 42, scope: !186)
!189 = !DILocalVariable(name: "options", arg: 2, scope: !186, file: !7, line: 36, type: !100)
!190 = !DILocation(line: 36, column: 62, scope: !186)
