; ModuleID = 'std::os::darwin'
source_filename = "std::os::darwin"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%"any[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%Darwin_Dl_info = type { ptr, ptr, ptr, ptr }
%"void*[]" = type { ptr, i64 }
%"List{Backtrace}" = type { i64, i64, %any, ptr }

@"$ct.std.os.darwin.Darwin_Dl_info" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 32, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8
@"$ct.std.os.darwin.Darwin_segment_command_64" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 72, i64 0, i64 11, [0 x i64] zeroinitializer }, align 8
@"$ct.std.os.darwin.Darwin_mach_timebase_info" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 8, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.os.darwin.NSSearchPathDomainMask" = linkonce global %.introspect { i8 9, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.ulong" to i64), i64 5, [0 x i64] zeroinitializer }, align 8
@"$ct.ulong" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 8, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!41 = distinct !DIGlobalVariable(name: "HW_EPOCH", linkageName: "std.os.darwin.HW_EPOCH", scope: !2, file: !2, line: 24, type: !3, isLocal: false, isDefinition: true, align: 32)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "HW_FLOATINGPT", linkageName: "std.os.darwin.HW_FLOATINGPT", scope: !2, file: !2, line: 25, type: !3, isLocal: false, isDefinition: true, align: 32)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "HW_MACHINE_ARCH", linkageName: "std.os.darwin.HW_MACHINE_ARCH", scope: !2, file: !2, line: 26, type: !3, isLocal: false, isDefinition: true, align: 32)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "HW_VECTORUNIT", linkageName: "std.os.darwin.HW_VECTORUNIT", scope: !2, file: !2, line: 27, type: !3, isLocal: false, isDefinition: true, align: 32)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "HW_BUS_FREQ", linkageName: "std.os.darwin.HW_BUS_FREQ", scope: !2, file: !2, line: 28, type: !3, isLocal: false, isDefinition: true, align: 32)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "HW_CPU_FREQ", linkageName: "std.os.darwin.HW_CPU_FREQ", scope: !2, file: !2, line: 29, type: !3, isLocal: false, isDefinition: true, align: 32)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "HW_CACHELINE", linkageName: "std.os.darwin.HW_CACHELINE", scope: !2, file: !2, line: 30, type: !3, isLocal: false, isDefinition: true, align: 32)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "HW_L1ICACHESIZE", linkageName: "std.os.darwin.HW_L1ICACHESIZE", scope: !2, file: !2, line: 31, type: !3, isLocal: false, isDefinition: true, align: 32)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "HW_L1DCACHESIZE", linkageName: "std.os.darwin.HW_L1DCACHESIZE", scope: !2, file: !2, line: 32, type: !3, isLocal: false, isDefinition: true, align: 32)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "HW_L2SETTINGS", linkageName: "std.os.darwin.HW_L2SETTINGS", scope: !2, file: !2, line: 33, type: !3, isLocal: false, isDefinition: true, align: 32)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "HW_L2CACHESIZE", linkageName: "std.os.darwin.HW_L2CACHESIZE", scope: !2, file: !2, line: 34, type: !3, isLocal: false, isDefinition: true, align: 32)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "HW_L3SETTINGS", linkageName: "std.os.darwin.HW_L3SETTINGS", scope: !2, file: !2, line: 35, type: !3, isLocal: false, isDefinition: true, align: 32)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "HW_L3CACHESIZE", linkageName: "std.os.darwin.HW_L3CACHESIZE", scope: !2, file: !2, line: 36, type: !3, isLocal: false, isDefinition: true, align: 32)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "HW_MAXID", linkageName: "std.os.darwin.HW_MAXID", scope: !2, file: !2, line: 37, type: !3, isLocal: false, isDefinition: true, align: 32)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "path", linkageName: "executable_path.path", scope: !2, file: !2, line: 84, type: !70, isLocal: true, isDefinition: true, align: 8)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 32768, align: 8, elements: !72)
!71 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !{!73}
!73 = !DISubrange(count: 4096, lowerBound: 0)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "len", linkageName: "executable_path.len", scope: !2, file: !2, line: 85, type: !76, isLocal: true, isDefinition: true, align: 32)
!76 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!77 = !{i32 2, !"Dwarf Version", i32 4}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 2, !"wchar_size", i32 4}
!80 = !{i32 4, !"PIC Level", i32 2}
!81 = !{i32 1, !"uwtable", i32 1}
!82 = !{i32 2, !"frame-pointer", i32 1}
!83 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !84, globals: !90, splitDebugInlining: false)
!84 = !{!85, !89}
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NSSearchPathDirectory", scope: !86, file: !86, line: 13, baseType: !87, size: 64, align: 64, elements: !88)
!86 = !DIFile(filename: "general.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/os/macos")
!87 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!88 = !{}
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NSSearchPathDomainMask", scope: !86, file: !86, line: 4, baseType: !87, size: 64, align: 64, elements: !88)
!90 = !{!0, !4, !6, !8, !10, !12, !14, !16, !18, !20, !22, !24, !26, !28, !30, !32, !34, !36, !38, !40, !42, !44, !46, !48, !50, !52, !54, !56, !58, !60, !62, !64, !66, !68, !74}
!91 = distinct !DISubprogram(name: "executable_path", linkageName: "std.os.darwin.executable_path", scope: !2, file: !2, line: 82, type: !92, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !83, retainedNodes: !88)
!92 = !DISubroutineType(types: !93)
!93 = !{!94}
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !95, identifier: "char[]")
!95 = !{!96, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !94, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !94, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !87)
!100 = !DILocation(line: 86, column: 6, scope: !91)
!101 = !DILocalVariable(name: "buf", scope: !102, file: !2, line: 88, type: !70, align: 8)
!102 = distinct !DILexicalBlock(scope: !91, file: !2, line: 87, column: 2)
!103 = !DILocation(line: 88, column: 14, scope: !102)
!104 = !DILocalVariable(name: "temp_len", scope: !102, file: !2, line: 89, type: !76, align: 32)
!105 = !DILocation(line: 89, column: 8, scope: !102)
!106 = !DILocation(line: 89, column: 19, scope: !102)
!107 = !DILocation(line: 90, column: 10, scope: !102)
!108 = !DILocation(line: 90, column: 66, scope: !102)
!109 = !DILocation(line: 91, column: 12, scope: !102)
!110 = !DILocation(line: 92, column: 24, scope: !102)
!111 = !DILocation(line: 92, column: 19, scope: !102)
!112 = !DILocation(line: 92, column: 12, scope: !102)
!113 = !DILocation(line: 92, column: 6, scope: !102)
!114 = !DILocation(line: 94, column: 26, scope: !91)
!115 = !DILocation(line: 94, column: 12, scope: !91)
!116 = distinct !DISubprogram(name: "load_address", linkageName: "std.os.darwin.load_address.20159", scope: !2, file: !2, line: 97, type: !117, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, retainedNodes: !88)
!117 = !DISubroutineType(types: !118)
!118 = !{!87}
!119 = !DILocalVariable(name: "cmd", scope: !116, file: !2, line: 99, type: !120, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64, dwarfAddressSpace: 0)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Darwin_segment_command_64", scope: !2, file: !2, line: 55, size: 576, align: 64, elements: !122, identifier: "std.os.darwin.Darwin_segment_command_64")
!122 = !{!123, !124, !125, !129, !130, !131, !132, !133, !134, !135, !136}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !121, file: !2, line: 57, baseType: !76, size: 32, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cmdsize", scope: !121, file: !2, line: 58, baseType: !76, size: 32, align: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "segname", scope: !121, file: !2, line: 59, baseType: !126, size: 128, align: 8, offset: 64)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 16, lowerBound: 0)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vmaddr", scope: !121, file: !2, line: 60, baseType: !87, size: 64, align: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "vmsize", scope: !121, file: !2, line: 61, baseType: !87, size: 64, align: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "fileoff", scope: !121, file: !2, line: 62, baseType: !87, size: 64, align: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !121, file: !2, line: 63, baseType: !87, size: 64, align: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "maxprot", scope: !121, file: !2, line: 64, baseType: !3, size: 32, align: 32, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "initprot", scope: !121, file: !2, line: 65, baseType: !3, size: 32, align: 32, offset: 480)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nsects", scope: !121, file: !2, line: 66, baseType: !76, size: 32, align: 32, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !121, file: !2, line: 67, baseType: !76, size: 32, align: 32, offset: 544)
!137 = !DILocation(line: 99, column: 29, scope: !116)
!138 = !DILocation(line: 99, column: 35, scope: !116)
!139 = !DILocation(line: 100, column: 6, scope: !116)
!140 = !DILocation(line: 100, column: 19, scope: !116)
!141 = !DILocalVariable(name: "path", scope: !116, file: !2, line: 101, type: !142, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !94)
!143 = !DILocation(line: 101, column: 9, scope: !116)
!144 = !DILocation(line: 101, column: 16, scope: !116)
!145 = !DILocation(line: 101, column: 42, scope: !116)
!146 = !DILocalVariable(name: "dyld_count", scope: !116, file: !2, line: 102, type: !76, align: 32)
!147 = !DILocation(line: 102, column: 7, scope: !116)
!148 = !DILocation(line: 102, column: 20, scope: !116)
!149 = !DILocalVariable(name: "i", scope: !150, file: !2, line: 103, type: !76, align: 32)
!150 = distinct !DILexicalBlock(scope: !116, file: !2, line: 103, column: 2)
!151 = !DILocation(line: 103, column: 12, scope: !150)
!152 = !DILocation(line: 103, column: 16, scope: !150)
!153 = !DILocation(line: 103, column: 19, scope: !150)
!154 = !DILocation(line: 103, column: 23, scope: !150)
!155 = !DILocalVariable(name: "image_name", scope: !156, file: !2, line: 105, type: !157, align: 64)
!156 = distinct !DILexicalBlock(scope: !150, file: !2, line: 104, column: 2)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 13, baseType: !97, align: 64)
!158 = !DILocation(line: 105, column: 11, scope: !156)
!159 = !DILocation(line: 105, column: 53, scope: !156)
!160 = !DILocation(line: 105, column: 24, scope: !156)
!161 = !DILocation(line: 106, column: 7, scope: !156)
!162 = !DILocation(line: 106, column: 20, scope: !156)
!163 = !DILocation(line: 107, column: 7, scope: !156)
!164 = !DILocation(line: 107, column: 32, scope: !156)
!165 = !DILocation(line: 107, column: 38, scope: !156)
!166 = !DILocation(line: 108, column: 10, scope: !156)
!167 = !DILocation(line: 108, column: 60, scope: !156)
!168 = !DILocation(line: 108, column: 23, scope: !156)
!169 = !DILocation(line: 103, column: 35, scope: !150)
!170 = !DILocation(line: 110, column: 9, scope: !116)
!171 = distinct !DISubprogram(name: "backtrace_load_element", linkageName: "std.os.darwin.backtrace_load_element.20165", scope: !2, file: !2, line: 113, type: !172, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, retainedNodes: !88)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !183, !142, !186, !186}
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !175, identifier: "std.os.backtrace.Backtrace")
!175 = !{!176, !178, !179, !180, !181, !182, !189}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !174, file: !2, line: 11, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !87)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !174, file: !2, line: 12, baseType: !142, size: 128, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !174, file: !2, line: 13, baseType: !142, size: 128, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !174, file: !2, line: 14, baseType: !142, size: 128, align: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !174, file: !2, line: 15, baseType: !76, size: 32, align: 32, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !174, file: !2, line: 16, baseType: !183, size: 128, align: 64, offset: 512)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !184, identifier: "Allocator")
!184 = !{!185, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !183, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !183, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !174, file: !2, line: 17, baseType: !190, size: 8, align: 8, offset: 640)
!190 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!191 = !DILocalVariable(name: "allocator", arg: 1, scope: !171, file: !2, line: 113, type: !183)
!192 = !DILocation(line: 113, column: 48, scope: !171)
!193 = !DILocalVariable(name: "execpath", arg: 2, scope: !171, file: !2, line: 113, type: !142)
!194 = !DILocation(line: 113, column: 66, scope: !171)
!195 = !DILocalVariable(name: "buffer", arg: 3, scope: !171, file: !2, line: 113, type: !186)
!196 = !DILocation(line: 113, column: 82, scope: !171)
!197 = !DILocalVariable(name: "load_address", arg: 4, scope: !171, file: !2, line: 113, type: !186)
!198 = !DILocation(line: 113, column: 96, scope: !171)
!199 = !DILocation(line: 115, column: 6, scope: !171)
!200 = !DILocalVariable(name: "buf", scope: !201, file: !2, line: 117, type: !202, align: 8)
!201 = distinct !DILexicalBlock(scope: !171, file: !2, line: 116, column: 2)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 8192, align: 8, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 1024, lowerBound: 0)
!205 = !DILocation(line: 117, column: 14, scope: !201)
!206 = !DILocalVariable(name: "s", scope: !201, file: !2, line: 118, type: !142, align: 64)
!207 = !DILocation(line: 118, column: 10, scope: !201)
!208 = !DILocation(line: 118, column: 49, scope: !201)
!209 = !DILocation(line: 119, column: 6, scope: !201)
!210 = !DILocation(line: 119, column: 14, scope: !201)
!211 = !DILocation(line: 119, column: 20, scope: !201)
!212 = !DILocation(line: 119, column: 30, scope: !201)
!213 = !DILocation(line: 119, column: 39, scope: !201)
!214 = !DILocation(line: 119, column: 74, scope: !201)
!215 = !DILocation(line: 120, column: 43, scope: !201)
!216 = !DILocation(line: 120, column: 5, scope: !201)
!217 = !DILocation(line: 121, column: 43, scope: !201)
!218 = !DILocation(line: 121, column: 52, scope: !201)
!219 = !DILocation(line: 121, column: 5, scope: !201)
!220 = !DILocation(line: 122, column: 11, scope: !201)
!221 = !DILocation(line: 118, column: 14, scope: !201)
!222 = !DILocalVariable(name: "buffer", scope: !223, file: !2, line: 610, type: !225, align: 8)
!223 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !224, file: !224, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83, retainedNodes: !88)
!224 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 16384, align: 8, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 2048, lowerBound: 0)
!228 = !DILocation(line: 610, column: 14, scope: !223, inlinedAt: !229)
!229 = !DILocation(line: 123, column: 3, scope: !201)
!230 = !DILocalVariable(name: "allocator", scope: !223, file: !2, line: 611, type: !231, align: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !232, identifier: "std.core.mem.allocator.OnStackAllocator")
!232 = !{!233, !234, !235, !236}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !231, file: !2, line: 14, baseType: !183, size: 128, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !231, file: !2, line: 15, baseType: !94, size: 128, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !231, file: !2, line: 16, baseType: !99, size: 64, align: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !231, file: !2, line: 17, baseType: !237, size: 64, align: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !239, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.7818")
!239 = !{!240, !241, !242}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !238, file: !2, line: 22, baseType: !190, size: 8, align: 8)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !238, file: !2, line: 23, baseType: !237, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !2, line: 24, baseType: !186, size: 64, align: 64, offset: 128)
!243 = !DILocation(line: 611, column: 19, scope: !223, inlinedAt: !229)
!244 = !DILocation(line: 612, column: 18, scope: !223, inlinedAt: !229)
!245 = !DILocation(line: 612, column: 26, scope: !223, inlinedAt: !229)
!246 = !DILocation(line: 612, column: 2, scope: !223, inlinedAt: !229)
!247 = !DILocalVariable(name: "mem", scope: !201, file: !2, line: 123, type: !183, align: 64)
!248 = !DILocation(line: 123, column: 30, scope: !201)
!249 = !DILocation(line: 614, column: 8, scope: !250, inlinedAt: !229)
!250 = distinct !DILexicalBlock(scope: !223, file: !224, line: 614, column: 2)
!251 = !DILocalVariable(name: "parts", scope: !252, file: !2, line: 125, type: !253, align: 64)
!252 = distinct !DILexicalBlock(scope: !201, file: !2, line: 124, column: 9)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !254, identifier: "String[]")
!254 = !{!255, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !253, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !253, baseType: !99, size: 64, align: 64, offset: 64)
!258 = !DILocation(line: 125, column: 13, scope: !252)
!259 = !DILocation(line: 125, column: 21, scope: !252)
!260 = !DILocation(line: 125, column: 29, scope: !252)
!261 = !DILocation(line: 126, column: 8, scope: !252)
!262 = !DILocalVariable(name: "path_parts", scope: !263, file: !2, line: 128, type: !253, align: 64)
!263 = distinct !DILexicalBlock(scope: !252, file: !2, line: 127, column: 4)
!264 = !DILocation(line: 128, column: 14, scope: !263)
!265 = !DILocation(line: 128, column: 27, scope: !263)
!266 = !DILocation(line: 128, column: 33, scope: !263)
!267 = !DILocation(line: 128, column: 42, scope: !263)
!268 = !DILocation(line: 130, column: 16, scope: !263)
!269 = !DILocation(line: 131, column: 18, scope: !263)
!270 = !DILocation(line: 131, column: 24, scope: !263)
!271 = !DILocation(line: 131, column: 32, scope: !263)
!272 = !DILocation(line: 132, column: 21, scope: !263)
!273 = !DILocation(line: 132, column: 27, scope: !263)
!274 = !DILocation(line: 132, column: 30, scope: !263)
!275 = !DILocation(line: 132, column: 33, scope: !263)
!276 = !DILocation(line: 133, column: 14, scope: !263)
!277 = !DILocation(line: 133, column: 25, scope: !263)
!278 = !DILocation(line: 133, column: 28, scope: !263)
!279 = !DILocation(line: 134, column: 14, scope: !263)
!280 = !DILocation(line: 134, column: 25, scope: !263)
!281 = !DILocation(line: 134, column: 28, scope: !263)
!282 = !DILocation(line: 134, column: 31, scope: !263)
!283 = !DILocation(line: 613, column: 8, scope: !284, inlinedAt: !229)
!284 = distinct !DILexicalBlock(scope: !223, file: !224, line: 613, column: 8)
!285 = !DILocation(line: 135, column: 19, scope: !263)
!286 = !DILocation(line: 613, column: 8, scope: !287, inlinedAt: !229)
!287 = distinct !DILexicalBlock(scope: !223, file: !224, line: 613, column: 8)
!288 = !DILocation(line: 613, column: 8, scope: !289, inlinedAt: !229)
!289 = distinct !DILexicalBlock(scope: !223, file: !224, line: 613, column: 8)
!290 = !DILocalVariable(name: "info", scope: !171, file: !2, line: 140, type: !291, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Darwin_Dl_info", scope: !2, file: !2, line: 47, size: 256, align: 64, elements: !292, identifier: "std.os.darwin.Darwin_Dl_info")
!292 = !{!293, !294, !295, !296}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fname", scope: !291, file: !2, line: 49, baseType: !157, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fbase", scope: !291, file: !2, line: 50, baseType: !186, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "dli_sname", scope: !291, file: !2, line: 51, baseType: !157, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "dli_saddr", scope: !291, file: !2, line: 52, baseType: !186, size: 64, align: 64, offset: 192)
!297 = !DILocation(line: 140, column: 17, scope: !171)
!298 = !DILocation(line: 141, column: 6, scope: !171)
!299 = !DILocation(line: 141, column: 42, scope: !171)
!300 = !DILocation(line: 141, column: 17, scope: !171)
!301 = !DILocation(line: 141, column: 56, scope: !171)
!302 = !DILocation(line: 143, column: 13, scope: !171)
!303 = !DILocation(line: 144, column: 15, scope: !171)
!304 = !DILocation(line: 144, column: 32, scope: !171)
!305 = !DILocation(line: 144, column: 52, scope: !171)
!306 = !DILocation(line: 144, column: 65, scope: !171)
!307 = !DILocation(line: 145, column: 38, scope: !171)
!308 = !DILocation(line: 145, column: 18, scope: !171)
!309 = !DILocation(line: 146, column: 11, scope: !171)
!310 = !DILocation(line: 147, column: 11, scope: !171)
!311 = !DILocation(line: 148, column: 16, scope: !171)
!312 = distinct !DISubprogram(name: "symbolize_backtrace", linkageName: "std.os.darwin.symbolize_backtrace", scope: !2, file: !2, line: 152, type: !313, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !83, retainedNodes: !88)
!313 = !DISubroutineType(types: !314)
!314 = !{!315, !183, !322}
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{Backtrace}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !316, identifier: "std.collections.list.List$std.os.backtrace.Backtrace$")
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !315, file: !2, line: 20, baseType: !99, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !315, file: !2, line: 21, baseType: !99, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !315, file: !2, line: 22, baseType: !183, size: 128, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !315, file: !2, line: 23, baseType: !321, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64, dwarfAddressSpace: 0)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !323, identifier: "void*[]")
!323 = !{!324, !326}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !322, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !322, baseType: !99, size: 64, align: 64, offset: 64)
!327 = !DILocalVariable(name: "allocator", arg: 1, scope: !312, file: !2, line: 152, type: !183)
!328 = !DILocation(line: 152, column: 49, scope: !312)
!329 = !DILocalVariable(name: "backtrace", arg: 2, scope: !312, file: !2, line: 152, type: !322)
!330 = !DILocation(line: 152, column: 68, scope: !312)
!331 = !DILocalVariable(name: "load_addr", scope: !312, file: !2, line: 154, type: !186, align: 64)
!332 = !DILocation(line: 154, column: 8, scope: !312)
!333 = !DILocation(line: 154, column: 28, scope: !312)
!334 = !DILocalVariable(name: "list", scope: !312, file: !2, line: 155, type: !335, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "BacktraceList", scope: !2, file: !2, line: 88, baseType: !315, align: 64)
!336 = !DILocation(line: 155, column: 16, scope: !312)
!337 = !DILocation(line: 156, column: 23, scope: !312)
!338 = !DILocation(line: 156, column: 2, scope: !312)
!339 = !DILocalVariable(name: "execpath", scope: !312, file: !2, line: 165, type: !142, align: 64)
!340 = !DILocation(line: 165, column: 9, scope: !312)
!341 = !DILocation(line: 165, column: 20, scope: !312)
!342 = !DILocation(line: 159, column: 20, scope: !343)
!343 = distinct !DILexicalBlock(scope: !344, file: !2, line: 159, column: 3)
!344 = distinct !DILexicalBlock(scope: !312, file: !2, line: 158, column: 2)
!345 = !DILocalVariable(name: ".temp", scope: !343, file: !2, line: 159, type: !99, align: 64)
!346 = !DILocalVariable(name: "trace", scope: !347, file: !2, line: 159, type: !174, align: 64)
!347 = distinct !DILexicalBlock(scope: !343, file: !2, line: 160, column: 3)
!348 = !DILocation(line: 159, column: 12, scope: !347)
!349 = !DILocation(line: 393, column: 26, scope: !350, inlinedAt: !348)
!350 = distinct !DILexicalBlock(scope: !352, file: !351, line: 394, column: 1)
!351 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!352 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !351, file: !351, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !83)
!353 = !DILocation(line: 391, column: 11, scope: !350, inlinedAt: !348)
!354 = !DILocation(line: 391, column: 19, scope: !350, inlinedAt: !348)
!355 = !DILocation(line: 159, column: 12, scope: !350, inlinedAt: !348)
!356 = !DILocation(line: 395, column: 9, scope: !352, inlinedAt: !348)
!357 = !DILocation(line: 395, column: 22, scope: !352, inlinedAt: !348)
!358 = !DILocation(line: 161, column: 4, scope: !359)
!359 = distinct !DILexicalBlock(scope: !347, file: !2, line: 160, column: 3)
!360 = !DILocation(line: 163, column: 3, scope: !344)
!361 = !DILocation(line: 166, column: 18, scope: !362)
!362 = distinct !DILexicalBlock(scope: !312, file: !2, line: 166, column: 2)
!363 = !DILocalVariable(name: ".temp", scope: !362, file: !2, line: 166, type: !99, align: 64)
!364 = !DILocalVariable(name: "addr", scope: !365, file: !2, line: 166, type: !186, align: 64)
!365 = distinct !DILexicalBlock(scope: !362, file: !2, line: 167, column: 2)
!366 = !DILocation(line: 166, column: 11, scope: !365)
!367 = !DILocation(line: 166, column: 18, scope: !365)
!368 = !DILocation(line: 168, column: 13, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !2, line: 167, column: 2)
!370 = !DILocation(line: 168, column: 77, scope: !369)
!371 = !DILocation(line: 168, column: 3, scope: !369)
!372 = !DILocation(line: 170, column: 9, scope: !312)
!373 = distinct !DISubprogram(name: "find_first_directory_temp", linkageName: "std.os.darwin.find_first_directory_temp", scope: !86, file: !86, line: 47, type: !374, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !83, retainedNodes: !88)
!374 = !DISubroutineType(types: !375)
!375 = !{!94, !85, !89}
!376 = !DILocalVariable(name: "directory", arg: 1, scope: !373, file: !86, line: 47, type: !85)
!377 = !DILocation(line: 47, column: 60, scope: !373)
