; ModuleID = 'std::crypto::aes'
source_filename = "std::crypto::aes"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%AesKey = type { i64, i32, i32, i64, i64 }
%any = type { ptr, i64 }
%Aes = type { %AesKey, i32, [16 x i8], [256 x i8], [4 x [4 x i8]] }
%"any[]" = type { ptr, i64 }

@"$ct.std.crypto.aes.AesKey" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 32, i64 0, i64 5, [0 x i64] zeroinitializer }, align 8
@"$ct.std.crypto.aes.Aes" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 328, i64 0, i64 5, [0 x i64] zeroinitializer }, align 8
@.enum.ECB = internal constant [4 x i8] c"ECB\00", align 1
@.enum.CBC = internal constant [4 x i8] c"CBC\00", align 1
@.enum.CTR = internal constant [4 x i8] c"CTR\00", align 1
@"$ct.int" = linkonce global %.introspect { i8 2, i64 0, ptr null, i64 4, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.std.crypto.aes.BlockMode" = linkonce global { i8, i64, ptr, i64, i64, i64, [3 x %"char[]"] } { i8 8, i64 0, ptr null, i64 4, i64 ptrtoint (ptr @"$ct.int" to i64), i64 3, [3 x %"char[]"] [%"char[]" { ptr @.enum.ECB, i64 3 }, %"char[]" { ptr @.enum.CBC, i64 3 }, %"char[]" { ptr @.enum.CTR, i64 3 }] }, align 8
@.enum.AES128 = internal constant [7 x i8] c"AES128\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BLOCKLEN", linkageName: "std.crypto.aes.BLOCKLEN", scope: !2, file: !2, line: 38, type: !3, isLocal: false, isDefinition: true, align: 32)
!2 = !DIFile(filename: "aes.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/crypto")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "COLNUM", linkageName: "std.crypto.aes.COLNUM", scope: !2, file: !2, line: 41, type: !3, isLocal: false, isDefinition: true, align: 32)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "SBOX", linkageName: "std.crypto.aes.SBOX", scope: !2, file: !2, line: 379, type: !8, isLocal: true, isDefinition: true, align: 8)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, align: 8, elements: !10)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !{!11}
!11 = !DISubrange(count: 256, lowerBound: 0)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "RSBOX", linkageName: "std.crypto.aes.RSBOX", scope: !2, file: !2, line: 397, type: !8, isLocal: true, isDefinition: true, align: 8)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "RCON", linkageName: "std.crypto.aes.RCON", scope: !2, file: !2, line: 415, type: !16, isLocal: true, isDefinition: true, align: 8)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 88, align: 8, elements: !17)
!17 = !{!18}
!18 = !DISubrange(count: 11, lowerBound: 0)
!19 = !{i32 2, !"Dwarf Version", i32 4}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{i32 2, !"wchar_size", i32 4}
!22 = !{i32 4, !"PIC Level", i32 2}
!23 = !{i32 1, !"uwtable", i32 1}
!24 = !{i32 2, !"frame-pointer", i32 1}
!25 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !26, globals: !60, splitDebugInlining: false)
!26 = !{!27, !55}
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BlockMode", scope: !28, file: !2, line: 49, baseType: !3, size: 32, align: 32, elements: !51)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "Aes", scope: !2, file: !2, line: 78, size: 2624, align: 64, elements: !29, identifier: "std.crypto.aes.Aes")
!29 = !{!30, !40, !41, !45, !46}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !28, file: !2, line: 81, baseType: !31, size: 256, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "AesKey", scope: !28, file: !2, line: 64, size: 256, align: 64, elements: !32, identifier: "std.crypto.aes.AesKey")
!32 = !{!33, !36, !37, !38, !39}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !31, file: !2, line: 67, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !35)
!35 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !31, file: !2, line: 69, baseType: !3, size: 32, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "key_exp_size", scope: !31, file: !2, line: 71, baseType: !3, size: 32, align: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nk", scope: !31, file: !2, line: 73, baseType: !34, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !31, file: !2, line: 75, baseType: !34, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !28, file: !2, line: 83, baseType: !27, size: 32, align: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !28, file: !2, line: 85, baseType: !42, size: 128, align: 8, offset: 288)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, align: 8, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 16, lowerBound: 0)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "round_key", scope: !28, file: !2, line: 87, baseType: !8, size: 2048, align: 8, offset: 416)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !28, file: !2, line: 89, baseType: !47, size: 128, align: 8, offset: 2464)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "AesState", scope: !2, file: !2, line: 91, baseType: !48, align: 8)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, align: 8, elements: !49)
!49 = !{!50, !50}
!50 = !DISubrange(count: 4, lowerBound: 0)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "ECB", value: 0)
!53 = !DIEnumerator(name: "CBC", value: 1)
!54 = !DIEnumerator(name: "CTR", value: 2)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AesType", scope: !2, file: !2, line: 57, baseType: !3, size: 32, align: 32, elements: !56)
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "AES128", value: 0)
!58 = !DIEnumerator(name: "AES192", value: 1)
!59 = !DIEnumerator(name: "AES256", value: 2)
!60 = !{!0, !4, !6, !12, !14}
!61 = distinct !DISubprogram(name: "init", linkageName: "std.crypto.aes.Aes.init", scope: !2, file: !2, line: 104, type: !62, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !70)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !64, !55, !65, !42, !27}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !66, identifier: "char[]")
!66 = !{!67, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !65, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, baseType: !34, size: 64, align: 64, offset: 64)
!70 = !{}
!71 = !DILocation(line: 105, column: 1, scope: !61)
!72 = !DILocalVariable(name: "self", arg: 1, scope: !61, file: !2, line: 104, type: !64)
!73 = !DILocation(line: 104, column: 18, scope: !61)
!74 = !DILocalVariable(name: "type", arg: 2, scope: !61, file: !2, line: 104, type: !55)
!75 = !DILocation(line: 104, column: 33, scope: !61)
!76 = !DILocalVariable(name: "key", arg: 3, scope: !61, file: !2, line: 104, type: !65)
!77 = !DILocation(line: 104, column: 46, scope: !61)
!78 = !DILocalVariable(name: "iv", arg: 4, scope: !61, file: !2, line: 104, type: !42)
!79 = !DILocation(line: 104, column: 66, scope: !61)
!80 = !DILocalVariable(name: "mode", arg: 5, scope: !61, file: !2, line: 104, type: !27)
!81 = !DILocation(line: 104, column: 80, scope: !61)
!82 = !DILocation(line: 102, column: 11, scope: !83)
!83 = distinct !DILexicalBlock(scope: !61, file: !2, line: 105, column: 1)
!84 = !DILocation(line: 102, column: 22, scope: !83)
!85 = !DILocation(line: 106, column: 20, scope: !61)
!86 = !DILocation(line: 106, column: 38, scope: !61)
!87 = !DILocation(line: 106, column: 50, scope: !61)
!88 = !DILocation(line: 106, column: 3, scope: !61)
!89 = !DILocation(line: 107, column: 16, scope: !61)
!90 = !DILocation(line: 107, column: 22, scope: !61)
!91 = !DILocation(line: 107, column: 28, scope: !61)
!92 = !DILocation(line: 589, column: 11, scope: !61)
!93 = !DILocation(line: 589, column: 22, scope: !61)
!94 = !DILocation(line: 107, column: 2, scope: !61)
!95 = !DILocation(line: 108, column: 9, scope: !61)
!96 = distinct !DISubprogram(name: "destroy", linkageName: "std.crypto.aes.Aes.destroy", scope: !2, file: !2, line: 114, type: !97, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !70)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !64}
!99 = !DILocation(line: 115, column: 1, scope: !96)
!100 = !DILocalVariable(name: "self", arg: 1, scope: !96, file: !2, line: 114, type: !64)
!101 = !DILocation(line: 114, column: 21, scope: !96)
!102 = !DILocation(line: 116, column: 3, scope: !96)
!103 = distinct !DISubprogram(name: "encrypt_buffer", linkageName: "std.crypto.aes.Aes.encrypt_buffer", scope: !2, file: !2, line: 140, type: !104, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !70)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !64, !65, !65}
!106 = !DILocation(line: 141, column: 1, scope: !103)
!107 = !DILocalVariable(name: "self", arg: 1, scope: !103, file: !2, line: 140, type: !64)
!108 = !DILocation(line: 140, column: 28, scope: !103)
!109 = !DILocalVariable(name: "in", arg: 2, scope: !103, file: !2, line: 140, type: !65)
!110 = !DILocation(line: 140, column: 42, scope: !103)
!111 = !DILocalVariable(name: "out", arg: 3, scope: !103, file: !2, line: 140, type: !65)
!112 = !DILocation(line: 140, column: 53, scope: !103)
!113 = !DILocation(line: 137, column: 35, scope: !114)
!114 = distinct !DILexicalBlock(scope: !103, file: !2, line: 141, column: 1)
!115 = !DILocation(line: 137, column: 46, scope: !114)
!116 = !DILocation(line: 127, column: 11, scope: !117, inlinedAt: !120)
!117 = distinct !DILexicalBlock(scope: !118, file: !2, line: 127, column: 4)
!118 = distinct !DILexicalBlock(scope: !119, file: !2, line: 124, column: 2)
!119 = distinct !DISubprogram(name: "is_valid_encryption_len", linkageName: "is_valid_encryption_len", scope: !2, file: !2, line: 122, scopeLine: 122, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!120 = !DILocation(line: 137, column: 11, scope: !114)
!121 = !DILocation(line: 130, column: 11, scope: !122, inlinedAt: !120)
!122 = distinct !DILexicalBlock(scope: !118, file: !2, line: 130, column: 4)
!123 = !DILocation(line: 138, column: 11, scope: !114)
!124 = !DILocation(line: 138, column: 22, scope: !114)
!125 = !DILocation(line: 142, column: 10, scope: !126)
!126 = distinct !DILexicalBlock(scope: !103, file: !2, line: 142, column: 2)
!127 = !DILocation(line: 144, column: 41, scope: !128)
!128 = distinct !DILexicalBlock(scope: !126, file: !2, line: 144, column: 13)
!129 = !DILocation(line: 144, column: 13, scope: !128)
!130 = !DILocation(line: 145, column: 42, scope: !131)
!131 = distinct !DILexicalBlock(scope: !126, file: !2, line: 145, column: 13)
!132 = !DILocation(line: 145, column: 13, scope: !131)
!133 = !DILocation(line: 146, column: 42, scope: !134)
!134 = distinct !DILexicalBlock(scope: !126, file: !2, line: 146, column: 13)
!135 = !DILocation(line: 146, column: 13, scope: !134)
!136 = distinct !DISubprogram(name: "decrypt_buffer", linkageName: "std.crypto.aes.Aes.decrypt_buffer", scope: !2, file: !2, line: 156, type: !104, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !70)
!137 = !DILocation(line: 157, column: 1, scope: !136)
!138 = !DILocalVariable(name: "self", arg: 1, scope: !136, file: !2, line: 156, type: !64)
!139 = !DILocation(line: 156, column: 28, scope: !136)
!140 = !DILocalVariable(name: "in", arg: 2, scope: !136, file: !2, line: 156, type: !65)
!141 = !DILocation(line: 156, column: 42, scope: !136)
!142 = !DILocalVariable(name: "out", arg: 3, scope: !136, file: !2, line: 156, type: !65)
!143 = !DILocation(line: 156, column: 53, scope: !136)
!144 = !DILocation(line: 153, column: 35, scope: !145)
!145 = distinct !DILexicalBlock(scope: !136, file: !2, line: 157, column: 1)
!146 = !DILocation(line: 153, column: 46, scope: !145)
!147 = !DILocation(line: 127, column: 11, scope: !148, inlinedAt: !151)
!148 = distinct !DILexicalBlock(scope: !149, file: !2, line: 127, column: 4)
!149 = distinct !DILexicalBlock(scope: !150, file: !2, line: 124, column: 2)
!150 = distinct !DISubprogram(name: "is_valid_encryption_len", linkageName: "is_valid_encryption_len", scope: !2, file: !2, line: 122, scopeLine: 122, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!151 = !DILocation(line: 153, column: 11, scope: !145)
!152 = !DILocation(line: 130, column: 11, scope: !153, inlinedAt: !151)
!153 = distinct !DILexicalBlock(scope: !149, file: !2, line: 130, column: 4)
!154 = !DILocation(line: 154, column: 11, scope: !145)
!155 = !DILocation(line: 154, column: 22, scope: !145)
!156 = !DILocation(line: 158, column: 10, scope: !157)
!157 = distinct !DILexicalBlock(scope: !136, file: !2, line: 158, column: 2)
!158 = !DILocation(line: 160, column: 32, scope: !159)
!159 = distinct !DILexicalBlock(scope: !157, file: !2, line: 160, column: 13)
!160 = !DILocation(line: 160, column: 38, scope: !159)
!161 = !DILocation(line: 160, column: 42, scope: !159)
!162 = !DILocation(line: 271, column: 11, scope: !159)
!163 = !DILocation(line: 271, column: 22, scope: !159)
!164 = !DILocation(line: 160, column: 13, scope: !159)
!165 = !DILocation(line: 161, column: 42, scope: !166)
!166 = distinct !DILexicalBlock(scope: !157, file: !2, line: 161, column: 13)
!167 = !DILocation(line: 161, column: 13, scope: !166)
!168 = !DILocation(line: 162, column: 41, scope: !169)
!169 = distinct !DILexicalBlock(scope: !157, file: !2, line: 162, column: 13)
!170 = !DILocation(line: 162, column: 13, scope: !169)
!171 = distinct !DISubprogram(name: "encrypt", linkageName: "std.crypto.aes.Aes.encrypt", scope: !2, file: !2, line: 173, type: !172, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !70)
!172 = !DISubroutineType(types: !173)
!173 = !{!65, !64, !174, !65}
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !175, identifier: "Allocator")
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !174, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !174, baseType: !179, size: 64, align: 64, offset: 64)
!179 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!180 = !DILocation(line: 174, column: 1, scope: !171)
!181 = !DILocalVariable(name: "self", arg: 1, scope: !171, file: !2, line: 173, type: !64)
!182 = !DILocation(line: 173, column: 23, scope: !171)
!183 = !DILocalVariable(name: "allocator", arg: 2, scope: !171, file: !2, line: 173, type: !174)
!184 = !DILocation(line: 173, column: 40, scope: !171)
!185 = !DILocalVariable(name: "in", arg: 3, scope: !171, file: !2, line: 173, type: !65)
!186 = !DILocation(line: 173, column: 58, scope: !171)
!187 = !DILocation(line: 171, column: 35, scope: !188)
!188 = distinct !DILexicalBlock(scope: !171, file: !2, line: 174, column: 1)
!189 = !DILocation(line: 171, column: 46, scope: !188)
!190 = !DILocation(line: 127, column: 11, scope: !191, inlinedAt: !194)
!191 = distinct !DILexicalBlock(scope: !192, file: !2, line: 127, column: 4)
!192 = distinct !DILexicalBlock(scope: !193, file: !2, line: 124, column: 2)
!193 = distinct !DISubprogram(name: "is_valid_encryption_len", linkageName: "is_valid_encryption_len", scope: !2, file: !2, line: 122, scopeLine: 122, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!194 = !DILocation(line: 171, column: 11, scope: !188)
!195 = !DILocation(line: 130, column: 11, scope: !196, inlinedAt: !194)
!196 = distinct !DILexicalBlock(scope: !192, file: !2, line: 130, column: 4)
!197 = !DILocalVariable(name: "out", scope: !171, file: !2, line: 175, type: !65, align: 64)
!198 = !DILocation(line: 175, column: 9, scope: !171)
!199 = !DILocation(line: 175, column: 55, scope: !171)
!200 = !DILocation(line: 304, column: 55, scope: !201, inlinedAt: !203)
!201 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !202, file: !202, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!202 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!203 = !DILocation(line: 287, column: 9, scope: !204, inlinedAt: !205)
!204 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !202, file: !202, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!205 = !DILocation(line: 175, column: 15, scope: !171)
!206 = !DILocation(line: 304, column: 40, scope: !201, inlinedAt: !203)
!207 = !DILocation(line: 80, column: 6, scope: !208, inlinedAt: !209)
!208 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !202, file: !202, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!209 = !DILocation(line: 304, column: 18, scope: !201, inlinedAt: !203)
!210 = !DILocation(line: 80, column: 20, scope: !208, inlinedAt: !209)
!211 = !DILocation(line: 86, column: 28, scope: !208, inlinedAt: !209)
!212 = !DILocation(line: 38, column: 12, scope: !208, inlinedAt: !209)
!213 = !DILocation(line: 1039, column: 9, scope: !214, inlinedAt: !216)
!214 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !215, file: !215, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!215 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!216 = !DILocation(line: 38, column: 26, scope: !208, inlinedAt: !209)
!217 = !DILocation(line: 1039, column: 20, scope: !214, inlinedAt: !216)
!218 = !DILocation(line: 1039, column: 25, scope: !214, inlinedAt: !216)
!219 = !DILocation(line: 1039, column: 19, scope: !214, inlinedAt: !216)
!220 = !DILocation(line: 86, column: 10, scope: !208, inlinedAt: !209)
!221 = !DILocation(line: 304, column: 67, scope: !201, inlinedAt: !203)
!222 = !DILocation(line: 304, column: 9, scope: !201, inlinedAt: !203)
!223 = !DILocation(line: 176, column: 2, scope: !171)
!224 = !DILocation(line: 176, column: 22, scope: !171)
