; ModuleID = 'std::encoding::codepage'
source_filename = "std::encoding::codepage"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%CodePageTable = type { [1024 x i8], [1024 x i8] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"int[]" = type { ptr, i64 }
%"uint[]" = type { ptr, i64 }

@"$ct.std.encoding.codepage.CodePageTable" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 2048, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@.enum.CP1250 = internal constant [7 x i8] c"CP1250\00", align 1
@.enum.CP1251 = internal constant [7 x i8] c"CP1251\00", align 1
@.enum.CP1252 = internal constant [7 x i8] c"CP1252\00", align 1
@.enum.CP1253 = internal constant [7 x i8] c"CP1253\00", align 1
@.enum.CP1254 = internal constant [7 x i8] c"CP1254\00", align 1
@.enum.CP1255 = internal constant [7 x i8] c"CP1255\00", align 1
@.enum.CP1256 = internal constant [7 x i8] c"CP1256\00", align 1
@.enum.CP1257 = internal constant [7 x i8] c"CP1257\00", align 1
@.enum.CP1258 = internal constant [7 x i8] c"CP1258\00", align 1
@.enum.CP437 = internal constant [6 x i8] c"CP437\00", align 1
@.enum.CP737 = internal constant [6 x i8] c"CP737\00", align 1
@.enum.CP775 = internal constant [6 x i8] c"CP775\00", align 1
@.enum.CP850 = internal constant [6 x i8] c"CP850\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "REPLACEMENT_CHAR", linkageName: "std.encoding.codepage.REPLACEMENT_CHAR", scope: !2, file: !2, line: 30, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "codepage.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/encoding")
!3 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "MASK", linkageName: "std.encoding.codepage.MASK", scope: !2, file: !2, line: 169, type: !6, isLocal: true, isDefinition: true, align: 32)
!6 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "CP1250", linkageName: "std.encoding.codepage.CP1250", scope: !9, file: !9, line: 18, type: !10, isLocal: true, isDefinition: true, align: 8)
!9 = !DIFile(filename: "codepage_private.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/encoding")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "CodePageTable", scope: !2, file: !2, line: 63, size: 16384, align: 8, elements: !11, identifier: "std.encoding.codepage.CodePageTable")
!11 = !{!12, !16}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "to_codepoint", scope: !10, file: !2, line: 65, baseType: !13, size: 8192, align: 8)
!13 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 8192, align: 8, elements: !14)
!14 = !{!15}
!15 = !DISubrange(count: 1024, lowerBound: 0)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "from_codepoint", scope: !10, file: !2, line: 66, baseType: !13, size: 8192, align: 8, offset: 8192)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "CP1251", linkageName: "std.encoding.codepage.CP1251", scope: !9, file: !9, line: 70, type: !10, isLocal: true, isDefinition: true, align: 8)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "CP1252", linkageName: "std.encoding.codepage.CP1252", scope: !9, file: !9, line: 122, type: !10, isLocal: true, isDefinition: true, align: 8)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "CP1253", linkageName: "std.encoding.codepage.CP1253", scope: !9, file: !9, line: 174, type: !10, isLocal: true, isDefinition: true, align: 8)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "CP1254", linkageName: "std.encoding.codepage.CP1254", scope: !9, file: !9, line: 226, type: !10, isLocal: true, isDefinition: true, align: 8)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "CP1255", linkageName: "std.encoding.codepage.CP1255", scope: !9, file: !9, line: 278, type: !10, isLocal: true, isDefinition: true, align: 8)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "CP1256", linkageName: "std.encoding.codepage.CP1256", scope: !9, file: !9, line: 330, type: !10, isLocal: true, isDefinition: true, align: 8)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "CP1257", linkageName: "std.encoding.codepage.CP1257", scope: !9, file: !9, line: 382, type: !10, isLocal: true, isDefinition: true, align: 8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "CP1258", linkageName: "std.encoding.codepage.CP1258", scope: !9, file: !9, line: 434, type: !10, isLocal: true, isDefinition: true, align: 8)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "CP437", linkageName: "std.encoding.codepage.CP437", scope: !9, file: !9, line: 487, type: !10, isLocal: true, isDefinition: true, align: 8)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "CP737", linkageName: "std.encoding.codepage.CP737", scope: !9, file: !9, line: 540, type: !10, isLocal: true, isDefinition: true, align: 8)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "CP775", linkageName: "std.encoding.codepage.CP775", scope: !9, file: !9, line: 593, type: !10, isLocal: true, isDefinition: true, align: 8)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "CP850", linkageName: "std.encoding.codepage.CP850", scope: !9, file: !9, line: 646, type: !10, isLocal: true, isDefinition: true, align: 8)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "CP852", linkageName: "std.encoding.codepage.CP852", scope: !9, file: !9, line: 699, type: !10, isLocal: true, isDefinition: true, align: 8)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "CP855", linkageName: "std.encoding.codepage.CP855", scope: !9, file: !9, line: 752, type: !10, isLocal: true, isDefinition: true, align: 8)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "CP857", linkageName: "std.encoding.codepage.CP857", scope: !9, file: !9, line: 805, type: !10, isLocal: true, isDefinition: true, align: 8)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "CP860", linkageName: "std.encoding.codepage.CP860", scope: !9, file: !9, line: 858, type: !10, isLocal: true, isDefinition: true, align: 8)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "CP861", linkageName: "std.encoding.codepage.CP861", scope: !9, file: !9, line: 911, type: !10, isLocal: true, isDefinition: true, align: 8)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "CP862", linkageName: "std.encoding.codepage.CP862", scope: !9, file: !9, line: 964, type: !10, isLocal: true, isDefinition: true, align: 8)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "CP863", linkageName: "std.encoding.codepage.CP863", scope: !9, file: !9, line: 1017, type: !10, isLocal: true, isDefinition: true, align: 8)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "CP864", linkageName: "std.encoding.codepage.CP864", scope: !9, file: !9, line: 1070, type: !10, isLocal: true, isDefinition: true, align: 8)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "CP865", linkageName: "std.encoding.codepage.CP865", scope: !9, file: !9, line: 1123, type: !10, isLocal: true, isDefinition: true, align: 8)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "CP866", linkageName: "std.encoding.codepage.CP866", scope: !9, file: !9, line: 1176, type: !10, isLocal: true, isDefinition: true, align: 8)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "CP869", linkageName: "std.encoding.codepage.CP869", scope: !9, file: !9, line: 1229, type: !10, isLocal: true, isDefinition: true, align: 8)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "CP874", linkageName: "std.encoding.codepage.CP874", scope: !9, file: !9, line: 1281, type: !10, isLocal: true, isDefinition: true, align: 8)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "ISO_8859_1", linkageName: "std.encoding.codepage.ISO_8859_1", scope: !9, file: !9, line: 1338, type: !10, isLocal: true, isDefinition: true, align: 8)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "ISO_8859_10", linkageName: "std.encoding.codepage.ISO_8859_10", scope: !9, file: !9, line: 1395, type: !10, isLocal: true, isDefinition: true, align: 8)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "ISO_8859_11", linkageName: "std.encoding.codepage.ISO_8859_11", scope: !9, file: !9, line: 1452, type: !10, isLocal: true, isDefinition: true, align: 8)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "ISO_8859_13", linkageName: "std.encoding.codepage.ISO_8859_13", scope: !9, file: !9, line: 1509, type: !10, isLocal: true, isDefinition: true, align: 8)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "ISO_8859_14", linkageName: "std.encoding.codepage.ISO_8859_14", scope: !9, file: !9, line: 1567, type: !10, isLocal: true, isDefinition: true, align: 8)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "ISO_8859_15", linkageName: "std.encoding.codepage.ISO_8859_15", scope: !9, file: !9, line: 1625, type: !10, isLocal: true, isDefinition: true, align: 8)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "ISO_8859_16", linkageName: "std.encoding.codepage.ISO_8859_16", scope: !9, file: !9, line: 1682, type: !10, isLocal: true, isDefinition: true, align: 8)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "ISO_8859_2", linkageName: "std.encoding.codepage.ISO_8859_2", scope: !9, file: !9, line: 1739, type: !10, isLocal: true, isDefinition: true, align: 8)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "ISO_8859_3", linkageName: "std.encoding.codepage.ISO_8859_3", scope: !9, file: !9, line: 1796, type: !10, isLocal: true, isDefinition: true, align: 8)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "ISO_8859_4", linkageName: "std.encoding.codepage.ISO_8859_4", scope: !9, file: !9, line: 1853, type: !10, isLocal: true, isDefinition: true, align: 8)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "ISO_8859_5", linkageName: "std.encoding.codepage.ISO_8859_5", scope: !9, file: !9, line: 1910, type: !10, isLocal: true, isDefinition: true, align: 8)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "ISO_8859_6", linkageName: "std.encoding.codepage.ISO_8859_6", scope: !9, file: !9, line: 1967, type: !10, isLocal: true, isDefinition: true, align: 8)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "ISO_8859_7", linkageName: "std.encoding.codepage.ISO_8859_7", scope: !9, file: !9, line: 2024, type: !10, isLocal: true, isDefinition: true, align: 8)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "ISO_8859_8", linkageName: "std.encoding.codepage.ISO_8859_8", scope: !9, file: !9, line: 2081, type: !10, isLocal: true, isDefinition: true, align: 8)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "ISO_8859_9", linkageName: "std.encoding.codepage.ISO_8859_9", scope: !9, file: !9, line: 2138, type: !10, isLocal: true, isDefinition: true, align: 8)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "US_ASCII", linkageName: "std.encoding.codepage.US_ASCII", scope: !9, file: !9, line: 2192, type: !10, isLocal: true, isDefinition: true, align: 8)
!97 = !{i32 2, !"Dwarf Version", i32 4}
!98 = !{i32 2, !"Debug Info Version", i32 3}
!99 = !{i32 2, !"wchar_size", i32 4}
!100 = !{i32 4, !"PIC Level", i32 2}
!101 = !{i32 1, !"uwtable", i32 1}
!102 = !{i32 2, !"frame-pointer", i32 1}
!103 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, globals: !149, splitDebugInlining: false)
!104 = !{!105}
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CodePage", scope: !2, file: !2, line: 69, baseType: !106, size: 32, align: 32, elements: !107)
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!108 = !DIEnumerator(name: "CP1250", value: 0)
!109 = !DIEnumerator(name: "CP1251", value: 1)
!110 = !DIEnumerator(name: "CP1252", value: 2)
!111 = !DIEnumerator(name: "CP1253", value: 3)
!112 = !DIEnumerator(name: "CP1254", value: 4)
!113 = !DIEnumerator(name: "CP1255", value: 5)
!114 = !DIEnumerator(name: "CP1256", value: 6)
!115 = !DIEnumerator(name: "CP1257", value: 7)
!116 = !DIEnumerator(name: "CP1258", value: 8)
!117 = !DIEnumerator(name: "CP437", value: 9)
!118 = !DIEnumerator(name: "CP737", value: 10)
!119 = !DIEnumerator(name: "CP775", value: 11)
!120 = !DIEnumerator(name: "CP850", value: 12)
!121 = !DIEnumerator(name: "CP852", value: 13)
!122 = !DIEnumerator(name: "CP855", value: 14)
!123 = !DIEnumerator(name: "CP857", value: 15)
!124 = !DIEnumerator(name: "CP860", value: 16)
!125 = !DIEnumerator(name: "CP861", value: 17)
!126 = !DIEnumerator(name: "CP862", value: 18)
!127 = !DIEnumerator(name: "CP863", value: 19)
!128 = !DIEnumerator(name: "CP864", value: 20)
!129 = !DIEnumerator(name: "CP865", value: 21)
!130 = !DIEnumerator(name: "CP866", value: 22)
!131 = !DIEnumerator(name: "CP869", value: 23)
!132 = !DIEnumerator(name: "CP874", value: 24)
!133 = !DIEnumerator(name: "ISO_8859_1", value: 25)
!134 = !DIEnumerator(name: "ISO_8859_10", value: 26)
!135 = !DIEnumerator(name: "ISO_8859_11", value: 27)
!136 = !DIEnumerator(name: "ISO_8859_13", value: 28)
!137 = !DIEnumerator(name: "ISO_8859_14", value: 29)
!138 = !DIEnumerator(name: "ISO_8859_15", value: 30)
!139 = !DIEnumerator(name: "ISO_8859_16", value: 31)
!140 = !DIEnumerator(name: "ISO_8859_2", value: 32)
!141 = !DIEnumerator(name: "ISO_8859_3", value: 33)
!142 = !DIEnumerator(name: "ISO_8859_4", value: 34)
!143 = !DIEnumerator(name: "ISO_8859_5", value: 35)
!144 = !DIEnumerator(name: "ISO_8859_6", value: 36)
!145 = !DIEnumerator(name: "ISO_8859_7", value: 37)
!146 = !DIEnumerator(name: "ISO_8859_8", value: 38)
!147 = !DIEnumerator(name: "ISO_8859_9", value: 39)
!148 = !DIEnumerator(name: "US_ASCII", value: 40)
!149 = !{!0, !4, !7, !17, !19, !21, !23, !25, !27, !29, !31, !33, !35, !37, !39, !41, !43, !45, !47, !49, !51, !53, !55, !57, !59, !61, !63, !65, !67, !69, !71, !73, !75, !77, !79, !81, !83, !85, !87, !89, !91, !93, !95}
!150 = distinct !DISubprogram(name: "by_name", linkageName: "std.encoding.codepage.by_name", scope: !2, file: !2, line: 122, type: !151, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !103, retainedNodes: !161)
!151 = !DISubroutineType(types: !152)
!152 = !{!106, !153}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !155, identifier: "char[]")
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !154, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !154, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !160)
!160 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!161 = !{}
!162 = !DILocalVariable(name: "charset_name", arg: 1, scope: !150, file: !2, line: 122, type: !153)
!163 = !DILocation(line: 122, column: 29, scope: !150)
!164 = !DILocalVariable(name: "state", scope: !165, file: !2, line: 679, type: !167, align: 64)
!165 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !166, file: !166, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103, retainedNodes: !161)
!166 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 496, baseType: !168, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64, dwarfAddressSpace: 0)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !170, identifier: "std.core.mem.allocator.TempAllocator")
!170 = !{!171, !178, !190, !191, !193, !194, !195, !196, !197, !198, !199}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !169, file: !2, line: 33, baseType: !172, size: 128, align: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !173, identifier: "Allocator")
!173 = !{!174, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !172, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !172, baseType: !177, size: 64, align: 64, offset: 64)
!177 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !169, file: !2, line: 34, baseType: !179, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64, dwarfAddressSpace: 0)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !181, identifier: "std.core.mem.allocator.TempAllocatorPage")
!181 = !{!182, !183, !184, !185, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !180, file: !2, line: 56, baseType: !179, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !180, file: !2, line: 57, baseType: !175, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !180, file: !2, line: 58, baseType: !159, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !180, file: !2, line: 59, baseType: !159, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !180, file: !2, line: 60, baseType: !187, align: 8, offset: 256)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, align: 8, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 0, lowerBound: 0)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !169, file: !2, line: 35, baseType: !168, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !169, file: !2, line: 36, baseType: !192, size: 8, align: 8, offset: 256)
!192 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !169, file: !2, line: 37, baseType: !159, size: 64, align: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !169, file: !2, line: 38, baseType: !159, size: 64, align: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !169, file: !2, line: 39, baseType: !159, size: 64, align: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !169, file: !2, line: 40, baseType: !159, size: 64, align: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !169, file: !2, line: 41, baseType: !159, size: 64, align: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !169, file: !2, line: 42, baseType: !159, size: 64, align: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !169, file: !2, line: 43, baseType: !187, align: 8, offset: 704)
!200 = !DILocation(line: 679, column: 12, scope: !165, inlinedAt: !201)
!201 = !DILocation(line: 122, column: 46, scope: !150)
!202 = !DILocation(line: 679, column: 41, scope: !165, inlinedAt: !201)
!203 = !DILocation(line: 679, column: 20, scope: !165, inlinedAt: !201)
!204 = !DILocalVariable(name: "name", scope: !205, file: !2, line: 124, type: !153, align: 64)
!205 = distinct !DILexicalBlock(scope: !150, file: !2, line: 123, column: 1)
!206 = !DILocation(line: 124, column: 9, scope: !205)
!207 = !DILocation(line: 124, column: 42, scope: !205)
!208 = !DILocation(line: 124, column: 16, scope: !205)
!209 = !DILocation(line: 125, column: 2, scope: !205)
!210 = !DILocation(line: 126, column: 18, scope: !211)
!211 = distinct !DILexicalBlock(scope: !205, file: !2, line: 126, column: 2)
!212 = !DILocalVariable(name: ".temp", scope: !211, file: !2, line: 126, type: !159, align: 64)
!213 = !DILocalVariable(name: "page", scope: !214, file: !2, line: 126, type: !105, align: 32)
!214 = distinct !DILexicalBlock(scope: !211, file: !2, line: 127, column: 2)
!215 = !DILocation(line: 126, column: 11, scope: !214)
!216 = !DILocation(line: 126, column: 18, scope: !214)
!217 = !DILocation(line: 128, column: 7, scope: !218)
!218 = distinct !DILexicalBlock(scope: !214, file: !2, line: 127, column: 2)
!219 = !DILocation(line: 128, column: 20, scope: !218)
!220 = !DILocation(line: 128, column: 41, scope: !218)
!221 = !DILocation(line: 682, column: 23, scope: !222, inlinedAt: !201)
!222 = distinct !DILexicalBlock(scope: !165, file: !166, line: 681, column: 2)
!223 = !DILocation(line: 682, column: 3, scope: !222, inlinedAt: !201)
!224 = !DILocation(line: 682, column: 23, scope: !225, inlinedAt: !201)
!225 = distinct !DILexicalBlock(scope: !165, file: !166, line: 681, column: 2)
!226 = !DILocation(line: 682, column: 3, scope: !225, inlinedAt: !201)
!227 = distinct !DISubprogram(name: "decode", linkageName: "std.encoding.codepage.decode", scope: !2, file: !2, line: 133, type: !228, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !103, retainedNodes: !161)
!228 = !DISubroutineType(types: !229)
!229 = !{!154, !172, !154, !105}
!230 = !DILocalVariable(name: "allocator", arg: 1, scope: !227, file: !2, line: 133, type: !172)
!231 = !DILocation(line: 133, column: 29, scope: !227)
!232 = !DILocalVariable(name: "src", arg: 2, scope: !227, file: !2, line: 133, type: !154)
!233 = !DILocation(line: 133, column: 47, scope: !227)
!234 = !DILocalVariable(name: "code_page", arg: 3, scope: !227, file: !2, line: 133, type: !105)
!235 = !DILocation(line: 133, column: 61, scope: !227)
!236 = !DILocalVariable(name: "dst", scope: !227, file: !2, line: 135, type: !154, align: 64)
!237 = !DILocation(line: 135, column: 9, scope: !227)
!238 = !DILocation(line: 135, column: 71, scope: !227)
!239 = !DILocation(line: 135, column: 55, scope: !227)
!240 = !DILocation(line: 304, column: 55, scope: !241, inlinedAt: !243)
!241 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !242, file: !242, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103)
!242 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!243 = !DILocation(line: 287, column: 9, scope: !244, inlinedAt: !245)
!244 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !242, file: !242, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103)
!245 = !DILocation(line: 135, column: 15, scope: !227)
!246 = !DILocation(line: 304, column: 40, scope: !241, inlinedAt: !243)
!247 = !DILocation(line: 80, column: 6, scope: !248, inlinedAt: !249)
