; ModuleID = 'std::core::builtin'
source_filename = "std::core::builtin"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"void*[]" = type { ptr, i64 }
%"List{Backtrace}" = type { i64, i64, %any, ptr }

@"$ct.std.core.builtin.EmptySlot" = linkonce global %.introspect { i8 18, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.p$void" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.p$void" = linkonce global %.introspect { i8 19, i64 0, ptr null, i64 8, i64 ptrtoint (ptr @"$ct.void" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.void" = linkonce global %.introspect { i8 0, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@.enum.NO_LOCALITY = internal constant [12 x i8] c"NO_LOCALITY\00", align 1
@.enum.FAR = internal constant [4 x i8] c"FAR\00", align 1
@.enum.NEAR = internal constant [5 x i8] c"NEAR\00", align 1
@.enum.VERY_NEAR = internal constant [10 x i8] c"VERY_NEAR\00", align 1
@"$ct.int" = linkonce global %.introspect { i8 2, i64 0, ptr null, i64 4, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EMPTY_MACRO_SLOT", linkageName: "std.core.builtin.EMPTY_MACRO_SLOT", scope: !2, file: !2, line: 27, type: !3, isLocal: false, isDefinition: true, align: 64)
!2 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmptySlot", scope: !2, file: !2, line: 29, baseType: !4, align: 64)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "in_panic", linkageName: "std.core.builtin.in_panic", scope: !2, file: !2, line: 232, type: !7, isLocal: true, isDefinition: true, align: 8)
!7 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "panic", linkageName: "std.core.builtin.panic", scope: !2, file: !2, line: 255, type: !10, isLocal: false, isDefinition: true, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 253, baseType: !11, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DISubroutineType(types: !13)
!13 = !{null, !14, !14, !14, !23}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !16, identifier: "char[]")
!16 = !{!17, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !22)
!22 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "MAX_FRAMEADDRESS", linkageName: "std.core.builtin.MAX_FRAMEADDRESS", scope: !2, file: !2, line: 716, type: !26, isLocal: false, isDefinition: true, align: 32)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{i32 2, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 2, !"wchar_size", i32 4}
!30 = !{i32 4, !"PIC Level", i32 2}
!31 = !{i32 1, !"uwtable", i32 1}
!32 = !{i32 2, !"frame-pointer", i32 1}
!33 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !34, splitDebugInlining: false)
!34 = !{!0, !5, !8, !24}
!35 = distinct !DISubprogram(name: "panicf", linkageName: "std.core.builtin.panicf", scope: !2, file: !2, line: 257, type: !36, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !48)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !14, !14, !14, !23, !38}
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !39, identifier: "any[]")
!39 = !{!40, !47}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !38, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !43, identifier: "any")
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !4, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !38, baseType: !21, size: 64, align: 64, offset: 64)
!48 = !{}
!49 = !DILocalVariable(name: "fmt", arg: 1, scope: !35, file: !2, line: 257, type: !14)
!50 = !DILocation(line: 257, column: 23, scope: !35)
!51 = !DILocalVariable(name: "file", arg: 2, scope: !35, file: !2, line: 257, type: !14)
!52 = !DILocation(line: 257, column: 35, scope: !35)
!53 = !DILocalVariable(name: "function", arg: 3, scope: !35, file: !2, line: 257, type: !14)
!54 = !DILocation(line: 257, column: 48, scope: !35)
!55 = !DILocalVariable(name: "line", arg: 4, scope: !35, file: !2, line: 257, type: !23)
!56 = !DILocation(line: 257, column: 63, scope: !35)
!57 = !DILocalVariable(name: "args", arg: 5, scope: !35, file: !2, line: 257, type: !38)
!58 = !DILocation(line: 257, column: 69, scope: !35)
!59 = !DILocation(line: 260, column: 7, scope: !35)
!60 = !DILocation(line: 272, column: 15, scope: !61, inlinedAt: !63)
!61 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !62, file: !62, line: 270, scopeLine: 270, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!62 = !DIFile(filename: "io.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io")
!63 = !DILocation(line: 262, column: 4, scope: !64)
!64 = distinct !DILexicalBlock(scope: !35, file: !2, line: 261, column: 3)
!65 = !DILocation(line: 182, column: 24, scope: !66, inlinedAt: !67)
!66 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !62, file: !62, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!67 = !DILocation(line: 272, column: 2, scope: !61, inlinedAt: !63)
!68 = !DILocation(line: 182, column: 34, scope: !66, inlinedAt: !67)
!69 = !DILocation(line: 167, column: 11, scope: !66, inlinedAt: !67)
!70 = !DILocation(line: 282, column: 16, scope: !71, inlinedAt: !72)
!71 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !62, file: !62, line: 280, scopeLine: 280, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!72 = !DILocation(line: 263, column: 4, scope: !64)
!73 = !DILocalVariable(name: "len", scope: !74, file: !2, line: 238, type: !21, align: 64)
!74 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !62, file: !62, line: 236, scopeLine: 236, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!75 = !DILocation(line: 238, column: 6, scope: !74, inlinedAt: !76)
!76 = !DILocation(line: 282, column: 2, scope: !71, inlinedAt: !72)
!77 = !DILocation(line: 182, column: 24, scope: !78, inlinedAt: !79)
!78 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !62, file: !62, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!79 = !DILocation(line: 238, column: 12, scope: !74, inlinedAt: !76)
!80 = !DILocation(line: 182, column: 34, scope: !78, inlinedAt: !79)
!81 = !DILocation(line: 167, column: 11, scope: !78, inlinedAt: !79)
!82 = !DILocation(line: 239, column: 2, scope: !74, inlinedAt: !76)
!83 = !DILocation(line: 108, column: 11, scope: !74, inlinedAt: !76)
!84 = !DILocation(line: 244, column: 4, scope: !74, inlinedAt: !76)
!85 = !DILocation(line: 247, column: 11, scope: !74, inlinedAt: !76)
!86 = !DILocation(line: 246, column: 9, scope: !74, inlinedAt: !76)
!87 = !DILocation(line: 264, column: 10, scope: !64)
!88 = !DILocation(line: 266, column: 14, scope: !35)
!89 = !DILocalVariable(name: "buffer", scope: !90, file: !2, line: 610, type: !92, align: 8)
!90 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !91, file: !91, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!91 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 4096, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 512, lowerBound: 0)
!95 = !DILocation(line: 610, column: 14, scope: !90, inlinedAt: !96)
!96 = !DILocation(line: 267, column: 3, scope: !35)
!97 = !DILocalVariable(name: "allocator", scope: !90, file: !2, line: 611, type: !98, align: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !99, identifier: "std.core.mem.allocator.OnStackAllocator")
!99 = !{!100, !105, !106, !107}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !98, file: !2, line: 14, baseType: !101, size: 128, align: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !102, identifier: "Allocator")
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !101, baseType: !4, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, baseType: !46, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !2, line: 15, baseType: !15, size: 128, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !98, file: !2, line: 16, baseType: !21, size: 64, align: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !98, file: !2, line: 17, baseType: !108, size: 64, align: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64, dwarfAddressSpace: 0)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !110, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.7818")
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !109, file: !2, line: 22, baseType: !7, size: 8, align: 8)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !2, line: 23, baseType: !108, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !2, line: 24, baseType: !4, size: 64, align: 64, offset: 128)
!114 = !DILocation(line: 611, column: 19, scope: !90, inlinedAt: !96)
!115 = !DILocation(line: 612, column: 18, scope: !90, inlinedAt: !96)
!116 = !DILocation(line: 612, column: 26, scope: !90, inlinedAt: !96)
!117 = !DILocation(line: 612, column: 2, scope: !90, inlinedAt: !96)
!118 = !DILocalVariable(name: "allocator", scope: !35, file: !2, line: 267, type: !101, align: 64)
!119 = !DILocation(line: 267, column: 29, scope: !35)
!120 = !DILocation(line: 614, column: 8, scope: !121, inlinedAt: !96)
!121 = distinct !DILexicalBlock(scope: !90, file: !91, line: 614, column: 2)
!122 = !DILocalVariable(name: "s", scope: !123, file: !2, line: 269, type: !124, align: 64)
!123 = distinct !DILexicalBlock(scope: !35, file: !2, line: 268, column: 3)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !125, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 8)
!127 = !DILocation(line: 269, column: 12, scope: !123)
!128 = !DILocation(line: 270, column: 11, scope: !123)
!129 = !DILocation(line: 18, column: 12, scope: !123)
!130 = !DILocation(line: 18, column: 11, scope: !123)
!131 = !DILocation(line: 270, column: 4, scope: !123)
!132 = !DILocation(line: 271, column: 4, scope: !123)
!133 = !DILocation(line: 272, column: 15, scope: !123)
!134 = !DILocation(line: 273, column: 4, scope: !123)
!135 = !DILocation(line: 273, column: 10, scope: !123)
!136 = !DILocation(line: 273, column: 40, scope: !123)
!137 = !DILocation(line: 613, column: 8, scope: !138, inlinedAt: !96)
!138 = distinct !DILexicalBlock(scope: !90, file: !91, line: 613, column: 8)
!139 = distinct !DISubprogram(name: "print_backtrace", linkageName: "std.core.builtin.print_backtrace", scope: !2, file: !2, line: 176, type: !140, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !48)
!140 = !DISubroutineType(types: !141)
!141 = !{!7, !14, !26, !4}
!142 = !DILocalVariable(name: "message", arg: 1, scope: !139, file: !2, line: 176, type: !14)
!143 = !DILocation(line: 176, column: 32, scope: !139)
!144 = !DILocalVariable(name: "backtraces_to_ignore", arg: 2, scope: !139, file: !2, line: 176, type: !26)
!145 = !DILocation(line: 176, column: 45, scope: !139)
!146 = !DILocalVariable(name: "added_backtrace", arg: 3, scope: !139, file: !2, line: 176, type: !4)
!147 = !DILocation(line: 176, column: 73, scope: !139)
!148 = !DILocalVariable(name: "buffer", scope: !149, file: !2, line: 610, type: !150, align: 8)
!149 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !91, file: !91, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 34816, align: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 4352, lowerBound: 0)
!153 = !DILocation(line: 610, column: 14, scope: !149, inlinedAt: !154)
!154 = !DILocation(line: 176, column: 129, scope: !139)
!155 = !DILocalVariable(name: "allocator", scope: !149, file: !2, line: 611, type: !98, align: 64)
!156 = !DILocation(line: 611, column: 19, scope: !149, inlinedAt: !154)
!157 = !DILocation(line: 612, column: 18, scope: !149, inlinedAt: !154)
!158 = !DILocation(line: 612, column: 26, scope: !149, inlinedAt: !154)
!159 = !DILocation(line: 612, column: 2, scope: !149, inlinedAt: !154)
!160 = !DILocalVariable(name: "smem", scope: !139, file: !2, line: 176, type: !101, align: 64)
!161 = !DILocation(line: 176, column: 158, scope: !139)
!162 = !DILocation(line: 614, column: 8, scope: !163, inlinedAt: !154)
!163 = distinct !DILexicalBlock(scope: !149, file: !91, line: 614, column: 2)
!164 = !DILocalVariable(name: "buffer", scope: !165, file: !2, line: 178, type: !166, align: 64)
!165 = distinct !DILexicalBlock(scope: !139, file: !2, line: 177, column: 1)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 64, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 256, lowerBound: 0)
!169 = !DILocation(line: 178, column: 13, scope: !165)
!170 = !DILocalVariable(name: "backtraces", scope: !165, file: !2, line: 179, type: !171, align: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !172, identifier: "void*[]")
!172 = !{!173, !175}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !171, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !171, baseType: !21, size: 64, align: 64, offset: 64)
!176 = !DILocation(line: 179, column: 10, scope: !165)
!177 = !DILocation(line: 179, column: 51, scope: !165)
!178 = !DILocation(line: 179, column: 23, scope: !165)
!179 = !DILocation(line: 180, column: 6, scope: !165)
!180 = !DILocation(line: 182, column: 3, scope: !181)
!181 = distinct !DILexicalBlock(scope: !165, file: !2, line: 181, column: 2)
!182 = !DILocation(line: 182, column: 16, scope: !181)
!183 = !DILocation(line: 182, column: 14, scope: !181)
!184 = !DILocalVariable(name: "buffer", scope: !185, file: !2, line: 610, type: !186, align: 8)
!185 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !91, file: !91, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32768, align: 8, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 4096, lowerBound: 0)
!189 = !DILocation(line: 610, column: 14, scope: !185, inlinedAt: !190)
!190 = !DILocation(line: 184, column: 2, scope: !165)
!191 = !DILocalVariable(name: "allocator", scope: !185, file: !2, line: 611, type: !98, align: 64)
!192 = !DILocation(line: 611, column: 19, scope: !185, inlinedAt: !190)
!193 = !DILocation(line: 612, column: 18, scope: !185, inlinedAt: !190)
!194 = !DILocation(line: 612, column: 26, scope: !185, inlinedAt: !190)
!195 = !DILocation(line: 612, column: 2, scope: !185, inlinedAt: !190)
!196 = !DILocalVariable(name: "mem", scope: !165, file: !2, line: 184, type: !101, align: 64)
!197 = !DILocation(line: 184, column: 29, scope: !165)
!198 = !DILocation(line: 614, column: 8, scope: !199, inlinedAt: !190)
!199 = distinct !DILexicalBlock(scope: !185, file: !91, line: 614, column: 2)
!200 = !DILocalVariable(name: "backtrace", scope: !201, file: !2, line: 186, type: !202, align: 64)
!201 = distinct !DILexicalBlock(scope: !165, file: !2, line: 185, column: 2)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{Backtrace}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !203, identifier: "std.collections.list.List$std.os.backtrace.Backtrace$")
!203 = !{!204, !205, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !202, file: !2, line: 20, baseType: !21, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !202, file: !2, line: 21, baseType: !21, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !202, file: !2, line: 22, baseType: !101, size: 128, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !202, file: !2, line: 23, baseType: !208, size: 64, align: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64, dwarfAddressSpace: 0)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !210, identifier: "std.os.backtrace.Backtrace")
!210 = !{!211, !213, !214, !215, !216, !217, !218}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !209, file: !2, line: 11, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !22)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !209, file: !2, line: 12, baseType: !14, size: 128, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !209, file: !2, line: 13, baseType: !14, size: 128, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !209, file: !2, line: 14, baseType: !14, size: 128, align: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !209, file: !2, line: 15, baseType: !23, size: 32, align: 32, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !209, file: !2, line: 16, baseType: !101, size: 128, align: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !209, file: !2, line: 17, baseType: !7, size: 8, align: 8, offset: 640)
!219 = !DILocation(line: 186, column: 18, scope: !201)
!220 = !DILocation(line: 186, column: 30, scope: !201)
!221 = !DILocation(line: 187, column: 13, scope: !201)
!222 = !DILocation(line: 613, column: 8, scope: !223, inlinedAt: !190)
!223 = distinct !DILexicalBlock(scope: !185, file: !91, line: 613, column: 8)
!224 = !DILocation(line: 613, column: 8, scope: !225, inlinedAt: !154)
!225 = distinct !DILexicalBlock(scope: !149, file: !91, line: 613, column: 8)
!226 = !DILocation(line: 188, column: 7, scope: !201)
!227 = !DILocation(line: 188, column: 26, scope: !201)
!228 = !DILocation(line: 613, column: 8, scope: !229, inlinedAt: !190)
!229 = distinct !DILexicalBlock(scope: !185, file: !91, line: 613, column: 8)
!230 = !DILocation(line: 613, column: 8, scope: !231, inlinedAt: !154)
!231 = distinct !DILexicalBlock(scope: !149, file: !91, line: 613, column: 8)
!232 = !DILocation(line: 272, column: 15, scope: !233, inlinedAt: !234)
!233 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !62, file: !62, line: 270, scopeLine: 270, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!234 = !DILocation(line: 189, column: 3, scope: !201)
!235 = !DILocation(line: 182, column: 24, scope: !236, inlinedAt: !237)
!236 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !62, file: !62, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!237 = !DILocation(line: 272, column: 2, scope: !233, inlinedAt: !234)
!238 = !DILocation(line: 182, column: 34, scope: !236, inlinedAt: !237)
!239 = !DILocation(line: 167, column: 11, scope: !236, inlinedAt: !237)
!240 = !DILocation(line: 272, column: 15, scope: !241, inlinedAt: !242)
!241 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !62, file: !62, line: 270, scopeLine: 270, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!242 = !DILocation(line: 190, column: 3, scope: !201)
!243 = !DILocation(line: 182, column: 24, scope: !244, inlinedAt: !245)
!244 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !62, file: !62, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!245 = !DILocation(line: 272, column: 2, scope: !241, inlinedAt: !242)
!246 = !DILocation(line: 182, column: 34, scope: !244, inlinedAt: !245)
!247 = !DILocation(line: 167, column: 11, scope: !244, inlinedAt: !245)
!248 = !DILocation(line: 282, column: 16, scope: !249, inlinedAt: !250)
!249 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !62, file: !62, line: 280, scopeLine: 280, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!250 = !DILocation(line: 191, column: 3, scope: !201)
!251 = !DILocalVariable(name: "len", scope: !252, file: !2, line: 238, type: !21, align: 64)
!252 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !62, file: !62, line: 236, scopeLine: 236, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !48)
!253 = !DILocation(line: 238, column: 6, scope: !252, inlinedAt: !254)
!254 = !DILocation(line: 282, column: 2, scope: !249, inlinedAt: !250)
!255 = !DILocation(line: 182, column: 24, scope: !256, inlinedAt: !257)
!256 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !62, file: !62, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33)
!257 = !DILocation(line: 238, column: 12, scope: !252, inlinedAt: !254)
!258 = !DILocation(line: 182, column: 34, scope: !256, inlinedAt: !257)
!259 = !DILocation(line: 167, column: 11, scope: !256, inlinedAt: !257)
!260 = !DILocation(line: 239, column: 2, scope: !252, inlinedAt: !254)
!261 = !DILocation(line: 108, column: 11, scope: !252, inlinedAt: !254)
!262 = !DILocation(line: 244, column: 4, scope: !252, inlinedAt: !254)
