; ModuleID = 'std::compression::qoi'
source_filename = "std::compression::qoi"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Header = type <{ i32, i32, i32, i8, i8 }>
%OpRGBA = type <{ i8, i8, i8, i8, i8 }>
%OpRGB = type { i8, i8, i8, i8 }

@"$ct.std.compression.qoi.QOIDesc" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 12, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8
@"$ct.std.compression.qoi.QOIColorspace" = linkonce global %.introspect { i8 9, i64 0, ptr null, i64 1, i64 ptrtoint (ptr @"$ct.char" to i64), i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.char" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.std.compression.qoi.QOIChannels" = linkonce global %.introspect { i8 9, i64 ptrtoint (ptr @"$ct.char" to i64), ptr null, i64 1, i64 ptrtoint (ptr @"$ct.char" to i64), i64 3, [0 x i64] zeroinitializer }, align 8
@"$ct.std.compression.qoi.Header" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 14, i64 0, i64 5, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PIXELS_MAX", linkageName: "std.compression.qoi.PIXELS_MAX", scope: !2, file: !2, line: 3, type: !3, isLocal: false, isDefinition: true, align: 32)
!2 = !DIFile(filename: "qoi.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/compression")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OP_RGB", linkageName: "std.compression.qoi.OP_RGB", scope: !2, file: !2, line: 386, type: !3, isLocal: true, isDefinition: true, align: 32)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "OP_RGBA", linkageName: "std.compression.qoi.OP_RGBA", scope: !2, file: !2, line: 387, type: !3, isLocal: true, isDefinition: true, align: 32)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "OP_INDEX", linkageName: "std.compression.qoi.OP_INDEX", scope: !2, file: !2, line: 389, type: !3, isLocal: true, isDefinition: true, align: 32)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "OP_DIFF", linkageName: "std.compression.qoi.OP_DIFF", scope: !2, file: !2, line: 390, type: !3, isLocal: true, isDefinition: true, align: 32)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "OP_LUMA", linkageName: "std.compression.qoi.OP_LUMA", scope: !2, file: !2, line: 391, type: !3, isLocal: true, isDefinition: true, align: 32)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "OP_RUN", linkageName: "std.compression.qoi.OP_RUN", scope: !2, file: !2, line: 392, type: !3, isLocal: true, isDefinition: true, align: 32)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "END_OF_STREAM", linkageName: "std.compression.qoi.END_OF_STREAM", scope: !2, file: !2, line: 410, type: !18, isLocal: true, isDefinition: true, align: 8)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, align: 8, elements: !20)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !{!21}
!21 = !DISubrange(count: 8, lowerBound: 0)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 2, !"wchar_size", i32 4}
!25 = !{i32 4, !"PIC Level", i32 2}
!26 = !{i32 1, !"uwtable", i32 1}
!27 = !{i32 2, !"frame-pointer", i32 1}
!28 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, globals: !39, splitDebugInlining: false)
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIChannels", scope: !31, file: !2, line: 24, baseType: !19, size: 8, align: 8, elements: !38)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "QOIDesc", scope: !2, file: !2, line: 35, size: 96, align: 32, elements: !32, identifier: "std.compression.qoi.QOIDesc")
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !31, file: !2, line: 37, baseType: !3, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !31, file: !2, line: 38, baseType: !3, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !31, file: !2, line: 39, baseType: !30, size: 8, align: 8, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !31, file: !2, line: 40, baseType: !37, size: 8, align: 8, offset: 72)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIColorspace", scope: !31, file: !2, line: 10, baseType: !19, size: 8, align: 8, elements: !38)
!38 = !{}
!39 = !{!0, !4, !6, !8, !10, !12, !14, !16}
!40 = distinct !DISubprogram(name: "write", linkageName: "std.compression.qoi.write", scope: !2, file: !2, line: 68, type: !41, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !38)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !45, !51}
!43 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !46, identifier: "char[]")
!46 = !{!47, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !45, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !45, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !43)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DILocalVariable(name: "filename", arg: 1, scope: !40, file: !2, line: 68, type: !44)
!53 = !DILocation(line: 68, column: 22, scope: !40)
!54 = !DILocalVariable(name: "input", arg: 2, scope: !40, file: !2, line: 68, type: !45)
!55 = !DILocation(line: 68, column: 39, scope: !40)
!56 = !DILocalVariable(name: "desc", arg: 3, scope: !40, file: !2, line: 68, type: !51)
!57 = !DILocation(line: 68, column: 55, scope: !40)
!58 = !DILocalVariable(name: "state", scope: !59, file: !2, line: 679, type: !61, align: 64)
!59 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !60, file: !60, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !38)
!60 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 496, baseType: !62, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64, dwarfAddressSpace: 0)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !64, identifier: "std.core.mem.allocator.TempAllocator")
!64 = !{!65, !72, !84, !85, !87, !88, !89, !90, !91, !92, !93}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !63, file: !2, line: 33, baseType: !66, size: 128, align: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !67, identifier: "Allocator")
!67 = !{!68, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !66, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !63, file: !2, line: 34, baseType: !73, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !75, identifier: "std.core.mem.allocator.TempAllocatorPage")
!75 = !{!76, !77, !78, !79, !80}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !74, file: !2, line: 56, baseType: !73, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !74, file: !2, line: 57, baseType: !69, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !74, file: !2, line: 58, baseType: !50, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !74, file: !2, line: 59, baseType: !50, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !2, line: 60, baseType: !81, align: 8, offset: 256)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 0, lowerBound: 0)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !63, file: !2, line: 35, baseType: !62, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !63, file: !2, line: 36, baseType: !86, size: 8, align: 8, offset: 256)
!86 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !63, file: !2, line: 37, baseType: !50, size: 64, align: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !63, file: !2, line: 38, baseType: !50, size: 64, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !63, file: !2, line: 39, baseType: !50, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !63, file: !2, line: 40, baseType: !50, size: 64, align: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !63, file: !2, line: 41, baseType: !50, size: 64, align: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !63, file: !2, line: 42, baseType: !50, size: 64, align: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !63, file: !2, line: 43, baseType: !81, align: 8, offset: 704)
!94 = !DILocation(line: 679, column: 12, scope: !59, inlinedAt: !95)
!95 = !DILocation(line: 68, column: 64, scope: !40)
!96 = !DILocation(line: 679, column: 41, scope: !59, inlinedAt: !95)
!97 = !DILocation(line: 679, column: 20, scope: !59, inlinedAt: !95)
!98 = !DILocalVariable(name: "output", scope: !99, file: !2, line: 71, type: !45, align: 64)
!99 = distinct !DILexicalBlock(scope: !40, file: !2, line: 69, column: 1)
!100 = !DILocation(line: 71, column: 9, scope: !99)
!101 = !DILocation(line: 71, column: 25, scope: !99)
!102 = !DILocation(line: 71, column: 18, scope: !99)
!103 = !DILocation(line: 682, column: 23, scope: !104, inlinedAt: !95)
!104 = distinct !DILexicalBlock(scope: !59, file: !60, line: 681, column: 2)
!105 = !DILocation(line: 682, column: 3, scope: !104, inlinedAt: !95)
!106 = !DILocation(line: 73, column: 23, scope: !99)
!107 = !DILocation(line: 73, column: 2, scope: !99)
!108 = !DILocation(line: 682, column: 23, scope: !109, inlinedAt: !95)
!109 = distinct !DILexicalBlock(scope: !59, file: !60, line: 681, column: 2)
!110 = !DILocation(line: 682, column: 3, scope: !109, inlinedAt: !95)
!111 = !DILocation(line: 74, column: 9, scope: !99)
!112 = !DILocation(line: 682, column: 23, scope: !113, inlinedAt: !95)
!113 = distinct !DILexicalBlock(scope: !59, file: !60, line: 681, column: 2)
!114 = !DILocation(line: 682, column: 3, scope: !113, inlinedAt: !95)
!115 = distinct !DISubprogram(name: "read", linkageName: "std.compression.qoi.read", scope: !2, file: !2, line: 100, type: !116, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !38)
!116 = !DISubroutineType(types: !117)
!117 = !{!45, !66, !44, !51, !30}
!118 = !DILocalVariable(name: "allocator", arg: 1, scope: !115, file: !2, line: 100, type: !66)
!119 = !DILocation(line: 100, column: 27, scope: !115)
!120 = !DILocalVariable(name: "filename", arg: 2, scope: !115, file: !2, line: 100, type: !44)
!121 = !DILocation(line: 100, column: 45, scope: !115)
!122 = !DILocalVariable(name: "desc", arg: 3, scope: !115, file: !2, line: 100, type: !51)
!123 = !DILocation(line: 100, column: 64, scope: !115)
!124 = !DILocalVariable(name: "channels", arg: 4, scope: !115, file: !2, line: 100, type: !30)
!125 = !DILocation(line: 100, column: 82, scope: !115)
!126 = !DILocalVariable(name: "state", scope: !127, file: !2, line: 679, type: !61, align: 64)
!127 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !60, file: !60, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !38)
!128 = !DILocation(line: 679, column: 12, scope: !127, inlinedAt: !129)
!129 = !DILocation(line: 100, column: 102, scope: !115)
!130 = !DILocation(line: 679, column: 41, scope: !127, inlinedAt: !129)
!131 = !DILocation(line: 679, column: 20, scope: !127, inlinedAt: !129)
!132 = !DILocalVariable(name: "data", scope: !133, file: !2, line: 103, type: !45, align: 64)
!133 = distinct !DILexicalBlock(scope: !115, file: !2, line: 101, column: 1)
!134 = !DILocation(line: 103, column: 9, scope: !133)
!135 = !DILocation(line: 103, column: 16, scope: !133)
!136 = !DILocation(line: 103, column: 45, scope: !133)
!137 = !DILocation(line: 682, column: 23, scope: !138, inlinedAt: !129)
!138 = distinct !DILexicalBlock(scope: !127, file: !60, line: 681, column: 2)
!139 = !DILocation(line: 682, column: 3, scope: !138, inlinedAt: !129)
!140 = !DILocation(line: 105, column: 9, scope: !133)
!141 = !DILocation(line: 682, column: 23, scope: !142, inlinedAt: !129)
!142 = distinct !DILexicalBlock(scope: !127, file: !60, line: 681, column: 2)
!143 = !DILocation(line: 682, column: 3, scope: !142, inlinedAt: !129)
!144 = !DILocation(line: 682, column: 23, scope: !145, inlinedAt: !129)
!145 = distinct !DILexicalBlock(scope: !127, file: !60, line: 681, column: 2)
!146 = !DILocation(line: 682, column: 3, scope: !145, inlinedAt: !129)
!147 = distinct !DISubprogram(name: "encode", linkageName: "std.compression.qoi.encode", scope: !2, file: !2, line: 128, type: !148, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !38)
!148 = !DISubroutineType(types: !149)
!149 = !{!45, !66, !45, !51}
!150 = !DILocalVariable(name: "allocator", arg: 1, scope: !147, file: !2, line: 128, type: !66)
!151 = !DILocation(line: 128, column: 29, scope: !147)
!152 = !DILocalVariable(name: "input", arg: 2, scope: !147, file: !2, line: 128, type: !45)
!153 = !DILocation(line: 128, column: 47, scope: !147)
!154 = !DILocalVariable(name: "desc", arg: 3, scope: !147, file: !2, line: 128, type: !51)
!155 = !DILocation(line: 128, column: 63, scope: !147)
!156 = !DILocation(line: 131, column: 6, scope: !147)
!157 = !DILocation(line: 131, column: 25, scope: !147)
!158 = !DILocation(line: 131, column: 50, scope: !147)
!159 = !DILocation(line: 132, column: 6, scope: !147)
!160 = !DILocation(line: 132, column: 36, scope: !147)
!161 = !DILocalVariable(name: "pixels", scope: !147, file: !2, line: 133, type: !3, align: 32)
!162 = !DILocation(line: 133, column: 7, scope: !147)
!163 = !DILocation(line: 133, column: 16, scope: !147)
!164 = !DILocation(line: 133, column: 29, scope: !147)
!165 = !DILocation(line: 134, column: 6, scope: !147)
!166 = !DILocation(line: 134, column: 34, scope: !147)
!167 = !DILocalVariable(name: "image_size", scope: !147, file: !2, line: 137, type: !3, align: 32)
!168 = !DILocation(line: 137, column: 7, scope: !147)
!169 = !DILocation(line: 137, column: 20, scope: !147)
!170 = !DILocation(line: 137, column: 29, scope: !147)
!171 = !DILocation(line: 138, column: 6, scope: !147)
!172 = !DILocation(line: 138, column: 20, scope: !147)
!173 = !DILocation(line: 138, column: 38, scope: !147)
!174 = !DILocalVariable(name: "max_size", scope: !147, file: !2, line: 142, type: !3, align: 32)
!175 = !DILocation(line: 142, column: 7, scope: !147)
!176 = !DILocation(line: 142, column: 34, scope: !147)
!177 = !DILocation(line: 142, column: 18, scope: !147)
!178 = !DILocation(line: 142, column: 43, scope: !147)
!179 = !DILocalVariable(name: "output", scope: !147, file: !2, line: 143, type: !45, align: 64)
!180 = !DILocation(line: 143, column: 9, scope: !147)
!181 = !DILocation(line: 143, column: 58, scope: !147)
!182 = !DILocation(line: 304, column: 55, scope: !183, inlinedAt: !185)
!183 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !184, file: !184, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!184 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!185 = !DILocation(line: 287, column: 9, scope: !186, inlinedAt: !187)
!186 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !184, file: !184, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!187 = !DILocation(line: 143, column: 18, scope: !147)
!188 = !DILocation(line: 304, column: 40, scope: !183, inlinedAt: !185)
!189 = !DILocation(line: 80, column: 6, scope: !190, inlinedAt: !191)
!190 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !184, file: !184, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!191 = !DILocation(line: 304, column: 18, scope: !183, inlinedAt: !185)
!192 = !DILocation(line: 80, column: 20, scope: !190, inlinedAt: !191)
!193 = !DILocation(line: 86, column: 28, scope: !190, inlinedAt: !191)
!194 = !DILocation(line: 38, column: 12, scope: !190, inlinedAt: !191)
!195 = !DILocation(line: 1039, column: 9, scope: !196, inlinedAt: !198)
!196 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !197, file: !197, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!197 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!198 = !DILocation(line: 38, column: 26, scope: !190, inlinedAt: !191)
!199 = !DILocation(line: 1039, column: 20, scope: !196, inlinedAt: !198)
!200 = !DILocation(line: 1039, column: 25, scope: !196, inlinedAt: !198)
!201 = !DILocation(line: 1039, column: 19, scope: !196, inlinedAt: !198)
!202 = !DILocation(line: 86, column: 10, scope: !190, inlinedAt: !191)
!203 = !DILocation(line: 304, column: 67, scope: !183, inlinedAt: !185)
!204 = !DILocation(line: 304, column: 9, scope: !183, inlinedAt: !185)
!205 = !DILocation(line: 11, column: 36, scope: !206, inlinedAt: !208)
!206 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !207, file: !207, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!207 = !DIFile(filename: "bits.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std")
!208 = !DILocation(line: 148, column: 15, scope: !147)
!209 = !DILocation(line: 149, column: 21, scope: !147)
!210 = !DILocation(line: 11, column: 36, scope: !211, inlinedAt: !212)
!211 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !207, file: !207, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!212 = !DILocation(line: 149, column: 15, scope: !147)
!213 = !DILocation(line: 150, column: 22, scope: !147)
!214 = !DILocation(line: 11, column: 36, scope: !215, inlinedAt: !216)
!215 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !207, file: !207, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!216 = !DILocation(line: 150, column: 16, scope: !147)
!217 = !DILocation(line: 151, column: 15, scope: !147)
!218 = !DILocation(line: 152, column: 17, scope: !147)
!219 = !DILocation(line: 147, column: 12, scope: !147)
!220 = !DILocation(line: 147, column: 3, scope: !147)
!221 = !DILocalVariable(name: "pos", scope: !147, file: !2, line: 155, type: !3, align: 32)
!222 = !DILocation(line: 155, column: 7, scope: !147)
!223 = !DILocation(line: 155, column: 13, scope: !147)
!224 = !DILocalVariable(name: "loc", scope: !147, file: !2, line: 156, type: !3, align: 32)
!225 = !DILocation(line: 156, column: 7, scope: !147)
!226 = !DILocalVariable(name: "loc_end", scope: !147, file: !2, line: 157, type: !3, align: 32)
!227 = !DILocation(line: 157, column: 7, scope: !147)
!228 = !DILocation(line: 157, column: 17, scope: !147)
!229 = !DILocation(line: 157, column: 30, scope: !147)
!230 = !DILocalVariable(name: "run_length", scope: !147, file: !2, line: 158, type: !19, align: 8)
!231 = !DILocation(line: 158, column: 7, scope: !147)
!232 = !DILocation(line: 158, column: 20, scope: !147)
!233 = !DILocalVariable(name: "palette", scope: !147, file: !2, line: 160, type: !234, align: 8)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 2048, align: 8, elements: !239)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", scope: !2, file: !2, line: 412, baseType: !236, align: 8)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, align: 8, flags: DIFlagVector, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 4, lowerBound: 0)
!239 = !{!240}
!240 = !DISubrange(count: 64, lowerBound: 0)
!241 = !DILocation(line: 160, column: 12, scope: !147)
!242 = !DILocalVariable(name: "prev", scope: !147, file: !2, line: 161, type: !235, align: 8)
!243 = !DILocation(line: 161, column: 8, scope: !147)
!244 = !DILocation(line: 161, column: 15, scope: !147)
!245 = !DILocalVariable(name: "p", scope: !147, file: !2, line: 162, type: !235, align: 8)
!246 = !DILocation(line: 162, column: 8, scope: !147)
!247 = !DILocation(line: 162, column: 12, scope: !147)
!248 = !DILocalVariable(name: "diff", scope: !147, file: !2, line: 164, type: !249, align: 32)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 24, align: 8, flags: DIFlagVector, elements: !251)
!250 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!251 = !{!252}
!252 = !DISubrange(count: 3, lowerBound: 0)
!253 = !DILocation(line: 164, column: 13, scope: !147)
!254 = !DILocalVariable(name: "luma", scope: !147, file: !2, line: 165, type: !249, align: 32)
!255 = !DILocation(line: 165, column: 13, scope: !147)
!256 = !DILocation(line: 168, column: 13, scope: !257)
!257 = distinct !DILexicalBlock(scope: !147, file: !2, line: 168, column: 2)
!258 = !DILocation(line: 168, column: 16, scope: !257)
!259 = !DILocation(line: 168, column: 22, scope: !257)
!260 = !DILocation(line: 171, column: 10, scope: !261)
!261 = distinct !DILexicalBlock(scope: !257, file: !2, line: 169, column: 2)
!262 = !DILocation(line: 174, column: 11, scope: !261)
!263 = !DILocation(line: 174, column: 17, scope: !261)
!264 = !DILocation(line: 174, column: 3, scope: !261)
!265 = !DILocation(line: 175, column: 7, scope: !261)
!266 = !DILocation(line: 175, column: 30, scope: !261)
!267 = !DILocation(line: 175, column: 36, scope: !261)
!268 = !DILocation(line: 175, column: 42, scope: !261)
!269 = !DILocation(line: 178, column: 7, scope: !261)
!270 = !DILocation(line: 178, column: 15, scope: !261)
!271 = !DILocation(line: 180, column: 4, scope: !272)
!272 = distinct !DILexicalBlock(scope: !261, file: !2, line: 179, column: 3)
!273 = !DILocation(line: 181, column: 8, scope: !272)
!274 = !DILocation(line: 181, column: 28, scope: !272)
!275 = !DILocation(line: 181, column: 35, scope: !272)
!276 = !DILocation(line: 183, column: 48, scope: !277)
!277 = distinct !DILexicalBlock(scope: !272, file: !2, line: 182, column: 4)
!278 = !DILocalVariable(name: "chunk", scope: !279, file: !2, line: 463, type: !48, align: 64)
!279 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !38)
!280 = !DILocation(line: 463, column: 9, scope: !279, inlinedAt: !281)
!281 = !DILocation(line: 183, column: 6, scope: !277)
!282 = !DILocation(line: 463, column: 25, scope: !279, inlinedAt: !281)
!283 = !DILocation(line: 463, column: 31, scope: !279, inlinedAt: !281)
!284 = !DILocation(line: 464, column: 3, scope: !279, inlinedAt: !281)
!285 = !DILocation(line: 464, column: 2, scope: !279, inlinedAt: !281)
!286 = !DILocation(line: 465, column: 9, scope: !279, inlinedAt: !281)
!287 = !DILocation(line: 184, column: 18, scope: !277)
!288 = !DILocation(line: 186, column: 4, scope: !272)
!289 = !DILocation(line: 189, column: 7, scope: !261)
!290 = !DILocation(line: 191, column: 47, scope: !291)
!291 = distinct !DILexicalBlock(scope: !261, file: !2, line: 190, column: 3)
!292 = !DILocalVariable(name: "chunk", scope: !293, file: !2, line: 463, type: !48, align: 64)
!293 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !38)
!294 = !DILocation(line: 463, column: 9, scope: !293, inlinedAt: !295)
!295 = !DILocation(line: 191, column: 5, scope: !291)
!296 = !DILocation(line: 463, column: 25, scope: !293, inlinedAt: !295)
!297 = !DILocation(line: 463, column: 31, scope: !293, inlinedAt: !295)
!298 = !DILocation(line: 464, column: 3, scope: !293, inlinedAt: !295)
!299 = !DILocation(line: 464, column: 2, scope: !293, inlinedAt: !295)
!300 = !DILocation(line: 465, column: 9, scope: !293, inlinedAt: !295)
!301 = !DILocation(line: 192, column: 17, scope: !291)
!302 = !DILocation(line: 415, column: 10, scope: !303, inlinedAt: !304)
!303 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 413, scopeLine: 413, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!304 = !DILocation(line: 198, column: 18, scope: !305)
!305 = distinct !DILexicalBlock(scope: !261, file: !2, line: 195, column: 3)
!306 = !DILocation(line: 415, column: 20, scope: !303, inlinedAt: !304)
!307 = !DILocation(line: 415, column: 30, scope: !303, inlinedAt: !304)
!308 = !DILocation(line: 415, column: 40, scope: !303, inlinedAt: !304)
!309 = !DILocation(line: 415, column: 9, scope: !303, inlinedAt: !304)
!310 = !DILocation(line: 198, column: 31, scope: !305)
!311 = !DILocation(line: 198, column: 10, scope: !305)
!312 = !DILocation(line: 415, column: 10, scope: !313, inlinedAt: !314)
!313 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 413, scopeLine: 413, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!314 = !DILocation(line: 201, column: 6, scope: !315)
!315 = distinct !DILexicalBlock(scope: !305, file: !2, line: 199, column: 5)
!316 = !DILocation(line: 415, column: 20, scope: !313, inlinedAt: !314)
!317 = !DILocation(line: 415, column: 30, scope: !313, inlinedAt: !314)
!318 = !DILocation(line: 415, column: 40, scope: !313, inlinedAt: !314)
!319 = !DILocation(line: 415, column: 9, scope: !313, inlinedAt: !314)
!320 = !DILocalVariable(name: "chunk", scope: !321, file: !2, line: 463, type: !48, align: 64)
!321 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !38)
!322 = !DILocation(line: 463, column: 9, scope: !321, inlinedAt: !323)
!323 = !DILocation(line: 199, column: 6, scope: !315)
!324 = !DILocation(line: 463, column: 25, scope: !321, inlinedAt: !323)
!325 = !DILocation(line: 463, column: 31, scope: !321, inlinedAt: !323)
!326 = !DILocation(line: 464, column: 3, scope: !321, inlinedAt: !323)
!327 = !DILocation(line: 464, column: 2, scope: !321, inlinedAt: !323)
!328 = !DILocation(line: 465, column: 9, scope: !321, inlinedAt: !323)
!329 = !DILocation(line: 205, column: 10, scope: !305)
!330 = !DILocation(line: 205, column: 18, scope: !305)
!331 = !DILocation(line: 205, column: 23, scope: !305)
!332 = !DILocation(line: 205, column: 33, scope: !305)
!333 = !DILocation(line: 207, column: 12, scope: !334)
!334 = distinct !DILexicalBlock(scope: !305, file: !2, line: 207, column: 5)
!335 = !DILocation(line: 207, column: 20, scope: !334)
!336 = !DILocation(line: 208, column: 9, scope: !334)
!337 = !DILocation(line: 208, column: 24, scope: !334)
!338 = !DILocation(line: 209, column: 9, scope: !334)
!339 = !DILocation(line: 209, column: 24, scope: !334)
!340 = !DILocation(line: 210, column: 9, scope: !334)
!341 = !DILocation(line: 210, column: 24, scope: !334)
!342 = !DILocation(line: 214, column: 13, scope: !343)
!343 = distinct !DILexicalBlock(scope: !334, file: !2, line: 211, column: 5)
!344 = !DILocation(line: 214, column: 7, scope: !343)
!345 = !DILocation(line: 215, column: 13, scope: !343)
!346 = !DILocation(line: 215, column: 7, scope: !343)
!347 = !DILocation(line: 216, column: 13, scope: !343)
!348 = !DILocation(line: 216, column: 7, scope: !343)
!349 = !DILocalVariable(name: "chunk", scope: !350, file: !2, line: 463, type: !48, align: 64)
!350 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !38)
!351 = !DILocation(line: 463, column: 9, scope: !350, inlinedAt: !352)
!352 = !DILocation(line: 212, column: 7, scope: !343)
!353 = !DILocation(line: 463, column: 25, scope: !350, inlinedAt: !352)
!354 = !DILocation(line: 463, column: 31, scope: !350, inlinedAt: !352)
!355 = !DILocation(line: 464, column: 3, scope: !350, inlinedAt: !352)
!356 = !DILocation(line: 464, column: 2, scope: !350, inlinedAt: !352)
!357 = !DILocation(line: 465, column: 9, scope: !350, inlinedAt: !352)
!358 = !DILocation(line: 415, column: 10, scope: !359, inlinedAt: !360)
!359 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 413, scopeLine: 413, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!360 = !DILocation(line: 218, column: 14, scope: !343)
!361 = !DILocation(line: 415, column: 20, scope: !359, inlinedAt: !360)
!362 = !DILocation(line: 415, column: 30, scope: !359, inlinedAt: !360)
!363 = !DILocation(line: 415, column: 40, scope: !359, inlinedAt: !360)
!364 = !DILocation(line: 415, column: 9, scope: !359, inlinedAt: !360)
!365 = !DILocation(line: 219, column: 6, scope: !343)
!366 = !DILocation(line: 222, column: 14, scope: !334)
!367 = !DILocation(line: 222, column: 23, scope: !334)
!368 = !DILocation(line: 222, column: 31, scope: !334)
!369 = !DILocation(line: 222, column: 39, scope: !334)
!370 = !DILocation(line: 222, column: 48, scope: !334)
!371 = !DILocation(line: 223, column: 9, scope: !334)
!372 = !DILocation(line: 223, column: 25, scope: !334)
!373 = !DILocation(line: 224, column: 9, scope: !334)
!374 = !DILocation(line: 224, column: 26, scope: !334)
!375 = !DILocation(line: 225, column: 9, scope: !334)
!376 = !DILocation(line: 225, column: 25, scope: !334)
!377 = !DILocation(line: 229, column: 13, scope: !378)
!378 = distinct !DILexicalBlock(scope: !334, file: !2, line: 226, column: 5)
!379 = !DILocation(line: 229, column: 7, scope: !378)
!380 = !DILocation(line: 230, column: 13, scope: !378)
!381 = !DILocation(line: 230, column: 7, scope: !378)
!382 = !DILocation(line: 231, column: 13, scope: !378)
!383 = !DILocation(line: 231, column: 7, scope: !378)
!384 = !DILocalVariable(name: "chunk", scope: !385, file: !2, line: 463, type: !386, align: 64)
!385 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !38)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64, dwarfAddressSpace: 0)
!387 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!388 = !DILocation(line: 463, column: 9, scope: !385, inlinedAt: !389)
!389 = !DILocation(line: 227, column: 7, scope: !378)
!390 = !DILocation(line: 463, column: 25, scope: !385, inlinedAt: !389)
!391 = !DILocation(line: 463, column: 31, scope: !385, inlinedAt: !389)
!392 = !DILocation(line: 464, column: 3, scope: !385, inlinedAt: !389)
!393 = !DILocation(line: 464, column: 2, scope: !385, inlinedAt: !389)
!394 = !DILocation(line: 465, column: 9, scope: !385, inlinedAt: !389)
!395 = !DILocation(line: 415, column: 10, scope: !396, inlinedAt: !397)
!396 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 413, scopeLine: 413, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!397 = !DILocation(line: 233, column: 14, scope: !378)
!398 = !DILocation(line: 415, column: 20, scope: !396, inlinedAt: !397)
!399 = !DILocation(line: 415, column: 30, scope: !396, inlinedAt: !397)
!400 = !DILocation(line: 415, column: 40, scope: !396, inlinedAt: !397)
!401 = !DILocation(line: 415, column: 9, scope: !396, inlinedAt: !397)
!402 = !DILocation(line: 234, column: 6, scope: !378)
!403 = !DILocation(line: 236, column: 5, scope: !334)
!404 = !DILocation(line: 240, column: 9, scope: !405)
!405 = distinct !DILexicalBlock(scope: !305, file: !2, line: 240, column: 5)
!406 = !DILocation(line: 240, column: 19, scope: !405)
!407 = !DILocation(line: 242, column: 42, scope: !408)
!408 = distinct !DILexicalBlock(scope: !405, file: !2, line: 241, column: 5)
!409 = !DILocation(line: 242, column: 51, scope: !408)
!410 = !DILocation(line: 242, column: 56, scope: !408)
!411 = !DILocation(line: 242, column: 61, scope: !408)
!412 = !DILocation(line: 242, column: 66, scope: !408)
!413 = !DILocalVariable(name: "chunk", scope: !414, file: !2, line: 463, type: !415, align: 64)
!414 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !38)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64, dwarfAddressSpace: 0)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGBA", scope: !2, file: !2, line: 425, size: 40, align: 8, elements: !417, identifier: "std.compression.qoi.OpRGBA")
!417 = !{!418, !419, !420, !421, !422}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !416, file: !2, line: 427, baseType: !19, size: 8, align: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !416, file: !2, line: 428, baseType: !19, size: 8, align: 8, offset: 8)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !416, file: !2, line: 429, baseType: !19, size: 8, align: 8, offset: 16)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !416, file: !2, line: 430, baseType: !19, size: 8, align: 8, offset: 24)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !416, file: !2, line: 431, baseType: !19, size: 8, align: 8, offset: 32)
!423 = !DILocation(line: 463, column: 9, scope: !414, inlinedAt: !424)
!424 = !DILocation(line: 242, column: 7, scope: !408)
!425 = !DILocation(line: 463, column: 25, scope: !414, inlinedAt: !424)
!426 = !DILocation(line: 463, column: 31, scope: !414, inlinedAt: !424)
!427 = !DILocation(line: 464, column: 3, scope: !414, inlinedAt: !424)
!428 = !DILocation(line: 464, column: 2, scope: !414, inlinedAt: !424)
!429 = !DILocation(line: 465, column: 9, scope: !414, inlinedAt: !424)
!430 = !DILocation(line: 246, column: 41, scope: !431)
!431 = distinct !DILexicalBlock(scope: !405, file: !2, line: 245, column: 5)
!432 = !DILocation(line: 246, column: 49, scope: !431)
!433 = !DILocation(line: 246, column: 54, scope: !431)
!434 = !DILocation(line: 246, column: 59, scope: !431)
!435 = !DILocalVariable(name: "chunk", scope: !436, file: !2, line: 463, type: !437, align: 64)
!436 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 460, scopeLine: 460, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !38)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64, dwarfAddressSpace: 0)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGB", scope: !2, file: !2, line: 418, size: 32, align: 8, elements: !439, identifier: "std.compression.qoi.OpRGB")
!439 = !{!440, !441, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !438, file: !2, line: 420, baseType: !19, size: 8, align: 8)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !438, file: !2, line: 421, baseType: !19, size: 8, align: 8, offset: 8)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !438, file: !2, line: 422, baseType: !19, size: 8, align: 8, offset: 16)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !438, file: !2, line: 423, baseType: !19, size: 8, align: 8, offset: 24)
!444 = !DILocation(line: 463, column: 9, scope: !436, inlinedAt: !445)
!445 = !DILocation(line: 246, column: 7, scope: !431)
!446 = !DILocation(line: 463, column: 25, scope: !436, inlinedAt: !445)
!447 = !DILocation(line: 463, column: 31, scope: !436, inlinedAt: !445)
!448 = !DILocation(line: 464, column: 3, scope: !436, inlinedAt: !445)
!449 = !DILocation(line: 464, column: 2, scope: !436, inlinedAt: !445)
!450 = !DILocation(line: 465, column: 9, scope: !436, inlinedAt: !445)
!451 = !DILocation(line: 415, column: 10, scope: !452, inlinedAt: !453)
!452 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 413, scopeLine: 413, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!453 = !DILocation(line: 248, column: 13, scope: !405)
!454 = !DILocation(line: 415, column: 20, scope: !452, inlinedAt: !453)
!455 = !DILocation(line: 415, column: 30, scope: !452, inlinedAt: !453)
!456 = !DILocation(line: 415, column: 40, scope: !452, inlinedAt: !453)
!457 = !DILocation(line: 415, column: 9, scope: !452, inlinedAt: !453)
!458 = !DILocation(line: 168, column: 34, scope: !257)
!459 = !DILocation(line: 168, column: 41, scope: !257)
!460 = !DILocation(line: 253, column: 2, scope: !147)
!461 = !DILocation(line: 253, column: 9, scope: !147)
!462 = !DILocation(line: 254, column: 2, scope: !147)
!463 = !DILocation(line: 256, column: 9, scope: !147)
!464 = !DILocation(line: 256, column: 16, scope: !147)
!465 = !DILocation(line: 256, column: 17, scope: !147)
!466 = distinct !DISubprogram(name: "decode", linkageName: "std.compression.qoi.decode", scope: !2, file: !2, line: 283, type: !467, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !38)
!467 = !DISubroutineType(types: !468)
!468 = !{!45, !66, !45, !51, !30}
!469 = !DILocalVariable(name: "allocator", arg: 1, scope: !466, file: !2, line: 283, type: !66)
!470 = !DILocation(line: 283, column: 29, scope: !466)
!471 = !DILocalVariable(name: "data", arg: 2, scope: !466, file: !2, line: 283, type: !45)
!472 = !DILocation(line: 283, column: 47, scope: !466)
!473 = !DILocalVariable(name: "desc", arg: 3, scope: !466, file: !2, line: 283, type: !51)
!474 = !DILocation(line: 283, column: 62, scope: !466)
!475 = !DILocalVariable(name: "channels", arg: 4, scope: !466, file: !2, line: 283, type: !30)
!476 = !DILocation(line: 283, column: 80, scope: !466)
!477 = !DILocation(line: 286, column: 6, scope: !466)
!478 = !DILocation(line: 286, column: 59, scope: !466)
!479 = !DILocalVariable(name: "header", scope: !466, file: !2, line: 289, type: !480, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64, dwarfAddressSpace: 0)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", scope: !2, file: !2, line: 394, size: 112, align: 8, elements: !482, identifier: "std.compression.qoi.Header")
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "be_magic", scope: !481, file: !2, line: 397, baseType: !3, size: 32, align: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "be_width", scope: !481, file: !2, line: 399, baseType: !3, size: 32, align: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "be_height", scope: !481, file: !2, line: 401, baseType: !3, size: 32, align: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !481, file: !2, line: 405, baseType: !30, size: 8, align: 8, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !481, file: !2, line: 407, baseType: !37, size: 8, align: 8, offset: 104)
!488 = !DILocation(line: 289, column: 10, scope: !466)
!489 = !DILocation(line: 289, column: 28, scope: !466)
!490 = !DILocation(line: 292, column: 12, scope: !466)
!491 = !DILocation(line: 11, column: 36, scope: !492, inlinedAt: !493)
!492 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !207, file: !207, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!493 = !DILocation(line: 292, column: 6, scope: !466)
!494 = !DILocation(line: 292, column: 47, scope: !466)
!495 = !DILocalVariable(name: "width", scope: !466, file: !2, line: 295, type: !3, align: 32)
!496 = !DILocation(line: 295, column: 7, scope: !466)
!497 = !DILocation(line: 295, column: 34, scope: !466)
!498 = !DILocation(line: 11, column: 36, scope: !499, inlinedAt: !500)
!499 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !207, file: !207, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!500 = !DILocation(line: 295, column: 28, scope: !466)
!501 = !DILocation(line: 295, column: 15, scope: !466)
!502 = !DILocalVariable(name: "height", scope: !466, file: !2, line: 296, type: !3, align: 32)
!503 = !DILocation(line: 296, column: 7, scope: !466)
!504 = !DILocation(line: 296, column: 36, scope: !466)
!505 = !DILocation(line: 11, column: 36, scope: !506, inlinedAt: !507)
!506 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !207, file: !207, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!507 = !DILocation(line: 296, column: 30, scope: !466)
!508 = !DILocation(line: 296, column: 16, scope: !466)
!509 = !DILocalVariable(name: "desc_channels", scope: !466, file: !2, line: 297, type: !30, align: 8)
!510 = !DILocation(line: 297, column: 14, scope: !466)
!511 = !DILocation(line: 297, column: 46, scope: !466)
!512 = !DILocation(line: 297, column: 30, scope: !466)
!513 = !DILocation(line: 298, column: 20, scope: !466)
!514 = !DILocation(line: 298, column: 2, scope: !466)
!515 = !DILocation(line: 299, column: 6, scope: !466)
!516 = !DILocation(line: 299, column: 36, scope: !466)
!517 = !DILocation(line: 302, column: 6, scope: !466)
!518 = !DILocation(line: 302, column: 20, scope: !466)
!519 = !DILocation(line: 302, column: 40, scope: !466)
!520 = !DILocalVariable(name: "pixels", scope: !466, file: !2, line: 305, type: !43, align: 64)
!521 = !DILocation(line: 305, column: 8, scope: !466)
!522 = !DILocation(line: 305, column: 17, scope: !466)
!523 = !DILocation(line: 305, column: 32, scope: !466)
!524 = !DILocation(line: 306, column: 6, scope: !466)
!525 = !DILocation(line: 306, column: 34, scope: !466)
!526 = !DILocalVariable(name: "pos", scope: !466, file: !2, line: 308, type: !3, align: 32)
!527 = !DILocation(line: 308, column: 7, scope: !466)
!528 = !DILocation(line: 308, column: 13, scope: !466)
!529 = !DILocalVariable(name: "loc", scope: !466, file: !2, line: 309, type: !3, align: 32)
!530 = !DILocation(line: 309, column: 7, scope: !466)
!531 = !DILocalVariable(name: "run_length", scope: !466, file: !2, line: 310, type: !19, align: 8)
!532 = !DILocation(line: 310, column: 7, scope: !466)
!533 = !DILocation(line: 310, column: 20, scope: !466)
!534 = !DILocalVariable(name: "tag", scope: !466, file: !2, line: 311, type: !19, align: 8)
!535 = !DILocation(line: 311, column: 7, scope: !466)
!536 = !DILocalVariable(name: "palette", scope: !466, file: !2, line: 313, type: !234, align: 8)
!537 = !DILocation(line: 313, column: 12, scope: !466)
!538 = !DILocalVariable(name: "p", scope: !466, file: !2, line: 314, type: !235, align: 8)
!539 = !DILocation(line: 314, column: 8, scope: !466)
!540 = !DILocation(line: 314, column: 12, scope: !466)
!541 = !DILocation(line: 316, column: 6, scope: !466)
!542 = !DILocation(line: 316, column: 35, scope: !466)
