; ModuleID = 'std::core::string::ansi'
source_filename = "std::core::string::ansi"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%AnsiColor = type { i8, i8, i8, i8 }

@"$ct.std.core.string.ansi.AnsiColor" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 4, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.string.ansi.Ansi" = linkonce global %.introspect { i8 9, i64 ptrtoint (ptr @"$ct.String" to i64), ptr null, i64 16, i64 ptrtoint (ptr @"$ct.String" to i64), i64 52, [0 x i64] zeroinitializer }, align 8
@"$ct.String" = linkonce global %.introspect { i8 18, i64 ptrtoint (ptr @"$ct.sa$char" to i64), ptr null, i64 16, i64 ptrtoint (ptr @"$ct.sa$char" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.sa$char" = linkonce global %.introspect { i8 16, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.char" to i64), i64 0, [0 x i64] zeroinitializer }, align 8
@"$ct.char" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@.panic_msg = internal constant [70 x i8] c"@require \22rgb <= 0xFF_FF_FF\22 violated: 'Expected a 24 bit RGB value'.\00", align 1
@.file = internal constant [8 x i8] c"ansi.c3\00", align 1

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "ansi.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!8 = distinct !DISubprogram(name: "to_format", linkageName: "std.core.string.ansi.AnsiColor.to_format", scope: !7, file: !7, line: 66, type: !9, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !12, !21}
!11 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnsiColor", scope: !7, file: !7, line: 60, size: 32, align: 8, elements: !14, identifier: "std.core.string.ansi.AnsiColor")
!14 = !{!15, !17, !18, !19}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !13, file: !7, line: 62, baseType: !16, size: 8, align: 8)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !13, file: !7, line: 62, baseType: !16, size: 8, align: 8, offset: 8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !13, file: !7, line: 62, baseType: !16, size: 8, align: 8, offset: 16)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "bg", scope: !13, file: !7, line: 63, baseType: !20, size: 8, align: 8, offset: 24)
!20 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !7, file: !7, line: 65, size: 320, align: 64, elements: !23, identifier: "std.io.Formatter")
!23 = !{!24, !26, !31}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !22, file: !7, line: 67, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !22, file: !7, line: 68, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !7, file: !7, line: 18, baseType: !28, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !25, !16}
!31 = !DIDerivedType(tag: DW_TAG_member, scope: !22, file: !7, line: 69, baseType: !32, size: 192, align: 64, offset: 128)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !22, file: !7, line: 69, size: 192, align: 64, elements: !33)
!33 = !{!34, !36, !37, !38}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !32, file: !7, line: 71, baseType: !35, size: 32, align: 32)
!35 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !32, file: !7, line: 72, baseType: !35, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !32, file: !7, line: 73, baseType: !35, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !32, file: !7, line: 74, baseType: !39, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !40)
!40 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!41 = !{}
!42 = !DILocation(line: 67, column: 1, scope: !8)
!43 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 66, type: !12)
!44 = !DILocation(line: 66, column: 29, scope: !8)
!45 = !DILocalVariable(name: "fmt", arg: 2, scope: !8, file: !7, line: 66, type: !21)
!46 = !DILocation(line: 66, column: 47, scope: !8)
!47 = !DILocation(line: 68, column: 42, scope: !8)
!48 = !DILocation(line: 68, column: 56, scope: !8)
!49 = !DILocation(line: 68, column: 59, scope: !8)
!50 = !DILocation(line: 68, column: 67, scope: !8)
!51 = !DILocation(line: 68, column: 75, scope: !8)
!52 = !DILocation(line: 68, column: 9, scope: !8)
!53 = distinct !DISubprogram(name: "get_color_rgb", linkageName: "std.core.string.ansi.get_color_rgb", scope: !7, file: !7, line: 76, type: !54, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!54 = !DISubroutineType(types: !55)
!55 = !{!13, !16, !16, !16, !20}
!56 = !DILocalVariable(name: "r", arg: 1, scope: !53, file: !7, line: 76, type: !16)
!57 = !DILocation(line: 76, column: 33, scope: !53)
!58 = !DILocalVariable(name: "g", arg: 2, scope: !53, file: !7, line: 76, type: !16)
!59 = !DILocation(line: 76, column: 41, scope: !53)
!60 = !DILocalVariable(name: "b", arg: 3, scope: !53, file: !7, line: 76, type: !16)
!61 = !DILocation(line: 76, column: 49, scope: !53)
!62 = !DILocalVariable(name: "bg", arg: 4, scope: !53, file: !7, line: 76, type: !20)
!63 = !DILocation(line: 76, column: 57, scope: !53)
!64 = !DILocation(line: 78, column: 10, scope: !53)
!65 = !DILocation(line: 78, column: 13, scope: !53)
!66 = !DILocation(line: 78, column: 16, scope: !53)
!67 = !DILocation(line: 78, column: 19, scope: !53)
!68 = distinct !DISubprogram(name: "get_color", linkageName: "std.core.string.ansi.get_color", scope: !7, file: !7, line: 86, type: !69, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!69 = !DISubroutineType(types: !70)
!70 = !{!13, !35, !20}
!71 = !DILocalVariable(name: "rgb", arg: 1, scope: !68, file: !7, line: 86, type: !35)
!72 = !DILocation(line: 86, column: 29, scope: !68)
!73 = !DILocalVariable(name: "bg", arg: 2, scope: !68, file: !7, line: 86, type: !20)
!74 = !DILocation(line: 86, column: 39, scope: !68)
!75 = !DILocation(line: 88, column: 17, scope: !68)
!76 = !DILocation(line: 88, column: 10, scope: !68)
!77 = !DILocation(line: 88, column: 37, scope: !68)
!78 = !DILocation(line: 88, column: 29, scope: !68)
!79 = !DILocation(line: 88, column: 60, scope: !68)
!80 = !DILocation(line: 88, column: 71, scope: !68)
!81 = distinct !DISubprogram(name: "make_color", linkageName: "std.core.string.ansi.make_color", scope: !7, file: !7, line: 131, type: !82, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !91, !35, !20}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !86, identifier: "char[]")
!86 = !{!87, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !85, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !85, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !11)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !92, identifier: "Allocator")
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !91, baseType: !25, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, baseType: !95, size: 64, align: 64, offset: 64)
!95 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!96 = !DILocalVariable(name: "mem", arg: 1, scope: !81, file: !7, line: 131, type: !91)
!97 = !DILocation(line: 131, column: 32, scope: !81)
!98 = !DILocalVariable(name: "rgb", arg: 2, scope: !81, file: !7, line: 131, type: !35)
!99 = !DILocation(line: 131, column: 42, scope: !81)
!100 = !DILocalVariable(name: "bg", arg: 3, scope: !81, file: !7, line: 131, type: !20)
!101 = !DILocation(line: 131, column: 52, scope: !81)
!102 = !DILocation(line: 128, column: 11, scope: !103)
!103 = distinct !DILexicalBlock(scope: !81, file: !7, line: 132, column: 1)
!104 = !DILocation(line: 133, column: 36, scope: !81)
!105 = !DILocation(line: 133, column: 29, scope: !81)
!106 = !DILocation(line: 133, column: 56, scope: !81)
!107 = !DILocation(line: 133, column: 48, scope: !81)
!108 = !DILocation(line: 133, column: 77, scope: !81)
!109 = !DILocation(line: 133, column: 88, scope: !81)
!110 = !DILocation(line: 133, column: 9, scope: !81)
!111 = distinct !DISubprogram(name: "make_tcolor", linkageName: "std.core.string.ansi.make_tcolor", scope: !7, file: !7, line: 142, type: !112, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!112 = !DISubroutineType(types: !113)
!113 = !{!84, !35, !20}
!114 = !DILocalVariable(name: "rgb", arg: 1, scope: !111, file: !7, line: 142, type: !35)
!115 = !DILocation(line: 142, column: 28, scope: !111)
!116 = !DILocalVariable(name: "bg", arg: 2, scope: !111, file: !7, line: 142, type: !20)
!117 = !DILocation(line: 142, column: 38, scope: !111)
!118 = !DILocation(line: 139, column: 11, scope: !119)
!119 = distinct !DILexicalBlock(scope: !111, file: !7, line: 143, column: 1)
!120 = !DILocation(line: 144, column: 24, scope: !111)
!121 = !DILocation(line: 144, column: 37, scope: !111)
!122 = !DILocation(line: 144, column: 30, scope: !111)
!123 = !DILocation(line: 144, column: 57, scope: !111)
!124 = !DILocation(line: 144, column: 49, scope: !111)
!125 = !DILocation(line: 144, column: 78, scope: !111)
!126 = !DILocation(line: 144, column: 89, scope: !111)
!127 = !DILocation(line: 144, column: 9, scope: !111)
!128 = distinct !DISubprogram(name: "make_color_rgb", linkageName: "std.core.string.ansi.make_color_rgb", scope: !7, file: !7, line: 152, type: !129, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!129 = !DISubroutineType(types: !130)
!130 = !{!84, !91, !16, !16, !16, !20}
!131 = !DILocalVariable(name: "mem", arg: 1, scope: !128, file: !7, line: 152, type: !91)
!132 = !DILocation(line: 152, column: 36, scope: !128)
!133 = !DILocalVariable(name: "r", arg: 2, scope: !128, file: !7, line: 152, type: !16)
!134 = !DILocation(line: 152, column: 46, scope: !128)
!135 = !DILocalVariable(name: "g", arg: 3, scope: !128, file: !7, line: 152, type: !16)
!136 = !DILocation(line: 152, column: 54, scope: !128)
!137 = !DILocalVariable(name: "b", arg: 4, scope: !128, file: !7, line: 152, type: !16)
!138 = !DILocation(line: 152, column: 62, scope: !128)
!139 = !DILocalVariable(name: "bg", arg: 5, scope: !128, file: !7, line: 152, type: !20)
!140 = !DILocation(line: 152, column: 70, scope: !128)
!141 = !DILocation(line: 154, column: 51, scope: !128)
!142 = !DILocation(line: 154, column: 60, scope: !128)
!143 = !DILocation(line: 154, column: 63, scope: !128)
!144 = !DILocation(line: 154, column: 66, scope: !128)
!145 = !DILocation(line: 154, column: 69, scope: !128)
!146 = !DILocation(line: 154, column: 9, scope: !128)
!147 = distinct !DISubprogram(name: "make_tcolor_rgb", linkageName: "std.core.string.ansi.make_tcolor_rgb", scope: !7, file: !7, line: 162, type: !148, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !41)
!148 = !DISubroutineType(types: !149)
!149 = !{!84, !16, !16, !16, !20}
