; ModuleID = 'std::net::url'
source_filename = "std::net::url"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"List{String}" = type { i64, i64, %any, ptr }
%"char[][]" = type { ptr, i64 }
%"HashMap{String, List{String}}" = type { %"Entry{String, List{String}}*[]", %any, i32, i32, float }
%"Entry{String, List{String}}*[]" = type { ptr, i64 }
%Url = type { %"char[]", %"char[]", i32, %"char[]", %"char[]", %"char[]", %"char[]", %"char[]", %any }
%UrlQueryValues = type { %"HashMap{String, List{String}}", %"List{String}" }
%Splitter = type { %"char[]", %"char[]", i64, i32, i32 }

@.enum.UNRESERVED = internal constant [11 x i8] c"UNRESERVED\00", align 1
@.enum.PATH = internal constant [5 x i8] c"PATH\00", align 1
@.enum.HOST = internal constant [5 x i8] c"HOST\00", align 1
@.enum.USERPASS = internal constant [9 x i8] c"USERPASS\00", align 1
@.enum.QUERY = internal constant [6 x i8] c"QUERY\00", align 1
@.enum.FRAGMENT = internal constant [9 x i8] c"FRAGMENT\00", align 1
@"$ct.char" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "url_encoding.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/net")
!8 = !{!9, !18}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "UrlEncodingMode", scope: !7, file: !7, line: 8, baseType: !10, size: 8, align: 8, elements: !11)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!12, !13, !14, !15, !16, !17}
!12 = !DIEnumerator(name: "UNRESERVED", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "PATH", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "HOST", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "USERPASS", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "QUERY", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "FRAGMENT", value: 5, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SplitterType", scope: !20, file: !19, line: 1192, baseType: !35, size: 32, align: 32, elements: !36)
!19 = !DIFile(filename: "url.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/net")
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "Splitter", scope: !19, file: !19, line: 1202, size: 384, align: 64, elements: !21, identifier: "std.core.string.Splitter")
!21 = !{!22, !31, !32, !33, !34}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !20, file: !19, line: 1204, baseType: !23, size: 128, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !25, identifier: "char[]")
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !24, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !30)
!30 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !20, file: !19, line: 1205, baseType: !23, size: 128, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !20, file: !19, line: 1206, baseType: !29, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !20, file: !19, line: 1207, baseType: !18, size: 32, align: 32, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "last_index", scope: !20, file: !19, line: 1208, baseType: !35, size: 32, align: 32, offset: 352)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "TOKENIZE", value: 0)
!38 = !DIEnumerator(name: "TOKENIZE_ALL", value: 1)
!39 = !DIEnumerator(name: "TOKENIZE_ALL_SKIP_LAST", value: 2)
!40 = distinct !DISubprogram(name: "should_encode", linkageName: "std.net.url.should_encode", scope: !7, file: !7, line: 26, type: !41, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !10, !9}
!43 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!44 = !{}
!45 = !DILocalVariable(name: "c", arg: 1, scope: !40, file: !7, line: 26, type: !10)
!46 = !DILocation(line: 26, column: 28, scope: !40)
!47 = !DILocalVariable(name: "mode", arg: 2, scope: !40, file: !7, line: 26, type: !9)
!48 = !DILocation(line: 26, column: 47, scope: !40)
!49 = !DILocation(line: 17, column: 42, scope: !50, inlinedAt: !52)
!50 = distinct !DISubprogram(name: "@is_alnum", linkageName: "@is_alnum", scope: !51, file: !51, line: 17, scopeLine: 17, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!51 = !DIFile(filename: "ascii.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!52 = !DILocation(line: 52, column: 38, scope: !53, inlinedAt: !54)
!53 = distinct !DISubprogram(name: "is_alnum", linkageName: "is_alnum", scope: !51, file: !51, line: 52, scopeLine: 52, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!54 = !DILocation(line: 29, column: 6, scope: !40)
!55 = !DILocation(line: 29, column: 27, scope: !40)
!56 = !DILocation(line: 32, column: 10, scope: !40)
!57 = !DILocation(line: 32, column: 70, scope: !40)
!58 = !DILocation(line: 35, column: 10, scope: !40)
!59 = !DILocation(line: 35, column: 48, scope: !40)
!60 = !DILocation(line: 38, column: 9, scope: !40)
!61 = distinct !DISubprogram(name: "encode_len", linkageName: "std.net.url.encode_len", scope: !7, file: !7, line: 44, type: !62, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!62 = !DISubroutineType(types: !63)
!63 = !{!29, !23, !9}
!64 = !DILocalVariable(name: "s", arg: 1, scope: !61, file: !7, line: 44, type: !23)
!65 = !DILocation(line: 44, column: 26, scope: !61)
!66 = !DILocalVariable(name: "mode", arg: 2, scope: !61, file: !7, line: 44, type: !9)
!67 = !DILocation(line: 44, column: 45, scope: !61)
!68 = !DILocalVariable(name: "n", scope: !61, file: !7, line: 46, type: !29, align: 64)
!69 = !DILocation(line: 46, column: 6, scope: !61)
!70 = !DILocation(line: 47, column: 14, scope: !71)
!71 = distinct !DILexicalBlock(scope: !61, file: !7, line: 47, column: 2)
!72 = !DILocalVariable(name: ".temp", scope: !71, file: !7, line: 47, type: !29, align: 64)
!73 = !DILocalVariable(name: "c", scope: !74, file: !7, line: 47, type: !10, align: 8)
!74 = distinct !DILexicalBlock(scope: !71, file: !7, line: 48, column: 2)
!75 = !DILocation(line: 47, column: 11, scope: !74)
!76 = !DILocation(line: 47, column: 14, scope: !74)
!77 = !DILocation(line: 49, column: 25, scope: !78)
!78 = distinct !DILexicalBlock(scope: !74, file: !7, line: 48, column: 2)
!79 = !DILocation(line: 49, column: 8, scope: !78)
!80 = !DILocation(line: 49, column: 32, scope: !78)
!81 = !DILocation(line: 50, column: 7, scope: !78)
!82 = !DILocation(line: 50, column: 19, scope: !78)
!83 = !DILocation(line: 52, column: 4, scope: !84)
!84 = distinct !DILexicalBlock(scope: !78, file: !7, line: 51, column: 3)
!85 = !DILocation(line: 55, column: 9, scope: !61)
!86 = !DILocation(line: 55, column: 21, scope: !61)
!87 = !DILocation(line: 55, column: 17, scope: !61)
!88 = distinct !DISubprogram(name: "encode", linkageName: "std.net.url.encode", scope: !7, file: !7, line: 67, type: !89, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!89 = !DISubroutineType(types: !90)
!90 = !{!23, !91, !23, !9}
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !92, identifier: "Allocator")
!92 = !{!93, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !91, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!97 = !DILocalVariable(name: "allocator", arg: 1, scope: !88, file: !7, line: 67, type: !91)
!98 = !DILocation(line: 67, column: 28, scope: !88)
!99 = !DILocalVariable(name: "s", arg: 2, scope: !88, file: !7, line: 67, type: !23)
!100 = !DILocation(line: 67, column: 46, scope: !88)
!101 = !DILocalVariable(name: "mode", arg: 3, scope: !88, file: !7, line: 67, type: !9)
!102 = !DILocation(line: 67, column: 65, scope: !88)
!103 = !DILocalVariable(name: "state", scope: !104, file: !7, line: 679, type: !106, align: 64)
!104 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !105, file: !105, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!105 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !7, file: !7, line: 496, baseType: !107, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 31, size: 704, align: 64, elements: !109, identifier: "std.core.mem.allocator.TempAllocator")
!109 = !{!110, !111, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !108, file: !7, line: 33, baseType: !91, size: 128, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !108, file: !7, line: 34, baseType: !112, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64, dwarfAddressSpace: 0)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 54, size: 256, align: 64, elements: !114, identifier: "std.core.mem.allocator.TempAllocatorPage")
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !113, file: !7, line: 56, baseType: !112, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !113, file: !7, line: 57, baseType: !94, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !113, file: !7, line: 58, baseType: !29, size: 64, align: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !113, file: !7, line: 59, baseType: !29, size: 64, align: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !7, line: 60, baseType: !120, align: 8, offset: 256)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 0, lowerBound: 0)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !108, file: !7, line: 35, baseType: !107, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !108, file: !7, line: 36, baseType: !43, size: 8, align: 8, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !108, file: !7, line: 37, baseType: !29, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !108, file: !7, line: 38, baseType: !29, size: 64, align: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !108, file: !7, line: 39, baseType: !29, size: 64, align: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !108, file: !7, line: 40, baseType: !29, size: 64, align: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !108, file: !7, line: 41, baseType: !29, size: 64, align: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !108, file: !7, line: 42, baseType: !29, size: 64, align: 64, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !7, line: 43, baseType: !120, align: 8, offset: 704)
!132 = !DILocation(line: 679, column: 12, scope: !104, inlinedAt: !133)
!133 = !DILocation(line: 67, column: 74, scope: !88)
!134 = !DILocation(line: 679, column: 41, scope: !104, inlinedAt: !133)
!135 = !DILocation(line: 679, column: 20, scope: !104, inlinedAt: !133)
!136 = !DILocalVariable(name: "n", scope: !137, file: !7, line: 69, type: !29, align: 64)
!137 = distinct !DILexicalBlock(scope: !88, file: !7, line: 68, column: 1)
!138 = !DILocation(line: 69, column: 6, scope: !137)
!139 = !DILocation(line: 69, column: 24, scope: !137)
!140 = !DILocation(line: 69, column: 10, scope: !137)
!141 = !DILocalVariable(name: "builder", scope: !137, file: !7, line: 70, type: !142, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !7, file: !7, line: 7, baseType: !143, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64, dwarfAddressSpace: 0)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !7, file: !7, line: 8, baseType: null, align: 8)
!145 = !DILocation(line: 70, column: 10, scope: !137)
!146 = !DILocation(line: 70, column: 48, scope: !137)
!147 = !DILocation(line: 70, column: 20, scope: !137)
!148 = !DILocation(line: 72, column: 16, scope: !149)
!149 = distinct !DILexicalBlock(scope: !137, file: !7, line: 72, column: 2)
!150 = !DILocalVariable(name: ".temp", scope: !149, file: !7, line: 72, type: !29, align: 64)
!151 = !DILocation(line: 72, column: 10, scope: !149)
!152 = !DILocalVariable(name: "i", scope: !153, file: !7, line: 72, type: !29, align: 64)
!153 = distinct !DILexicalBlock(scope: !149, file: !7, line: 73, column: 2)
!154 = !DILocation(line: 72, column: 10, scope: !153)
!155 = !DILocalVariable(name: "c", scope: !153, file: !7, line: 72, type: !10, align: 8)
!156 = !DILocation(line: 72, column: 13, scope: !153)
!157 = !DILocation(line: 72, column: 16, scope: !153)
!158 = !DILocation(line: 77, column: 9, scope: !159)
!159 = distinct !DILexicalBlock(scope: !160, file: !7, line: 74, column: 3)
!160 = distinct !DILexicalBlock(scope: !153, file: !7, line: 73, column: 2)
!161 = !DILocation(line: 77, column: 21, scope: !159)
!162 = !DILocation(line: 78, column: 5, scope: !163)
!163 = distinct !DILexicalBlock(scope: !159, file: !7, line: 78, column: 5)
!164 = !DILocation(line: 81, column: 26, scope: !159)
!165 = !DILocation(line: 81, column: 9, scope: !159)
!166 = !DILocation(line: 82, column: 5, scope: !167)
!167 = distinct !DILexicalBlock(scope: !159, file: !7, line: 82, column: 5)
!168 = !DILocalVariable(name: "hex", scope: !167, file: !7, line: 83, type: !23, align: 64)
!169 = !DILocation(line: 83, column: 12, scope: !167)
!170 = !DILocation(line: 83, column: 31, scope: !167)
!171 = !DILocation(line: 83, column: 33, scope: !167)
!172 = !DILocation(line: 83, column: 18, scope: !167)
!173 = !DILocation(line: 84, column: 20, scope: !167)
!174 = !DILocation(line: 417, column: 27, scope: !175, inlinedAt: !178)
!175 = distinct !DILexicalBlock(scope: !177, file: !176, line: 418, column: 1)
!176 = !DIFile(filename: "dstring.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!177 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !176, file: !176, line: 417, scopeLine: 417, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!178 = !DILocation(line: 84, column: 5, scope: !167)
!179 = !DILocation(line: 336, column: 34, scope: !180, inlinedAt: !182)
!180 = distinct !DILexicalBlock(scope: !181, file: !176, line: 337, column: 1)
!181 = distinct !DISubprogram(name: "append_string", linkageName: "append_string", scope: !176, file: !176, line: 336, scopeLine: 336, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!182 = !DILocation(line: 427, column: 4, scope: !177, inlinedAt: !178)
!183 = !DILocation(line: 341, column: 21, scope: !181, inlinedAt: !182)
!184 = !DILocation(line: 341, column: 3, scope: !181, inlinedAt: !182)
!185 = !DILocation(line: 88, column: 25, scope: !186)
!186 = distinct !DILexicalBlock(scope: !159, file: !7, line: 88, column: 5)
!187 = !DILocation(line: 88, column: 5, scope: !186)
!188 = !DILocation(line: 92, column: 26, scope: !137)
!189 = !DILocation(line: 92, column: 9, scope: !137)
!190 = !DILocation(line: 682, column: 23, scope: !191, inlinedAt: !133)
!191 = distinct !DILexicalBlock(scope: !104, file: !105, line: 681, column: 2)
!192 = !DILocation(line: 682, column: 3, scope: !191, inlinedAt: !133)
!193 = distinct !DISubprogram(name: "tencode", linkageName: "std.net.url.tencode", scope: !7, file: !7, line: 103, type: !194, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!194 = !DISubroutineType(types: !195)
!195 = !{!23, !23, !9}
!196 = !DILocalVariable(name: "s", arg: 1, scope: !193, file: !7, line: 103, type: !23)
!197 = !DILocation(line: 103, column: 26, scope: !193)
!198 = !DILocalVariable(name: "mode", arg: 2, scope: !193, file: !7, line: 103, type: !9)
!199 = !DILocation(line: 103, column: 45, scope: !193)
!200 = !DILocation(line: 103, column: 61, scope: !193)
!201 = !DILocation(line: 103, column: 70, scope: !193)
!202 = !DILocation(line: 103, column: 54, scope: !193)
!203 = distinct !DISubprogram(name: "decode_len", linkageName: "std.net.url.decode_len", scope: !7, file: !7, line: 110, type: !204, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!204 = !DISubroutineType(types: !205)
!205 = !{!30, !23, !9}
!206 = !DILocalVariable(name: "s", arg: 1, scope: !203, file: !7, line: 110, type: !23)
!207 = !DILocation(line: 110, column: 27, scope: !203)
!208 = !DILocalVariable(name: "mode", arg: 2, scope: !203, file: !7, line: 110, type: !9)
!209 = !DILocation(line: 110, column: 46, scope: !203)
!210 = !DILocalVariable(name: "n", scope: !203, file: !7, line: 112, type: !29, align: 64)
!211 = !DILocation(line: 112, column: 6, scope: !203)
!212 = !DILocation(line: 113, column: 17, scope: !213)
!213 = distinct !DILexicalBlock(scope: !203, file: !7, line: 113, column: 2)
!214 = !DILocalVariable(name: ".temp", scope: !213, file: !7, line: 113, type: !29, align: 64)
!215 = !DILocation(line: 113, column: 11, scope: !213)
!216 = !DILocalVariable(name: "i", scope: !217, file: !7, line: 113, type: !29, align: 64)
!217 = distinct !DILexicalBlock(scope: !213, file: !7, line: 114, column: 2)
!218 = !DILocation(line: 113, column: 11, scope: !217)
!219 = !DILocalVariable(name: "c", scope: !217, file: !7, line: 113, type: !10, align: 8)
!220 = !DILocation(line: 113, column: 14, scope: !217)
!221 = !DILocation(line: 113, column: 17, scope: !217)
!222 = !DILocation(line: 115, column: 7, scope: !223)
!223 = distinct !DILexicalBlock(scope: !217, file: !7, line: 114, column: 2)
!224 = !DILocation(line: 115, column: 17, scope: !223)
!225 = !DILocation(line: 116, column: 7, scope: !223)
!226 = !DILocation(line: 116, column: 16, scope: !223)
!227 = !DILocation(line: 116, column: 26, scope: !223)
!228 = !DILocation(line: 116, column: 28, scope: !223)
!229 = !DILocation(line: 12, column: 42, scope: !230, inlinedAt: !231)
!230 = distinct !DISubprogram(name: "@is_xdigit", linkageName: "@is_xdigit", scope: !51, file: !51, line: 12, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!231 = !DILocation(line: 47, column: 38, scope: !232, inlinedAt: !227)
!232 = distinct !DISubprogram(name: "is_xdigit", linkageName: "is_xdigit", scope: !51, file: !51, line: 47, scopeLine: 47, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!233 = !DILocation(line: 116, column: 49, scope: !223)
!234 = !DILocation(line: 116, column: 51, scope: !223)
!235 = !DILocation(line: 12, column: 42, scope: !236, inlinedAt: !237)
!236 = distinct !DISubprogram(name: "@is_xdigit", linkageName: "@is_xdigit", scope: !51, file: !51, line: 12, scopeLine: 12, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!237 = !DILocation(line: 47, column: 38, scope: !238, inlinedAt: !233)
!238 = distinct !DISubprogram(name: "is_xdigit", linkageName: "is_xdigit", scope: !51, file: !51, line: 47, scopeLine: 47, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!239 = !DILocation(line: 118, column: 11, scope: !240)
!240 = distinct !DILexicalBlock(scope: !223, file: !7, line: 117, column: 3)
!241 = !DILocation(line: 120, column: 3, scope: !223)
!242 = !DILocation(line: 122, column: 9, scope: !203)
!243 = !DILocation(line: 122, column: 21, scope: !203)
!244 = !DILocation(line: 122, column: 17, scope: !203)
!245 = distinct !DISubprogram(name: "decode", linkageName: "std.net.url.decode", scope: !7, file: !7, line: 134, type: !246, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!246 = !DISubroutineType(types: !247)
!247 = !{!24, !91, !23, !9}
!248 = !DILocalVariable(name: "allocator", arg: 1, scope: !245, file: !7, line: 134, type: !91)
!249 = !DILocation(line: 134, column: 29, scope: !245)
!250 = !DILocalVariable(name: "s", arg: 2, scope: !245, file: !7, line: 134, type: !23)
!251 = !DILocation(line: 134, column: 47, scope: !245)
!252 = !DILocalVariable(name: "mode", arg: 3, scope: !245, file: !7, line: 134, type: !9)
!253 = !DILocation(line: 134, column: 67, scope: !245)
!254 = !DILocalVariable(name: "state", scope: !255, file: !7, line: 679, type: !106, align: 64)
!255 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !105, file: !105, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!256 = !DILocation(line: 679, column: 12, scope: !255, inlinedAt: !257)
!257 = !DILocation(line: 134, column: 76, scope: !245)
!258 = !DILocation(line: 679, column: 41, scope: !255, inlinedAt: !257)
!259 = !DILocation(line: 679, column: 20, scope: !255, inlinedAt: !257)
!260 = !DILocalVariable(name: "n", scope: !261, file: !7, line: 136, type: !29, align: 64)
!261 = distinct !DILexicalBlock(scope: !245, file: !7, line: 135, column: 1)
!262 = !DILocation(line: 136, column: 6, scope: !261)
!263 = !DILocation(line: 136, column: 10, scope: !261)
!264 = !DILocation(line: 682, column: 23, scope: !265, inlinedAt: !257)
!265 = distinct !DILexicalBlock(scope: !255, file: !105, line: 681, column: 2)
!266 = !DILocation(line: 682, column: 3, scope: !265, inlinedAt: !257)
!267 = !DILocalVariable(name: "builder", scope: !261, file: !7, line: 137, type: !142, align: 64)
!268 = !DILocation(line: 137, column: 10, scope: !261)
!269 = !DILocation(line: 137, column: 48, scope: !261)
!270 = !DILocation(line: 137, column: 20, scope: !261)
!271 = !DILocalVariable(name: "i", scope: !272, file: !7, line: 139, type: !29, align: 64)
!272 = distinct !DILexicalBlock(scope: !261, file: !7, line: 139, column: 2)
!273 = !DILocation(line: 139, column: 11, scope: !272)
!274 = !DILocation(line: 139, column: 15, scope: !272)
!275 = !DILocation(line: 139, column: 18, scope: !272)
!276 = !DILocation(line: 139, column: 22, scope: !272)
!277 = !DILocation(line: 141, column: 11, scope: !278)
!278 = distinct !DILexicalBlock(scope: !279, file: !7, line: 141, column: 3)
!279 = distinct !DILexicalBlock(scope: !272, file: !7, line: 140, column: 2)
!280 = !DILocation(line: 141, column: 13, scope: !278)
!281 = !DILocalVariable(name: "hex", scope: !282, file: !7, line: 145, type: !24, align: 64)
!282 = distinct !DILexicalBlock(scope: !278, file: !7, line: 145, column: 5)
!283 = !DILocation(line: 145, column: 12, scope: !282)
!284 = !DILocation(line: 145, column: 31, scope: !282)
!285 = !DILocation(line: 145, column: 33, scope: !282)
!286 = !DILocation(line: 145, column: 18, scope: !282)
!287 = !DILocation(line: 682, column: 23, scope: !288, inlinedAt: !257)
!288 = distinct !DILexicalBlock(scope: !255, file: !105, line: 681, column: 2)
!289 = !DILocation(line: 682, column: 3, scope: !288, inlinedAt: !257)
!290 = !DILocation(line: 417, column: 27, scope: !291, inlinedAt: !293)
!291 = distinct !DILexicalBlock(scope: !292, file: !176, line: 418, column: 1)
!292 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !176, file: !176, line: 417, scopeLine: 417, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!293 = !DILocation(line: 146, column: 5, scope: !282)
!294 = !DILocation(line: 336, column: 34, scope: !295, inlinedAt: !297)
!295 = distinct !DILexicalBlock(scope: !296, file: !176, line: 337, column: 1)
!296 = distinct !DISubprogram(name: "append_string", linkageName: "append_string", scope: !176, file: !176, line: 336, scopeLine: 336, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!297 = !DILocation(line: 435, column: 6, scope: !292, inlinedAt: !293)
!298 = !DILocation(line: 341, column: 21, scope: !296, inlinedAt: !297)
!299 = !DILocation(line: 341, column: 3, scope: !296, inlinedAt: !297)
!300 = !DILocation(line: 147, column: 5, scope: !282)
!301 = !DILocation(line: 151, column: 26, scope: !302)
!302 = distinct !DILexicalBlock(scope: !278, file: !7, line: 151, column: 5)
!303 = !DILocation(line: 151, column: 49, scope: !302)
!304 = !DILocation(line: 151, column: 5, scope: !302)
!305 = !DILocation(line: 155, column: 25, scope: !306)
!306 = distinct !DILexicalBlock(scope: !278, file: !7, line: 155, column: 5)
!307 = !DILocation(line: 155, column: 27, scope: !306)
!308 = !DILocation(line: 155, column: 5, scope: !306)
!309 = !DILocation(line: 139, column: 29, scope: !272)
!310 = !DILocation(line: 159, column: 26, scope: !261)
!311 = !DILocation(line: 159, column: 9, scope: !261)
!312 = !DILocation(line: 682, column: 23, scope: !313, inlinedAt: !257)
!313 = distinct !DILexicalBlock(scope: !255, file: !105, line: 681, column: 2)
!314 = !DILocation(line: 682, column: 3, scope: !313, inlinedAt: !257)
!315 = distinct !DISubprogram(name: "tdecode", linkageName: "std.net.url.tdecode", scope: !7, file: !7, line: 170, type: !316, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!316 = !DISubroutineType(types: !317)
!317 = !{!24, !23, !9}
!318 = !DILocalVariable(name: "s", arg: 1, scope: !315, file: !7, line: 170, type: !23)
!319 = !DILocation(line: 170, column: 27, scope: !315)
!320 = !DILocalVariable(name: "mode", arg: 2, scope: !315, file: !7, line: 170, type: !9)
!321 = !DILocation(line: 170, column: 47, scope: !315)
!322 = !DILocation(line: 170, column: 63, scope: !315)
!323 = !DILocation(line: 170, column: 56, scope: !315)
!324 = distinct !DISubprogram(name: "to_format", linkageName: "std.net.url.Url.to_format", scope: !19, file: !19, line: 171, type: !325, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!325 = !DISubroutineType(types: !326)
!326 = !{!30, !327, !340}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Url", scope: !19, file: !19, line: 29, size: 1088, align: 64, elements: !329, identifier: "std.net.url.Url")
!329 = !{!330, !331, !332, !334, !335, !336, !337, !338, !339}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "scheme", scope: !328, file: !19, line: 31, baseType: !23, size: 128, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !328, file: !19, line: 32, baseType: !23, size: 128, align: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !328, file: !19, line: 33, baseType: !333, size: 32, align: 32, offset: 256)
!333 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !328, file: !19, line: 34, baseType: !23, size: 128, align: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !328, file: !19, line: 35, baseType: !23, size: 128, align: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !328, file: !19, line: 36, baseType: !23, size: 128, align: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !328, file: !19, line: 37, baseType: !23, size: 128, align: 64, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !328, file: !19, line: 38, baseType: !23, size: 128, align: 64, offset: 832)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !328, file: !19, line: 40, baseType: !91, size: 128, align: 64, offset: 960)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64, dwarfAddressSpace: 0)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !19, file: !19, line: 65, size: 320, align: 64, elements: !342, identifier: "std.io.Formatter")
!342 = !{!343, !344, !349}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !19, line: 67, baseType: !94, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !341, file: !19, line: 68, baseType: !345, size: 64, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !19, file: !19, line: 18, baseType: !346, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64, dwarfAddressSpace: 0)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !94, !10}
!349 = !DIDerivedType(tag: DW_TAG_member, scope: !341, file: !19, line: 69, baseType: !350, size: 192, align: 64, offset: 128)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !341, file: !19, line: 69, size: 192, align: 64, elements: !351)
!351 = !{!352, !353, !354, !355}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !350, file: !19, line: 71, baseType: !333, size: 32, align: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !350, file: !19, line: 72, baseType: !333, size: 32, align: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !350, file: !19, line: 73, baseType: !333, size: 32, align: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !350, file: !19, line: 74, baseType: !356, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !357)
!357 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!358 = !DILocation(line: 172, column: 1, scope: !324)
!359 = !DILocalVariable(name: "self", arg: 1, scope: !324, file: !19, line: 171, type: !327)
!360 = !DILocation(line: 171, column: 23, scope: !324)
!361 = !DILocalVariable(name: "f", arg: 2, scope: !324, file: !19, line: 171, type: !340)
!362 = !DILocation(line: 171, column: 41, scope: !324)
!363 = !DILocalVariable(name: "len", scope: !324, file: !19, line: 173, type: !29, align: 64)
!364 = !DILocation(line: 173, column: 6, scope: !324)
!365 = !DILocation(line: 175, column: 6, scope: !324)
!366 = !DILocation(line: 177, column: 3, scope: !367)
!367 = distinct !DILexicalBlock(scope: !324, file: !19, line: 176, column: 2)
!368 = !DILocation(line: 177, column: 18, scope: !367)
!369 = !DILocation(line: 177, column: 10, scope: !367)
!370 = !DILocation(line: 178, column: 3, scope: !367)
!371 = !DILocation(line: 178, column: 10, scope: !367)
!372 = !DILocation(line: 179, column: 7, scope: !367)
!373 = !DILocation(line: 179, column: 26, scope: !367)
!374 = !DILocation(line: 179, column: 33, scope: !367)
!375 = !DILocation(line: 183, column: 6, scope: !324)
!376 = !DILocalVariable(name: "buffer", scope: !377, file: !19, line: 610, type: !378, align: 8)
!377 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !105, file: !105, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, align: 8, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 64, lowerBound: 0)
!381 = !DILocation(line: 610, column: 14, scope: !377, inlinedAt: !382)
!382 = !DILocation(line: 185, column: 3, scope: !383)
!383 = distinct !DILexicalBlock(scope: !324, file: !19, line: 184, column: 2)
!384 = !DILocalVariable(name: "allocator", scope: !377, file: !19, line: 611, type: !385, align: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !19, file: !19, line: 12, size: 384, align: 64, elements: !386, identifier: "std.core.mem.allocator.OnStackAllocator")
!386 = !{!387, !388, !389, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !385, file: !19, line: 14, baseType: !91, size: 128, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !385, file: !19, line: 15, baseType: !24, size: 128, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !385, file: !19, line: 16, baseType: !29, size: 64, align: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !385, file: !19, line: 17, baseType: !391, size: 64, align: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64, dwarfAddressSpace: 0)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !19, file: !19, line: 20, size: 192, align: 64, elements: !393, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.7818")
!393 = !{!394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !392, file: !19, line: 22, baseType: !43, size: 8, align: 8)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !392, file: !19, line: 23, baseType: !391, size: 64, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !392, file: !19, line: 24, baseType: !94, size: 64, align: 64, offset: 128)
!397 = !DILocation(line: 611, column: 19, scope: !377, inlinedAt: !382)
!398 = !DILocation(line: 612, column: 18, scope: !377, inlinedAt: !382)
!399 = !DILocation(line: 612, column: 26, scope: !377, inlinedAt: !382)
!400 = !DILocation(line: 612, column: 2, scope: !377, inlinedAt: !382)
!401 = !DILocalVariable(name: "smem", scope: !383, file: !19, line: 185, type: !91, align: 64)
!402 = !DILocation(line: 185, column: 28, scope: !383)
!403 = !DILocation(line: 614, column: 8, scope: !404, inlinedAt: !382)
!404 = distinct !DILexicalBlock(scope: !377, file: !105, line: 614, column: 2)
!405 = !DILocation(line: 187, column: 4, scope: !406)
!406 = distinct !DILexicalBlock(scope: !383, file: !19, line: 186, column: 3)
!407 = !DILocation(line: 187, column: 32, scope: !406)
!408 = !DILocation(line: 187, column: 47, scope: !406)
!409 = !DILocation(line: 187, column: 19, scope: !406)
!410 = !DILocation(line: 187, column: 11, scope: !406)
!411 = !DILocation(line: 613, column: 8, scope: !412, inlinedAt: !382)
!412 = distinct !DILexicalBlock(scope: !377, file: !105, line: 613, column: 8)
!413 = !DILocation(line: 613, column: 8, scope: !414, inlinedAt: !382)
!414 = distinct !DILexicalBlock(scope: !377, file: !105, line: 613, column: 8)
!415 = !DILocation(line: 189, column: 7, scope: !383)
!416 = !DILocation(line: 191, column: 4, scope: !417)
!417 = distinct !DILexicalBlock(scope: !383, file: !19, line: 190, column: 3)
!418 = !DILocation(line: 191, column: 11, scope: !417)
!419 = !DILocalVariable(name: "buffer", scope: !420, file: !19, line: 610, type: !378, align: 8)
!420 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !105, file: !105, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!421 = !DILocation(line: 610, column: 14, scope: !420, inlinedAt: !422)
!422 = !DILocation(line: 192, column: 4, scope: !417)
!423 = !DILocalVariable(name: "allocator", scope: !420, file: !19, line: 611, type: !385, align: 64)
!424 = !DILocation(line: 611, column: 19, scope: !420, inlinedAt: !422)
!425 = !DILocation(line: 612, column: 18, scope: !420, inlinedAt: !422)
!426 = !DILocation(line: 612, column: 26, scope: !420, inlinedAt: !422)
!427 = !DILocation(line: 612, column: 2, scope: !420, inlinedAt: !422)
!428 = !DILocalVariable(name: "smem", scope: !417, file: !19, line: 192, type: !91, align: 64)
!429 = !DILocation(line: 192, column: 29, scope: !417)
!430 = !DILocation(line: 614, column: 8, scope: !431, inlinedAt: !422)
!431 = distinct !DILexicalBlock(scope: !420, file: !105, line: 614, column: 2)
!432 = !DILocation(line: 194, column: 5, scope: !433)
!433 = distinct !DILexicalBlock(scope: !417, file: !19, line: 193, column: 4)
!434 = !DILocation(line: 194, column: 33, scope: !433)
!435 = !DILocation(line: 194, column: 48, scope: !433)
!436 = !DILocation(line: 194, column: 20, scope: !433)
!437 = !DILocation(line: 194, column: 12, scope: !433)
!438 = !DILocation(line: 613, column: 8, scope: !439, inlinedAt: !422)
!439 = distinct !DILexicalBlock(scope: !420, file: !105, line: 613, column: 8)
!440 = !DILocation(line: 613, column: 8, scope: !441, inlinedAt: !422)
!441 = distinct !DILexicalBlock(scope: !420, file: !105, line: 613, column: 8)
!442 = !DILocation(line: 197, column: 3, scope: !383)
!443 = !DILocation(line: 197, column: 10, scope: !383)
!444 = !DILocalVariable(name: "buffer", scope: !445, file: !19, line: 610, type: !446, align: 8)
!445 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !105, file: !105, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, align: 8, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 128, lowerBound: 0)
!449 = !DILocation(line: 610, column: 14, scope: !445, inlinedAt: !450)
!450 = !DILocation(line: 201, column: 2, scope: !324)
!451 = !DILocalVariable(name: "allocator", scope: !445, file: !19, line: 611, type: !385, align: 64)
!452 = !DILocation(line: 611, column: 19, scope: !445, inlinedAt: !450)
!453 = !DILocation(line: 612, column: 18, scope: !445, inlinedAt: !450)
!454 = !DILocation(line: 612, column: 26, scope: !445, inlinedAt: !450)
!455 = !DILocation(line: 612, column: 2, scope: !445, inlinedAt: !450)
!456 = !DILocalVariable(name: "smem", scope: !324, file: !19, line: 201, type: !91, align: 64)
!457 = !DILocation(line: 201, column: 28, scope: !324)
!458 = !DILocation(line: 614, column: 8, scope: !459, inlinedAt: !450)
!459 = distinct !DILexicalBlock(scope: !445, file: !105, line: 614, column: 2)
!460 = !DILocation(line: 203, column: 3, scope: !461)
!461 = distinct !DILexicalBlock(scope: !324, file: !19, line: 202, column: 2)
!462 = !DILocation(line: 203, column: 31, scope: !461)
!463 = !DILocation(line: 203, column: 42, scope: !461)
!464 = !DILocation(line: 203, column: 18, scope: !461)
!465 = !DILocation(line: 203, column: 10, scope: !461)
!466 = !DILocation(line: 613, column: 8, scope: !467, inlinedAt: !450)
!467 = distinct !DILexicalBlock(scope: !445, file: !105, line: 613, column: 8)
!468 = !DILocation(line: 613, column: 8, scope: !469, inlinedAt: !450)
!469 = distinct !DILexicalBlock(scope: !445, file: !105, line: 613, column: 8)
!470 = !DILocation(line: 207, column: 6, scope: !324)
!471 = !DILocation(line: 207, column: 17, scope: !324)
!472 = !DILocation(line: 207, column: 40, scope: !324)
!473 = !DILocation(line: 207, column: 24, scope: !324)
!474 = !DILocalVariable(name: "buffer", scope: !475, file: !19, line: 610, type: !476, align: 8)
!475 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !105, file: !105, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, align: 8, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 256, lowerBound: 0)
!479 = !DILocation(line: 610, column: 14, scope: !475, inlinedAt: !480)
!480 = !DILocation(line: 210, column: 2, scope: !324)
!481 = !DILocalVariable(name: "allocator", scope: !475, file: !19, line: 611, type: !385, align: 64)
!482 = !DILocation(line: 611, column: 19, scope: !475, inlinedAt: !480)
!483 = !DILocation(line: 612, column: 18, scope: !475, inlinedAt: !480)
!484 = !DILocation(line: 612, column: 26, scope: !475, inlinedAt: !480)
!485 = !DILocation(line: 612, column: 2, scope: !475, inlinedAt: !480)
!486 = !DILocalVariable(name: "smem", scope: !324, file: !19, line: 210, type: !91, align: 64)
!487 = !DILocation(line: 210, column: 28, scope: !324)
!488 = !DILocation(line: 614, column: 8, scope: !489, inlinedAt: !480)
!489 = distinct !DILexicalBlock(scope: !475, file: !105, line: 614, column: 2)
!490 = !DILocation(line: 212, column: 3, scope: !491)
!491 = distinct !DILexicalBlock(scope: !324, file: !19, line: 211, column: 2)
!492 = !DILocation(line: 212, column: 31, scope: !491)
!493 = !DILocation(line: 212, column: 42, scope: !491)
!494 = !DILocation(line: 212, column: 18, scope: !491)
!495 = !DILocation(line: 212, column: 10, scope: !491)
!496 = !DILocation(line: 613, column: 8, scope: !497, inlinedAt: !480)
!497 = distinct !DILexicalBlock(scope: !475, file: !105, line: 613, column: 8)
!498 = !DILocation(line: 613, column: 8, scope: !499, inlinedAt: !480)
!499 = distinct !DILexicalBlock(scope: !475, file: !105, line: 613, column: 8)
!500 = !DILocation(line: 217, column: 6, scope: !324)
!501 = !DILocation(line: 219, column: 3, scope: !502)
!502 = distinct !DILexicalBlock(scope: !324, file: !19, line: 218, column: 2)
!503 = !DILocation(line: 219, column: 10, scope: !502)
!504 = !DILocation(line: 220, column: 3, scope: !502)
!505 = !DILocation(line: 220, column: 18, scope: !502)
!506 = !DILocation(line: 220, column: 10, scope: !502)
!507 = !DILocation(line: 224, column: 6, scope: !324)
!508 = !DILocalVariable(name: "buffer", scope: !509, file: !19, line: 610, type: !476, align: 8)
!509 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !105, file: !105, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!510 = !DILocation(line: 610, column: 14, scope: !509, inlinedAt: !511)
!511 = !DILocation(line: 226, column: 3, scope: !512)
!512 = distinct !DILexicalBlock(scope: !324, file: !19, line: 225, column: 2)
!513 = !DILocalVariable(name: "allocator", scope: !509, file: !19, line: 611, type: !385, align: 64)
!514 = !DILocation(line: 611, column: 19, scope: !509, inlinedAt: !511)
!515 = !DILocation(line: 612, column: 18, scope: !509, inlinedAt: !511)
!516 = !DILocation(line: 612, column: 26, scope: !509, inlinedAt: !511)
!517 = !DILocation(line: 612, column: 2, scope: !509, inlinedAt: !511)
!518 = !DILocalVariable(name: "smem", scope: !512, file: !19, line: 226, type: !91, align: 64)
!519 = !DILocation(line: 226, column: 29, scope: !512)
!520 = !DILocation(line: 614, column: 8, scope: !521, inlinedAt: !511)
!521 = distinct !DILexicalBlock(scope: !509, file: !105, line: 614, column: 2)
!522 = !DILocation(line: 228, column: 4, scope: !523)
!523 = distinct !DILexicalBlock(scope: !512, file: !19, line: 227, column: 3)
!524 = !DILocation(line: 228, column: 11, scope: !523)
!525 = !DILocation(line: 613, column: 8, scope: !526, inlinedAt: !511)
!526 = distinct !DILexicalBlock(scope: !509, file: !105, line: 613, column: 8)
!527 = !DILocation(line: 229, column: 4, scope: !523)
!528 = !DILocation(line: 229, column: 32, scope: !523)
!529 = !DILocation(line: 229, column: 47, scope: !523)
!530 = !DILocation(line: 229, column: 19, scope: !523)
!531 = !DILocation(line: 229, column: 11, scope: !523)
!532 = !DILocation(line: 613, column: 8, scope: !533, inlinedAt: !511)
!533 = distinct !DILexicalBlock(scope: !509, file: !105, line: 613, column: 8)
!534 = !DILocation(line: 613, column: 8, scope: !535, inlinedAt: !511)
!535 = distinct !DILexicalBlock(scope: !509, file: !105, line: 613, column: 8)
!536 = !DILocation(line: 232, column: 9, scope: !324)
!537 = distinct !DISubprogram(name: "to_string", linkageName: "std.net.url.Url.to_string", scope: !19, file: !19, line: 235, type: !538, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!538 = !DISubroutineType(types: !539)
!539 = !{!23, !327, !91}
!540 = !DILocation(line: 236, column: 1, scope: !537)
!541 = !DILocalVariable(name: "self", arg: 1, scope: !537, file: !19, line: 235, type: !327)
!542 = !DILocation(line: 235, column: 25, scope: !537)
!543 = !DILocalVariable(name: "allocator", arg: 2, scope: !537, file: !19, line: 235, type: !91)
!544 = !DILocation(line: 235, column: 42, scope: !537)
!545 = !DILocation(line: 237, column: 42, scope: !537)
!546 = !DILocation(line: 237, column: 9, scope: !537)
!547 = distinct !DISubprogram(name: "add", linkageName: "std.net.url.UrlQueryValues.add", scope: !19, file: !19, line: 292, type: !548, scopeLine: 292, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!548 = !DISubroutineType(types: !549)
!549 = !{!550, !550, !23, !23}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64, dwarfAddressSpace: 0)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "UrlQueryValues", scope: !19, file: !19, line: 243, size: 704, align: 64, elements: !552, identifier: "std.net.url.UrlQueryValues")
!552 = !{!553, !581}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !551, file: !19, line: 245, baseType: !554, size: 384, align: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap{String, List{String}}", scope: !551, file: !19, line: 29, size: 384, align: 64, elements: !555, identifier: "std.collections.map.HashMap$String$std.collections.list.List$String$$")
!555 = !{!556, !576, !577, !578, !579}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !554, file: !19, line: 31, baseType: !557, size: 128, align: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{String, List{String}}*[]", size: 128, align: 64, elements: !558, identifier: "Entry{String, List{String}}*[]")
!558 = !{!559, !575}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !557, baseType: !560, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64, dwarfAddressSpace: 0)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64, dwarfAddressSpace: 0)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{String, List{String}}", scope: !19, file: !19, line: 21, size: 576, align: 64, elements: !563, identifier: "std.collections.map.Entry$String$std.collections.list.List$String$$")
!563 = !{!564, !565, !566, !574}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !562, file: !19, line: 23, baseType: !333, size: 32, align: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !562, file: !19, line: 24, baseType: !23, size: 128, align: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !562, file: !19, line: 25, baseType: !567, size: 320, align: 64, offset: 192)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{String}", scope: !562, file: !19, line: 18, size: 320, align: 64, elements: !568, identifier: "std.collections.list.List$String$")
!568 = !{!569, !570, !571, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !567, file: !19, line: 20, baseType: !29, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !567, file: !19, line: 21, baseType: !29, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !567, file: !19, line: 22, baseType: !91, size: 128, align: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !567, file: !19, line: 23, baseType: !573, size: 64, align: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !562, file: !19, line: 26, baseType: !561, size: 64, align: 64, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !557, baseType: !29, size: 64, align: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !554, file: !19, line: 32, baseType: !91, size: 128, align: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !554, file: !19, line: 34, baseType: !333, size: 32, align: 32, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !554, file: !19, line: 36, baseType: !333, size: 32, align: 32, offset: 288)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !554, file: !19, line: 37, baseType: !580, size: 32, align: 32, offset: 320)
!580 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "key_order", scope: !551, file: !19, line: 246, baseType: !582, size: 320, align: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "UrlQueryValueList", scope: !19, file: !19, line: 241, baseType: !567, align: 64)
!583 = !DILocation(line: 293, column: 1, scope: !547)
!584 = !DILocalVariable(name: "self", arg: 1, scope: !547, file: !19, line: 292, type: !550)
!585 = !DILocation(line: 292, column: 39, scope: !547)
!586 = !DILocalVariable(name: "key", arg: 2, scope: !547, file: !19, line: 292, type: !23)
!587 = !DILocation(line: 292, column: 53, scope: !547)
!588 = !DILocalVariable(name: "value", arg: 3, scope: !547, file: !19, line: 292, type: !23)
!589 = !DILocation(line: 292, column: 65, scope: !547)
!590 = !DILocalVariable(name: "value_copy", scope: !547, file: !19, line: 294, type: !23, align: 64)
!591 = !DILocation(line: 294, column: 9, scope: !547)
!592 = !DILocation(line: 294, column: 33, scope: !547)
!593 = !DILocation(line: 294, column: 22, scope: !547)
!594 = !DILocalVariable(name: "existing", scope: !547, file: !19, line: 295, type: !595, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64, dwarfAddressSpace: 0)
!596 = !DILocation(line: 295, column: 10, scope: !547)
!597 = !DILocation(line: 295, column: 21, scope: !547)
!598 = !DILocation(line: 297, column: 17, scope: !599)
!599 = distinct !DILexicalBlock(scope: !547, file: !19, line: 296, column: 2)
!600 = !DILocation(line: 297, column: 3, scope: !599)
!601 = !DILocalVariable(name: "new_list", scope: !602, file: !19, line: 301, type: !582, align: 64)
!602 = distinct !DILexicalBlock(scope: !547, file: !19, line: 300, column: 2)
!603 = !DILocation(line: 301, column: 21, scope: !602)
!604 = !DILocation(line: 302, column: 28, scope: !602)
!605 = !DILocation(line: 302, column: 46, scope: !602)
!606 = !DILocation(line: 55, column: 11, scope: !602)
!607 = !DILocation(line: 302, column: 3, scope: !602)
!608 = !DILocalVariable(name: ".temp", scope: !602, file: !19, line: 303, type: !567, align: 64)
!609 = !DILocation(line: 303, column: 18, scope: !602)
!610 = !DILocation(line: 303, column: 5, scope: !602)
!611 = !DILocation(line: 303, column: 3, scope: !602)
!612 = !DILocation(line: 304, column: 3, scope: !602)
!613 = !DILocation(line: 304, column: 32, scope: !602)
!614 = !DILocation(line: 304, column: 23, scope: !602)
!615 = !DILocation(line: 306, column: 9, scope: !547)
!616 = distinct !DISubprogram(name: "to_format", linkageName: "std.net.url.UrlQueryValues.to_format", scope: !19, file: !19, line: 311, type: !617, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!617 = !DISubroutineType(types: !618)
!618 = !{!30, !550, !340}
!619 = !DILocation(line: 312, column: 1, scope: !616)
!620 = !DILocalVariable(name: "self", arg: 1, scope: !616, file: !19, line: 311, type: !550)
!621 = !DILocation(line: 311, column: 34, scope: !616)
!622 = !DILocalVariable(name: "f", arg: 2, scope: !616, file: !19, line: 311, type: !340)
!623 = !DILocation(line: 311, column: 52, scope: !616)
!624 = !DILocalVariable(name: "len", scope: !616, file: !19, line: 313, type: !29, align: 64)
!625 = !DILocation(line: 313, column: 6, scope: !616)
!626 = !DILocalVariable(name: "i", scope: !616, file: !19, line: 314, type: !29, align: 64)
!627 = !DILocation(line: 314, column: 6, scope: !616)
!628 = !DILocation(line: 315, column: 16, scope: !629)
!629 = distinct !DILexicalBlock(scope: !616, file: !19, line: 315, column: 2)
!630 = !DILocalVariable(name: ".temp", scope: !629, file: !19, line: 315, type: !29, align: 64)
!631 = !DILocalVariable(name: "key", scope: !632, file: !19, line: 315, type: !23, align: 64)
!632 = distinct !DILexicalBlock(scope: !629, file: !19, line: 316, column: 2)
!633 = !DILocation(line: 315, column: 11, scope: !632)
!634 = !DILocation(line: 393, column: 26, scope: !635, inlinedAt: !633)
!635 = distinct !DILexicalBlock(scope: !637, file: !636, line: 394, column: 1)
!636 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!637 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !636, file: !636, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!638 = !DILocation(line: 391, column: 11, scope: !635, inlinedAt: !633)
!639 = !DILocation(line: 391, column: 19, scope: !635, inlinedAt: !633)
!640 = !DILocation(line: 315, column: 11, scope: !635, inlinedAt: !633)
!641 = !DILocation(line: 395, column: 9, scope: !637, inlinedAt: !633)
!642 = !DILocation(line: 395, column: 22, scope: !637, inlinedAt: !633)
!643 = !DILocalVariable(name: "buffer", scope: !644, file: !19, line: 610, type: !446, align: 8)
!644 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !105, file: !105, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!645 = !DILocation(line: 610, column: 14, scope: !644, inlinedAt: !646)
!646 = !DILocation(line: 317, column: 3, scope: !647)
!647 = distinct !DILexicalBlock(scope: !632, file: !19, line: 316, column: 2)
!648 = !DILocalVariable(name: "allocator", scope: !644, file: !19, line: 611, type: !385, align: 64)
!649 = !DILocation(line: 611, column: 19, scope: !644, inlinedAt: !646)
!650 = !DILocation(line: 612, column: 18, scope: !644, inlinedAt: !646)
!651 = !DILocation(line: 612, column: 26, scope: !644, inlinedAt: !646)
!652 = !DILocation(line: 612, column: 2, scope: !644, inlinedAt: !646)
!653 = !DILocalVariable(name: "mem", scope: !647, file: !19, line: 317, type: !91, align: 64)
!654 = !DILocation(line: 317, column: 29, scope: !647)
!655 = !DILocation(line: 614, column: 8, scope: !656, inlinedAt: !646)
!656 = distinct !DILexicalBlock(scope: !644, file: !105, line: 614, column: 2)
!657 = !DILocalVariable(name: "encoded_key", scope: !658, file: !19, line: 319, type: !23, align: 64)
!658 = distinct !DILexicalBlock(scope: !647, file: !19, line: 318, column: 3)
!659 = !DILocation(line: 319, column: 11, scope: !658)
!660 = !DILocation(line: 319, column: 42, scope: !658)
!661 = !DILocation(line: 319, column: 25, scope: !658)
!662 = !DILocalVariable(name: "values", scope: !658, file: !19, line: 320, type: !567, align: 64)
!663 = !DILocation(line: 320, column: 23, scope: !658)
!664 = !DILocation(line: 320, column: 32, scope: !658)
!665 = !DILocation(line: 321, column: 14, scope: !658)
!666 = !DILocation(line: 613, column: 8, scope: !667, inlinedAt: !646)
!667 = distinct !DILexicalBlock(scope: !644, file: !105, line: 613, column: 8)
!668 = !DILocation(line: 322, column: 21, scope: !669)
!669 = distinct !DILexicalBlock(scope: !658, file: !19, line: 322, column: 4)
!670 = !DILocalVariable(name: ".temp", scope: !669, file: !19, line: 322, type: !29, align: 64)
!671 = !DILocalVariable(name: "value", scope: !672, file: !19, line: 322, type: !23, align: 64)
!672 = distinct !DILexicalBlock(scope: !669, file: !19, line: 323, column: 4)
!673 = !DILocation(line: 322, column: 13, scope: !672)
!674 = !DILocation(line: 393, column: 26, scope: !675, inlinedAt: !673)
!675 = distinct !DILexicalBlock(scope: !676, file: !636, line: 394, column: 1)
!676 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !636, file: !636, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!677 = !DILocation(line: 391, column: 11, scope: !675, inlinedAt: !673)
!678 = !DILocation(line: 391, column: 19, scope: !675, inlinedAt: !673)
!679 = !DILocation(line: 322, column: 13, scope: !675, inlinedAt: !673)
!680 = !DILocation(line: 395, column: 9, scope: !676, inlinedAt: !673)
!681 = !DILocation(line: 395, column: 22, scope: !676, inlinedAt: !673)
!682 = !DILocation(line: 324, column: 9, scope: !683)
!683 = distinct !DILexicalBlock(scope: !672, file: !19, line: 323, column: 4)
!684 = !DILocation(line: 324, column: 16, scope: !683)
!685 = !DILocation(line: 324, column: 23, scope: !683)
!686 = !DILocation(line: 613, column: 8, scope: !687, inlinedAt: !646)
!687 = distinct !DILexicalBlock(scope: !644, file: !105, line: 613, column: 8)
!688 = !DILocation(line: 325, column: 5, scope: !683)
!689 = !DILocation(line: 325, column: 12, scope: !683)
!690 = !DILocation(line: 613, column: 8, scope: !691, inlinedAt: !646)
!691 = distinct !DILexicalBlock(scope: !644, file: !105, line: 613, column: 8)
!692 = !DILocation(line: 326, column: 5, scope: !683)
!693 = !DILocation(line: 326, column: 12, scope: !683)
!694 = !DILocation(line: 613, column: 8, scope: !695, inlinedAt: !646)
!695 = distinct !DILexicalBlock(scope: !644, file: !105, line: 613, column: 8)
!696 = !DILocalVariable(name: "buffer", scope: !697, file: !19, line: 610, type: !476, align: 8)
!697 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !105, file: !105, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!698 = !DILocation(line: 610, column: 14, scope: !697, inlinedAt: !699)
!699 = !DILocation(line: 327, column: 5, scope: !683)
!700 = !DILocalVariable(name: "allocator", scope: !697, file: !19, line: 611, type: !385, align: 64)
!701 = !DILocation(line: 611, column: 19, scope: !697, inlinedAt: !699)
!702 = !DILocation(line: 612, column: 18, scope: !697, inlinedAt: !699)
!703 = !DILocation(line: 612, column: 26, scope: !697, inlinedAt: !699)
!704 = !DILocation(line: 612, column: 2, scope: !697, inlinedAt: !699)
!705 = !DILocalVariable(name: "smem", scope: !683, file: !19, line: 327, type: !91, align: 64)
!706 = !DILocation(line: 327, column: 31, scope: !683)
!707 = !DILocation(line: 614, column: 8, scope: !708, inlinedAt: !699)
!708 = distinct !DILexicalBlock(scope: !697, file: !105, line: 614, column: 2)
!709 = !DILocation(line: 329, column: 6, scope: !710)
!710 = distinct !DILexicalBlock(scope: !683, file: !19, line: 328, column: 5)
!711 = !DILocation(line: 329, column: 41, scope: !710)
!712 = !DILocation(line: 329, column: 21, scope: !710)
!713 = !DILocation(line: 329, column: 13, scope: !710)
!714 = !DILocation(line: 613, column: 8, scope: !715, inlinedAt: !699)
!715 = distinct !DILexicalBlock(scope: !697, file: !105, line: 613, column: 8)
!716 = !DILocation(line: 613, column: 8, scope: !717, inlinedAt: !646)
!717 = distinct !DILexicalBlock(scope: !644, file: !105, line: 613, column: 8)
!718 = !DILocation(line: 613, column: 8, scope: !719, inlinedAt: !699)
!719 = distinct !DILexicalBlock(scope: !697, file: !105, line: 613, column: 8)
!720 = !DILocation(line: 331, column: 5, scope: !683)
!721 = !DILocation(line: 613, column: 8, scope: !722, inlinedAt: !646)
!722 = distinct !DILexicalBlock(scope: !644, file: !105, line: 613, column: 8)
!723 = !DILocation(line: 335, column: 9, scope: !616)
!724 = distinct !DISubprogram(name: "free", linkageName: "std.net.url.UrlQueryValues.free", scope: !19, file: !19, line: 339, type: !725, scopeLine: 339, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !550}
!727 = !DILocation(line: 340, column: 1, scope: !724)
!728 = !DILocalVariable(name: "self", arg: 1, scope: !724, file: !19, line: 339, type: !550)
!729 = !DILocation(line: 339, column: 29, scope: !724)
!730 = !DILocation(line: 341, column: 2, scope: !724)
!731 = !DILocation(line: 345, column: 7, scope: !732, inlinedAt: !734)
!732 = distinct !DISubprogram(name: "@each_entry", linkageName: "@each_entry", scope: !733, file: !733, line: 343, scopeLine: 343, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!733 = !DIFile(filename: "hashmap.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!734 = !DILocation(line: 337, column: 2, scope: !735, inlinedAt: !730)
!735 = distinct !DISubprogram(name: "@each", linkageName: "@each", scope: !733, file: !733, line: 335, scopeLine: 335, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!736 = !DILocation(line: 345, column: 24, scope: !732, inlinedAt: !734)
!737 = !DILocation(line: 346, column: 26, scope: !738, inlinedAt: !734)
!738 = distinct !DILexicalBlock(scope: !732, file: !733, line: 346, column: 2)
!739 = !DILocalVariable(name: ".temp", scope: !738, file: !19, line: 346, type: !29, align: 64)
!740 = !DILocalVariable(name: "entry", scope: !741, file: !19, line: 346, type: !561, align: 64)
!741 = distinct !DILexicalBlock(scope: !738, file: !733, line: 347, column: 2)
!742 = !DILocation(line: 346, column: 18, scope: !741, inlinedAt: !734)
!743 = !DILocation(line: 346, column: 26, scope: !741, inlinedAt: !734)
!744 = !DILocation(line: 348, column: 3, scope: !745, inlinedAt: !734)
!745 = distinct !DILexicalBlock(scope: !741, file: !733, line: 347, column: 2)
!746 = !DILocation(line: 348, column: 10, scope: !747, inlinedAt: !734)
!747 = distinct !DILexicalBlock(scope: !745, file: !733, line: 348, column: 3)
!748 = !DILocalVariable(name: "entry", scope: !735, file: !19, line: 337, type: !561, align: 64)
!749 = !DILocation(line: 337, column: 27, scope: !735, inlinedAt: !730)
!750 = !DILocation(line: 350, column: 10, scope: !751, inlinedAt: !734)
!751 = distinct !DILexicalBlock(scope: !752, file: !733, line: 350, column: 4)
!752 = distinct !DILexicalBlock(scope: !747, file: !733, line: 349, column: 3)
!753 = !DILocalVariable(name: "key", scope: !724, file: !19, line: 341, type: !23, align: 64)
!754 = !DILocation(line: 341, column: 25, scope: !724)
!755 = !DILocalVariable(name: "values", scope: !724, file: !19, line: 341, type: !582, align: 64)
!756 = !DILocation(line: 341, column: 48, scope: !724)
!757 = !DILocation(line: 339, column: 9, scope: !758, inlinedAt: !730)
!758 = distinct !DILexicalBlock(scope: !759, file: !733, line: 339, column: 3)
!759 = distinct !DILexicalBlock(scope: !735, file: !733, line: 338, column: 2)
!760 = !DILocation(line: 339, column: 20, scope: !758, inlinedAt: !730)
!761 = !DILocation(line: 343, column: 19, scope: !762)
!762 = distinct !DILexicalBlock(scope: !763, file: !19, line: 343, column: 3)
!763 = distinct !DILexicalBlock(scope: !724, file: !19, line: 342, column: 2)
!764 = !DILocalVariable(name: ".temp", scope: !762, file: !19, line: 343, type: !29, align: 64)
!765 = !DILocalVariable(name: "value", scope: !766, file: !19, line: 343, type: !23, align: 64)
!766 = distinct !DILexicalBlock(scope: !762, file: !19, line: 343, column: 27)
!767 = !DILocation(line: 343, column: 12, scope: !766)
!768 = !DILocation(line: 393, column: 26, scope: !769, inlinedAt: !767)
!769 = distinct !DILexicalBlock(scope: !770, file: !636, line: 394, column: 1)
!770 = distinct !DISubprogram(name: "@item_at", linkageName: "@item_at", scope: !636, file: !636, line: 393, scopeLine: 393, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!771 = !DILocation(line: 391, column: 11, scope: !769, inlinedAt: !767)
!772 = !DILocation(line: 391, column: 19, scope: !769, inlinedAt: !767)
!773 = !DILocation(line: 343, column: 12, scope: !769, inlinedAt: !767)
!774 = !DILocation(line: 395, column: 9, scope: !770, inlinedAt: !767)
!775 = !DILocation(line: 395, column: 22, scope: !770, inlinedAt: !767)
!776 = !DILocation(line: 343, column: 38, scope: !766)
!777 = !DILocation(line: 343, column: 27, scope: !766)
!778 = !DILocation(line: 344, column: 3, scope: !763)
!779 = !DILocation(line: 351, column: 12, scope: !752, inlinedAt: !734)
!780 = !DILocation(line: 346, column: 2, scope: !724)
!781 = !DILocation(line: 348, column: 17, scope: !782)
!782 = distinct !DILexicalBlock(scope: !724, file: !19, line: 348, column: 2)
!783 = !DILocalVariable(name: ".temp", scope: !782, file: !19, line: 348, type: !29, align: 64)
!784 = !DILocalVariable(name: "key", scope: !785, file: !19, line: 348, type: !573, align: 64)
!785 = distinct !DILexicalBlock(scope: !782, file: !19, line: 348, column: 33)
!786 = !DILocation(line: 348, column: 12, scope: !785)
!787 = !DILocation(line: 348, column: 17, scope: !785)
!788 = !DILocation(line: 399, column: 19, scope: !785)
!789 = !DILocation(line: 348, column: 42, scope: !785)
!790 = !DILocation(line: 348, column: 33, scope: !785)
!791 = !DILocation(line: 349, column: 2, scope: !724)
!792 = distinct !DISubprogram(name: "free", linkageName: "std.net.url.Url.free", scope: !19, file: !19, line: 357, type: !793, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !327}
!795 = !DILocation(line: 358, column: 1, scope: !792)
!796 = !DILocalVariable(name: "self", arg: 1, scope: !792, file: !19, line: 357, type: !327)
!797 = !DILocation(line: 357, column: 18, scope: !792)
!798 = !DILocation(line: 359, column: 7, scope: !792)
!799 = !DILocation(line: 359, column: 29, scope: !792)
!800 = !DILocation(line: 360, column: 2, scope: !792)
!801 = !DILocation(line: 360, column: 19, scope: !792)
!802 = !DILocation(line: 361, column: 2, scope: !792)
!803 = !DILocation(line: 361, column: 17, scope: !792)
!804 = !DILocation(line: 362, column: 2, scope: !792)
!805 = !DILocation(line: 362, column: 21, scope: !792)
!806 = !DILocation(line: 363, column: 2, scope: !792)
!807 = !DILocation(line: 363, column: 21, scope: !792)
!808 = !DILocation(line: 364, column: 2, scope: !792)
!809 = !DILocation(line: 364, column: 17, scope: !792)
!810 = !DILocation(line: 365, column: 2, scope: !792)
!811 = !DILocation(line: 365, column: 18, scope: !792)
!812 = !DILocation(line: 366, column: 2, scope: !792)
!813 = !DILocation(line: 366, column: 21, scope: !792)
!814 = distinct !DISubprogram(name: "tparse", linkageName: "std.net.url.tparse", scope: !19, file: !19, line: 50, type: !815, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!815 = !DISubroutineType(types: !816)
!816 = !{!328, !23}
!817 = !DILocalVariable(name: "url_string", arg: 1, scope: !814, file: !19, line: 50, type: !23)
!818 = !DILocation(line: 50, column: 23, scope: !814)
!819 = !DILocation(line: 47, column: 11, scope: !820)
!820 = distinct !DILexicalBlock(scope: !814, file: !19, line: 50, column: 38)
!821 = !DILocation(line: 50, column: 44, scope: !814)
!822 = !DILocation(line: 50, column: 50, scope: !814)
!823 = !DILocation(line: 56, column: 11, scope: !814)
!824 = !DILocation(line: 50, column: 38, scope: !814)
!825 = distinct !DISubprogram(name: "parse", linkageName: "std.net.url.parse", scope: !19, file: !19, line: 59, type: !826, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !44)
!826 = !DISubroutineType(types: !827)
!827 = !{!328, !91, !23}
!828 = !DILocalVariable(name: "allocator", arg: 1, scope: !825, file: !19, line: 59, type: !91)
!829 = !DILocation(line: 59, column: 25, scope: !825)
!830 = !DILocalVariable(name: "url_string", arg: 2, scope: !825, file: !19, line: 59, type: !23)
!831 = !DILocation(line: 59, column: 43, scope: !825)
!832 = !DILocation(line: 56, column: 11, scope: !833)
!833 = distinct !DILexicalBlock(scope: !825, file: !19, line: 60, column: 1)
!834 = !DILocation(line: 254, column: 46, scope: !835, inlinedAt: !837)
!835 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !836, file: !836, line: 254, scopeLine: 254, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!836 = !DIFile(filename: "string.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!837 = !DILocation(line: 61, column: 15, scope: !825)
!838 = !DILocation(line: 62, column: 7, scope: !825)
!839 = !DILocation(line: 62, column: 26, scope: !825)
!840 = !DILocalVariable(name: "url", scope: !825, file: !19, line: 63, type: !328, align: 64)
!841 = !DILocation(line: 63, column: 6, scope: !825)
!842 = !DILocation(line: 63, column: 27, scope: !825)
!843 = !DILocalVariable(name: "pos", scope: !825, file: !19, line: 66, type: !29, align: 64)
!844 = !DILocation(line: 66, column: 10, scope: !825)
!845 = !DILocation(line: 66, column: 16, scope: !825)
!846 = !DILocation(line: 68, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !825, file: !19, line: 67, column: 2)
!848 = !DILocation(line: 68, column: 20, scope: !847)
!849 = !DILocation(line: 69, column: 16, scope: !847)
!850 = !DILocation(line: 69, column: 27, scope: !847)
!851 = !DILocation(line: 69, column: 28, scope: !847)
!852 = !DILocation(line: 69, column: 3, scope: !847)
!853 = !DILocation(line: 70, column: 16, scope: !847)
!854 = !DILocation(line: 70, column: 27, scope: !847)
!855 = !DILocalVariable(name: "pos", scope: !825, file: !19, line: 72, type: !29, align: 64)
!856 = !DILocation(line: 72, column: 15, scope: !825)
!857 = !DILocation(line: 72, column: 21, scope: !825)
!858 = !DILocation(line: 75, column: 7, scope: !859)
!859 = distinct !DILexicalBlock(scope: !825, file: !19, line: 73, column: 2)
!860 = !DILocation(line: 75, column: 20, scope: !859)
!861 = !DILocation(line: 76, column: 16, scope: !859)
!862 = !DILocation(line: 76, column: 27, scope: !859)
!863 = !DILocation(line: 76, column: 28, scope: !859)
!864 = !DILocation(line: 76, column: 3, scope: !859)
!865 = !DILocation(line: 77, column: 32, scope: !859)
!866 = !DILocation(line: 77, column: 43, scope: !859)
!867 = !DILocation(line: 77, column: 14, scope: !859)
!868 = !DILocation(line: 77, column: 65, scope: !859)
!869 = !DILocation(line: 77, column: 3, scope: !859)
!870 = !DILocation(line: 78, column: 10, scope: !859)
!871 = !DILocation(line: 82, column: 6, scope: !825)
!872 = !DILocalVariable(name: "authority_end", scope: !873, file: !19, line: 84, type: !29, align: 64)
!873 = distinct !DILexicalBlock(scope: !825, file: !19, line: 83, column: 2)
!874 = !DILocation(line: 84, column: 7, scope: !873)
!875 = !DILocation(line: 84, column: 23, scope: !873)
!876 = !DILocation(line: 84, column: 59, scope: !873)
!877 = !DILocalVariable(name: "authority", scope: !873, file: !19, line: 85, type: !23, align: 64)
!878 = !DILocation(line: 85, column: 10, scope: !873)
!879 = !DILocation(line: 85, column: 22, scope: !873)
!880 = !DILocation(line: 85, column: 33, scope: !873)
!881 = !DILocation(line: 85, column: 34, scope: !873)
!882 = !DILocalVariable(name: "user_info_end", scope: !873, file: !19, line: 87, type: !29, align: 64)
!883 = !DILocation(line: 87, column: 11, scope: !873)
!884 = !DILocation(line: 87, column: 27, scope: !873)
!885 = !DILocalVariable(name: "userinfo", scope: !886, file: !19, line: 89, type: !23, align: 64)
!886 = distinct !DILexicalBlock(scope: !873, file: !19, line: 88, column: 3)
!887 = !DILocation(line: 89, column: 11, scope: !886)
!888 = !DILocation(line: 89, column: 22, scope: !886)
!889 = !DILocation(line: 89, column: 32, scope: !886)
!890 = !DILocation(line: 89, column: 33, scope: !886)
!891 = !DILocalVariable(name: "username", scope: !886, file: !19, line: 90, type: !23, align: 64)
!892 = !DILocation(line: 90, column: 11, scope: !886)
!893 = !DILocalVariable(name: "password", scope: !886, file: !19, line: 91, type: !23, align: 64)
!894 = !DILocation(line: 91, column: 11, scope: !886)
!895 = !DILocalVariable(name: "state", scope: !896, file: !19, line: 679, type: !106, align: 64)
!896 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !105, file: !105, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!897 = !DILocation(line: 679, column: 12, scope: !896, inlinedAt: !898)
!898 = !DILocation(line: 92, column: 4, scope: !886)
!899 = !DILocation(line: 679, column: 41, scope: !896, inlinedAt: !898)
!900 = !DILocation(line: 679, column: 20, scope: !896, inlinedAt: !898)
!901 = !DILocalVariable(name: "userpass", scope: !902, file: !19, line: 94, type: !903, align: 64)
!902 = distinct !DILexicalBlock(scope: !886, file: !19, line: 93, column: 4)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !904, identifier: "String[]")
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !903, baseType: !573, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !903, baseType: !29, size: 64, align: 64, offset: 64)
!907 = !DILocation(line: 94, column: 14, scope: !902)
!908 = !DILocation(line: 424, column: 79, scope: !909, inlinedAt: !910)
!909 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !836, file: !836, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!910 = !DILocation(line: 94, column: 25, scope: !902)
!911 = !DILocation(line: 95, column: 16, scope: !902)
!912 = !DILocation(line: 95, column: 25, scope: !902)
!913 = !DILocation(line: 96, column: 9, scope: !902)
!914 = !DILocation(line: 682, column: 23, scope: !915, inlinedAt: !898)
!915 = distinct !DILexicalBlock(scope: !896, file: !105, line: 681, column: 2)
!916 = !DILocation(line: 682, column: 3, scope: !915, inlinedAt: !898)
!917 = !DILocation(line: 99, column: 20, scope: !902)
!918 = !DILocation(line: 99, column: 57, scope: !902)
!919 = !DILocation(line: 682, column: 23, scope: !920, inlinedAt: !898)
!920 = distinct !DILexicalBlock(scope: !896, file: !105, line: 681, column: 2)
!921 = !DILocation(line: 682, column: 3, scope: !920, inlinedAt: !898)
!922 = !DILocation(line: 99, column: 5, scope: !902)
!923 = !DILocation(line: 97, column: 8, scope: !902)
!924 = !DILocation(line: 100, column: 9, scope: !902)
!925 = !DILocation(line: 100, column: 56, scope: !902)
!926 = !DILocation(line: 100, column: 65, scope: !902)
!927 = !DILocation(line: 100, column: 38, scope: !902)
!928 = !DILocation(line: 100, column: 82, scope: !902)
!929 = !DILocation(line: 682, column: 23, scope: !930, inlinedAt: !898)
!930 = distinct !DILexicalBlock(scope: !896, file: !105, line: 681, column: 2)
!931 = !DILocation(line: 682, column: 3, scope: !930, inlinedAt: !898)
!932 = !DILocation(line: 100, column: 23, scope: !902)
!933 = !DILocation(line: 682, column: 23, scope: !934, inlinedAt: !898)
!934 = distinct !DILexicalBlock(scope: !896, file: !105, line: 681, column: 2)
!935 = !DILocation(line: 682, column: 3, scope: !934, inlinedAt: !898)
!936 = !DILocation(line: 102, column: 16, scope: !886)
!937 = !DILocation(line: 102, column: 26, scope: !886)
!938 = !DILocalVariable(name: "host", scope: !873, file: !19, line: 106, type: !23, align: 64)
!939 = !DILocation(line: 106, column: 10, scope: !873)
!940 = !DILocation(line: 107, column: 29, scope: !873)
!941 = !DILocation(line: 107, column: 7, scope: !873)
!942 = !DILocation(line: 107, column: 56, scope: !873)
!943 = !DILocation(line: 107, column: 37, scope: !873)
!944 = !DILocalVariable(name: "ipv6_end", scope: !945, file: !19, line: 109, type: !29, align: 64)
!945 = distinct !DILexicalBlock(scope: !873, file: !19, line: 108, column: 3)
!946 = !DILocation(line: 109, column: 8, scope: !945)
!947 = !DILocation(line: 109, column: 19, scope: !945)
!948 = !DILocation(line: 110, column: 11, scope: !945)
!949 = !DILocation(line: 110, column: 21, scope: !945)
!950 = !DILocation(line: 110, column: 26, scope: !945)
!951 = !DILocation(line: 111, column: 9, scope: !945)
!952 = !DILocation(line: 111, column: 25, scope: !945)
!953 = !DILocation(line: 111, column: 8, scope: !945)
!954 = !DILocation(line: 111, column: 42, scope: !945)
!955 = !DILocation(line: 111, column: 52, scope: !945)
!956 = !DILocation(line: 111, column: 55, scope: !945)
!957 = !DILocation(line: 113, column: 16, scope: !958)
!958 = distinct !DILexicalBlock(scope: !945, file: !19, line: 112, column: 4)
!959 = !DILocation(line: 113, column: 26, scope: !958)
!960 = !DILocation(line: 113, column: 29, scope: !958)
!961 = !DILocation(line: 113, column: 5, scope: !958)
!962 = !DILocalVariable(name: "state", scope: !963, file: !19, line: 679, type: !106, align: 64)
!963 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !105, file: !105, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !44)
!964 = !DILocation(line: 679, column: 12, scope: !963, inlinedAt: !965)
