; ModuleID = 'std::os::env'
source_filename = "std::os::env"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%PathImp = type { %"char[]", i32, %any }

@.panic_msg = internal constant [34 x i8] c"@require \22name.len > 0\22 violated.\00", align 1
@.file = internal constant [7 x i8] c"env.c3\00", align 1
@.func = internal constant [8 x i8] c"get_var\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@std.core.builtin.NOT_FOUND = linkonce constant %"char[]" { ptr @std.core.builtin.NOT_FOUND.nameof, i64 18 }, align 8
@std.core.builtin.NOT_FOUND.nameof = internal constant [19 x i8] c"builtin::NOT_FOUND\00", align 1
@std.core.mem.allocator.current_temp = extern_weak thread_local global %any, align 8
@.func.1 = internal constant [9 x i8] c"tget_var\00", align 1
@.func.2 = internal constant [8 x i8] c"set_var\00", align 1
@.str = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.func.3 = internal constant [13 x i8] c"get_home_dir\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.str.5 = private unnamed_addr constant [28 x i8] c"Library/Application Support\00", align 1
@get_config_dir.DIR = internal unnamed_addr constant %"char[]" { ptr @.str.5, i64 27 }, align 8, !dbg !0
@.func.6 = internal constant [10 x i8] c"clear_var\00", align 1


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DIR", linkageName: "get_config_dir.DIR", scope: !2, file: !2, line: 91, type: !3, isLocal: true, isDefinition: true, align: 64)
!2 = !DIFile(filename: "env.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/os")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !4)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !5, identifier: "char[]")
!5 = !{!6, !9}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !4, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !4, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !11)
!11 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!12 = !{i32 2, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 2, !"wchar_size", i32 4}
!15 = !{i32 4, !"PIC Level", i32 2}
!16 = !{i32 1, !"uwtable", i32 1}
!17 = !{i32 2, !"frame-pointer", i32 1}
!18 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !19, globals: !36, splitDebugInlining: false)
!19 = !{!20}
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !21, file: !2, line: 23, baseType: !32, size: 32, align: 32, elements: !33)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !2, file: !2, line: 16, size: 320, align: 64, elements: !22, identifier: "std.io.path.PathImp")
!22 = !{!23, !24, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !21, file: !2, line: 18, baseType: !3, size: 128, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !21, file: !2, line: 19, baseType: !20, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !21, file: !2, line: 20, baseType: !26, size: 128, align: 64, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !27, identifier: "Allocator")
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !26, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35}
!34 = !DIEnumerator(name: "WIN32", value: 0)
!35 = !DIEnumerator(name: "POSIX", value: 1)
!36 = !{!0}
!37 = distinct !DISubprogram(name: "get_var", linkageName: "std.os.env.get_var", scope: !2, file: !2, line: 12, type: !38, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !40)
!38 = !DISubroutineType(types: !39)
!39 = !{!4, !26, !3}
!40 = !{}
!41 = !DILocalVariable(name: "allocator", arg: 1, scope: !37, file: !2, line: 12, type: !26)
!42 = !DILocation(line: 12, column: 30, scope: !37)
!43 = !DILocalVariable(name: "name", arg: 2, scope: !37, file: !2, line: 12, type: !3)
!44 = !DILocation(line: 12, column: 48, scope: !37)
!45 = !DILocation(line: 9, column: 11, scope: !46)
!46 = distinct !DILexicalBlock(scope: !37, file: !2, line: 12, column: 57)
!47 = !DILocalVariable(name: "state", scope: !48, file: !2, line: 679, type: !50, align: 64)
!48 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !49, file: !49, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, retainedNodes: !40)
!49 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 496, baseType: !51, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !53, identifier: "std.core.mem.allocator.TempAllocator")
!53 = !{!54, !55, !67, !68, !70, !71, !72, !73, !74, !75, !76}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !52, file: !2, line: 33, baseType: !26, size: 128, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !52, file: !2, line: 34, baseType: !56, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !58, identifier: "std.core.mem.allocator.TempAllocatorPage")
!58 = !{!59, !60, !61, !62, !63}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !57, file: !2, line: 56, baseType: !56, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !57, file: !2, line: 57, baseType: !29, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !57, file: !2, line: 58, baseType: !10, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !57, file: !2, line: 59, baseType: !10, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !2, line: 60, baseType: !64, align: 8, offset: 256)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, align: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 0, lowerBound: 0)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !52, file: !2, line: 35, baseType: !51, size: 64, align: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !52, file: !2, line: 36, baseType: !69, size: 8, align: 8, offset: 256)
!69 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !52, file: !2, line: 37, baseType: !10, size: 64, align: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !52, file: !2, line: 38, baseType: !10, size: 64, align: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !52, file: !2, line: 39, baseType: !10, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !52, file: !2, line: 40, baseType: !10, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !52, file: !2, line: 41, baseType: !10, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !52, file: !2, line: 42, baseType: !10, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !52, file: !2, line: 43, baseType: !64, align: 8, offset: 704)
!77 = !DILocation(line: 679, column: 12, scope: !48, inlinedAt: !78)
!78 = !DILocation(line: 12, column: 57, scope: !37)
!79 = !DILocation(line: 679, column: 41, scope: !48, inlinedAt: !78)
!80 = !DILocation(line: 679, column: 20, scope: !48, inlinedAt: !78)
!81 = !DILocalVariable(name: "val", scope: !82, file: !2, line: 17, type: !83, align: 64)
!82 = distinct !DILexicalBlock(scope: !37, file: !2, line: 13, column: 1)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 13, baseType: !7, align: 64)
!84 = !DILocation(line: 17, column: 11, scope: !82)
!85 = !DILocation(line: 17, column: 30, scope: !82)
!86 = !DILocation(line: 17, column: 17, scope: !82)
!87 = !DILocation(line: 18, column: 10, scope: !82)
!88 = !DILocation(line: 18, column: 25, scope: !82)
!89 = !DILocation(line: 18, column: 16, scope: !82)
!90 = !DILocation(line: 18, column: 38, scope: !82)
!91 = !DILocation(line: 682, column: 23, scope: !92, inlinedAt: !78)
!92 = distinct !DILexicalBlock(scope: !48, file: !49, line: 681, column: 2)
!93 = !DILocation(line: 682, column: 3, scope: !92, inlinedAt: !78)
!94 = !DILocation(line: 682, column: 23, scope: !95, inlinedAt: !78)
!95 = distinct !DILexicalBlock(scope: !48, file: !49, line: 681, column: 2)
!96 = !DILocation(line: 682, column: 3, scope: !95, inlinedAt: !78)
!97 = distinct !DISubprogram(name: "tget_var", linkageName: "std.os.env.tget_var", scope: !2, file: !2, line: 37, type: !98, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !40)
!98 = !DISubroutineType(types: !99)
!99 = !{!4, !3}
!100 = !DILocalVariable(name: "name", arg: 1, scope: !97, file: !2, line: 37, type: !3)
!101 = !DILocation(line: 37, column: 28, scope: !97)
!102 = !DILocation(line: 39, column: 17, scope: !97)
!103 = !DILocation(line: 39, column: 23, scope: !97)
!104 = !DILocation(line: 9, column: 11, scope: !97)
!105 = !DILocation(line: 39, column: 9, scope: !97)
!106 = distinct !DISubprogram(name: "set_var", linkageName: "std.os.env.set_var", scope: !2, file: !2, line: 47, type: !107, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !40)
!107 = !DISubroutineType(types: !108)
!108 = !{!69, !3, !3, !69}
!109 = !DILocalVariable(name: "name", arg: 1, scope: !106, file: !2, line: 47, type: !3)
!110 = !DILocation(line: 47, column: 24, scope: !106)
!111 = !DILocalVariable(name: "value", arg: 2, scope: !106, file: !2, line: 47, type: !3)
!112 = !DILocation(line: 47, column: 37, scope: !106)
!113 = !DILocalVariable(name: "overwrite", arg: 3, scope: !106, file: !2, line: 47, type: !69)
!114 = !DILocation(line: 47, column: 49, scope: !106)
!115 = !DILocation(line: 45, column: 11, scope: !116)
!116 = distinct !DILexicalBlock(scope: !106, file: !2, line: 47, column: 70)
!117 = !DILocalVariable(name: "state", scope: !118, file: !2, line: 679, type: !50, align: 64)
!118 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !49, file: !49, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, retainedNodes: !40)
!119 = !DILocation(line: 679, column: 12, scope: !118, inlinedAt: !120)
!120 = !DILocation(line: 47, column: 70, scope: !106)
!121 = !DILocation(line: 679, column: 41, scope: !118, inlinedAt: !120)
!122 = !DILocation(line: 679, column: 20, scope: !118, inlinedAt: !120)
!123 = !DILocation(line: 60, column: 23, scope: !124)
!124 = distinct !DILexicalBlock(scope: !106, file: !2, line: 48, column: 1)
!125 = !DILocation(line: 60, column: 42, scope: !124)
!126 = !DILocation(line: 60, column: 62, scope: !124)
!127 = !DILocation(line: 60, column: 10, scope: !124)
!128 = !DILocation(line: 682, column: 23, scope: !129, inlinedAt: !120)
!129 = distinct !DILexicalBlock(scope: !118, file: !49, line: 681, column: 2)
!130 = !DILocation(line: 682, column: 3, scope: !129, inlinedAt: !120)
