; ModuleID = 'std::core::machoruntime'
source_filename = "std::core::machoruntime"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"DynamicMethod[]" = type { ptr, i64 }
%"Callback[]" = type { ptr, i64 }

@"$ct.std.core.machoruntime.SegmentCommand64" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 72, i64 0, i64 11, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.LoadCommand" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 8, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.Section64" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 80, i64 0, i64 12, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.MachHeader" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 28, i64 0, i64 7, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.MachHeader64" = linkonce global %.introspect { i8 10, i64 ptrtoint (ptr @"$ct.std.core.machoruntime.MachHeader" to i64), ptr null, i64 32, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.DlInfo" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 32, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "LC_SEGMENT_64", linkageName: "std.core.machoruntime.LC_SEGMENT_64", scope: !2, file: !2, line: 57, type: !3, isLocal: true, isDefinition: true, align: 32)
!2 = !DIFile(filename: "macho_runtime.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core/private")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "runtime_state", linkageName: "std.core.machoruntime.runtime_state", scope: !2, file: !2, line: 155, type: !6, isLocal: true, isDefinition: true, align: 32)
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "StartupState", scope: !2, file: !2, line: 144, baseType: !7, size: 32, align: 32, elements: !8)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "NOT_STARTED", value: 0)
!10 = !DIEnumerator(name: "INIT", value: 1)
!11 = !DIEnumerator(name: "RUN_CTORS", value: 2)
!12 = !DIEnumerator(name: "READ_DYLIB", value: 3)
!13 = !DIEnumerator(name: "RUN_DYLIB_CTORS", value: 4)
!14 = !DIEnumerator(name: "RUN_DTORS", value: 5)
!15 = !DIEnumerator(name: "SHUTDOWN", value: 6)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "ctor_first", linkageName: "std.core.machoruntime.ctor_first", scope: !2, file: !2, line: 157, type: !18, isLocal: true, isDefinition: true, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Callback", scope: !2, file: !2, line: 127, size: 192, align: 64, elements: !20, identifier: "std.core.machoruntime.Callback")
!20 = !{!21, !22, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !19, file: !2, line: 129, baseType: !3, size: 32, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "xtor", scope: !19, file: !2, line: 130, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallbackFn", scope: !2, file: !2, line: 126, baseType: !24, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DISubroutineType(types: !26)
!26 = !{null}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !2, line: 131, baseType: !18, size: 64, align: 64, offset: 128)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "dtor_first", linkageName: "std.core.machoruntime.dtor_first", scope: !2, file: !2, line: 158, type: !18, isLocal: true, isDefinition: true, align: 64)
!30 = !{i32 2, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 2, !"wchar_size", i32 4}
!33 = !{i32 4, !"PIC Level", i32 2}
!34 = !{i32 1, !"uwtable", i32 1}
!35 = !{i32 2, !"frame-pointer", i32 1}
!36 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !37, globals: !38, splitDebugInlining: false)
!37 = !{!6}
!38 = !{!0, !4, !16, !28}
!39 = distinct !DISubprogram(name: "name_cmp", linkageName: "std.core.machoruntime.name_cmp", scope: !2, file: !2, line: 60, type: !40, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36, retainedNodes: !49)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43, !45}
!42 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, align: 8, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 16, lowerBound: 0)
!49 = !{}
!50 = !DILocalVariable(name: "a", arg: 1, scope: !39, file: !2, line: 60, type: !43)
!51 = !DILocation(line: 60, column: 24, scope: !39)
!52 = !DILocalVariable(name: "b", arg: 2, scope: !39, file: !2, line: 60, type: !45)
!53 = !DILocation(line: 60, column: 37, scope: !39)
!54 = !DILocalVariable(name: "i", scope: !55, file: !2, line: 62, type: !56, align: 64)
!55 = distinct !DILexicalBlock(scope: !39, file: !2, line: 62, column: 2)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !57)
!57 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!58 = !DILocation(line: 62, column: 11, scope: !55)
!59 = !DILocation(line: 62, column: 15, scope: !55)
!60 = !DILocation(line: 62, column: 18, scope: !55)
!61 = !DILocation(line: 64, column: 7, scope: !62)
!62 = distinct !DILexicalBlock(scope: !55, file: !2, line: 63, column: 2)
!63 = !DILocation(line: 64, column: 9, scope: !62)
!64 = !DILocation(line: 64, column: 17, scope: !62)
!65 = !DILocation(line: 64, column: 20, scope: !62)
!66 = !DILocation(line: 64, column: 31, scope: !62)
!67 = !DILocation(line: 65, column: 7, scope: !62)
!68 = !DILocation(line: 65, column: 9, scope: !62)
!69 = !DILocation(line: 65, column: 28, scope: !62)
!70 = !DILocation(line: 62, column: 26, scope: !55)
!71 = !DILocation(line: 67, column: 9, scope: !39)
!72 = distinct !DISubprogram(name: "find_segment", linkageName: "std.core.machoruntime.find_segment", scope: !2, file: !2, line: 70, type: !73, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36, retainedNodes: !49)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !89, !43}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64, dwarfAddressSpace: 0)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentCommand64", scope: !2, file: !2, line: 3, size: 576, align: 64, elements: !77, identifier: "std.core.machoruntime.SegmentCommand64")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !76, file: !2, line: 5, baseType: !3, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cmdsize", scope: !76, file: !2, line: 6, baseType: !3, size: 32, align: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "segname", scope: !76, file: !2, line: 7, baseType: !46, size: 128, align: 8, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "vmaddr", scope: !76, file: !2, line: 8, baseType: !57, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "vmsize", scope: !76, file: !2, line: 9, baseType: !57, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "fileoff", scope: !76, file: !2, line: 10, baseType: !57, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !76, file: !2, line: 11, baseType: !57, size: 64, align: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "maxprot", scope: !76, file: !2, line: 12, baseType: !3, size: 32, align: 32, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "initprot", scope: !76, file: !2, line: 13, baseType: !3, size: 32, align: 32, offset: 480)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "nsects", scope: !76, file: !2, line: 14, baseType: !3, size: 32, align: 32, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !76, file: !2, line: 15, baseType: !3, size: 32, align: 32, offset: 544)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "MachHeader", scope: !2, file: !2, line: 40, size: 224, align: 32, elements: !91, identifier: "std.core.machoruntime.MachHeader")
!91 = !{!92, !93, !94, !95, !96, !97, !98}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !90, file: !2, line: 42, baseType: !3, size: 32, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cputype", scope: !90, file: !2, line: 43, baseType: !3, size: 32, align: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cpusubtype", scope: !90, file: !2, line: 44, baseType: !3, size: 32, align: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !90, file: !2, line: 45, baseType: !3, size: 32, align: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ncmds", scope: !90, file: !2, line: 46, baseType: !3, size: 32, align: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sizeofcmds", scope: !90, file: !2, line: 47, baseType: !3, size: 32, align: 32, offset: 160)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !90, file: !2, line: 48, baseType: !3, size: 32, align: 32, offset: 192)
!99 = !DILocalVariable(name: "header", arg: 1, scope: !72, file: !2, line: 70, type: !89)
!100 = !DILocation(line: 70, column: 48, scope: !72)
!101 = !DILocalVariable(name: "segname", arg: 2, scope: !72, file: !2, line: 70, type: !43)
!102 = !DILocation(line: 70, column: 62, scope: !72)
!103 = !DILocalVariable(name: "command", scope: !72, file: !2, line: 72, type: !104, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64, dwarfAddressSpace: 0)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "LoadCommand", scope: !2, file: !2, line: 18, size: 64, align: 32, elements: !106, identifier: "std.core.machoruntime.LoadCommand")
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !105, file: !2, line: 20, baseType: !3, size: 32, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cmdsize", scope: !105, file: !2, line: 21, baseType: !3, size: 32, align: 32, offset: 32)
!109 = !DILocation(line: 72, column: 15, scope: !72)
!110 = !DILocation(line: 72, column: 32, scope: !72)
!111 = !DILocation(line: 72, column: 41, scope: !72)
!112 = !DILocalVariable(name: "i", scope: !113, file: !2, line: 73, type: !3, align: 32)
!113 = distinct !DILexicalBlock(scope: !72, file: !2, line: 73, column: 2)
!114 = !DILocation(line: 73, column: 12, scope: !113)
!115 = !DILocation(line: 73, column: 16, scope: !113)
!116 = !DILocation(line: 73, column: 19, scope: !113)
!117 = !DILocation(line: 73, column: 23, scope: !113)
!118 = !DILocation(line: 75, column: 7, scope: !119)
!119 = distinct !DILexicalBlock(scope: !113, file: !2, line: 74, column: 2)
!120 = !DILocalVariable(name: "segment", scope: !121, file: !2, line: 77, type: !75, align: 64)
!121 = distinct !DILexicalBlock(scope: !119, file: !2, line: 76, column: 3)
!122 = !DILocation(line: 77, column: 22, scope: !121)
!123 = !DILocation(line: 77, column: 51, scope: !121)
!124 = !DILocation(line: 78, column: 27, scope: !121)
!125 = !DILocation(line: 78, column: 8, scope: !121)
!126 = !DILocation(line: 78, column: 52, scope: !121)
!127 = !DILocation(line: 80, column: 20, scope: !119)
!128 = !DILocation(line: 80, column: 30, scope: !119)
!129 = !DILocation(line: 73, column: 37, scope: !113)
!130 = !DILocation(line: 82, column: 9, scope: !72)
!131 = distinct !DISubprogram(name: "find_section", linkageName: "std.core.machoruntime.find_section", scope: !2, file: !2, line: 84, type: !132, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36, retainedNodes: !49)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !75, !43}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64, dwarfAddressSpace: 0)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Section64", scope: !2, file: !2, line: 24, size: 640, align: 64, elements: !136, identifier: "std.core.machoruntime.Section64")
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sectname", scope: !135, file: !2, line: 26, baseType: !46, size: 128, align: 8)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "segname", scope: !135, file: !2, line: 27, baseType: !46, size: 128, align: 8, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !135, file: !2, line: 28, baseType: !57, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !135, file: !2, line: 29, baseType: !57, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !135, file: !2, line: 30, baseType: !3, size: 32, align: 32, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !135, file: !2, line: 31, baseType: !3, size: 32, align: 32, offset: 416)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "reloff", scope: !135, file: !2, line: 32, baseType: !3, size: 32, align: 32, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nreloc", scope: !135, file: !2, line: 33, baseType: !3, size: 32, align: 32, offset: 480)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !135, file: !2, line: 34, baseType: !3, size: 32, align: 32, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !135, file: !2, line: 35, baseType: !3, size: 32, align: 32, offset: 544)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !135, file: !2, line: 36, baseType: !3, size: 32, align: 32, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved3", scope: !135, file: !2, line: 37, baseType: !3, size: 32, align: 32, offset: 608)
!149 = !DILocalVariable(name: "command", arg: 1, scope: !131, file: !2, line: 84, type: !75)
!150 = !DILocation(line: 84, column: 47, scope: !131)
!151 = !DILocalVariable(name: "sectname", arg: 2, scope: !131, file: !2, line: 84, type: !43)
!152 = !DILocation(line: 84, column: 62, scope: !131)
!153 = !DILocalVariable(name: "section", scope: !131, file: !2, line: 86, type: !134, align: 64)
!154 = !DILocation(line: 86, column: 13, scope: !131)
!155 = !DILocation(line: 86, column: 30, scope: !131)
!156 = !DILocation(line: 86, column: 40, scope: !131)
!157 = !DILocalVariable(name: "i", scope: !158, file: !2, line: 87, type: !3, align: 32)
!158 = distinct !DILexicalBlock(scope: !131, file: !2, line: 87, column: 2)
!159 = !DILocation(line: 87, column: 12, scope: !158)
!160 = !DILocation(line: 87, column: 16, scope: !158)
!161 = !DILocation(line: 87, column: 19, scope: !158)
!162 = !DILocation(line: 87, column: 23, scope: !158)
!163 = !DILocation(line: 89, column: 27, scope: !164)
!164 = distinct !DILexicalBlock(scope: !158, file: !2, line: 88, column: 2)
!165 = !DILocation(line: 89, column: 7, scope: !164)
!166 = !DILocation(line: 89, column: 53, scope: !164)
!167 = !DILocation(line: 90, column: 3, scope: !164)
!168 = !DILocation(line: 87, column: 39, scope: !158)
!169 = !DILocation(line: 92, column: 9, scope: !131)
!170 = distinct !DISubprogram(name: "runtime_startup", linkageName: "__c3_runtime_startup", scope: !2, file: !2, line: 160, type: !25, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !49)
!171 = !DILocation(line: 162, column: 6, scope: !170)
!172 = !DILocation(line: 162, column: 42, scope: !170)
!173 = !DILocation(line: 163, column: 18, scope: !170)
!174 = !DILocation(line: 164, column: 2, scope: !170)
!175 = !DILocation(line: 165, column: 9, scope: !170)
!176 = !DILocation(line: 166, column: 18, scope: !170)
!177 = !DILocalVariable(name: "ctor", scope: !170, file: !2, line: 167, type: !18, align: 64)
!178 = !DILocation(line: 167, column: 12, scope: !170)
!179 = !DILocation(line: 167, column: 19, scope: !170)
!180 = !DILocation(line: 168, column: 2, scope: !170)
!181 = !DILocation(line: 168, column: 9, scope: !182)
!182 = distinct !DILexicalBlock(scope: !170, file: !2, line: 168, column: 2)
!183 = !DILocation(line: 170, column: 3, scope: !184)
!184 = distinct !DILexicalBlock(scope: !182, file: !2, line: 169, column: 2)
!185 = !DILocation(line: 171, column: 10, scope: !184)
!186 = !DILocation(line: 173, column: 9, scope: !170)
!187 = !DILocation(line: 174, column: 18, scope: !170)
!188 = !DILocation(line: 175, column: 15, scope: !170)
!189 = distinct !DISubprogram(name: "runtime_finalize", linkageName: "__c3_runtime_finalize", scope: !2, file: !2, line: 178, type: !25, scopeLine: 178, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !49)
!190 = !DILocation(line: 180, column: 6, scope: !189)
!191 = !DILocation(line: 180, column: 41, scope: !189)
!192 = !DILocation(line: 181, column: 18, scope: !189)
!193 = !DILocalVariable(name: "dtor", scope: !189, file: !2, line: 182, type: !18, align: 64)
!194 = !DILocation(line: 182, column: 12, scope: !189)
!195 = !DILocation(line: 182, column: 19, scope: !189)
!196 = !DILocation(line: 183, column: 2, scope: !189)
!197 = !DILocation(line: 183, column: 9, scope: !198)
!198 = distinct !DILexicalBlock(scope: !189, file: !2, line: 183, column: 2)
!199 = !DILocation(line: 185, column: 3, scope: !200)
!200 = distinct !DILexicalBlock(scope: !198, file: !2, line: 184, column: 2)
!201 = !DILocation(line: 186, column: 10, scope: !200)
!202 = !DILocation(line: 188, column: 9, scope: !189)
!203 = !DILocation(line: 189, column: 18, scope: !189)
!204 = distinct !DISubprogram(name: "append_xxlizer", linkageName: "std.core.machoruntime.append_xxlizer", scope: !2, file: !2, line: 192, type: !205, scopeLine: 192, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36, retainedNodes: !49)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !207, !18}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!208 = !DILocalVariable(name: "ref", arg: 1, scope: !204, file: !2, line: 192, type: !207)
!209 = !DILocation(line: 192, column: 35, scope: !204)
!210 = !DILocalVariable(name: "cb", arg: 2, scope: !204, file: !2, line: 192, type: !18)
!211 = !DILocation(line: 192, column: 50, scope: !204)
!212 = !DILocation(line: 194, column: 2, scope: !204)
!213 = !DILocalVariable(name: "current", scope: !214, file: !2, line: 194, type: !18, align: 64)
!214 = distinct !DILexicalBlock(scope: !204, file: !2, line: 194, column: 2)
!215 = !DILocation(line: 194, column: 19, scope: !214)
!216 = !DILocation(line: 194, column: 30, scope: !214)
!217 = !DILocation(line: 194, column: 35, scope: !214)
!218 = !DILocation(line: 196, column: 7, scope: !219)
!219 = distinct !DILexicalBlock(scope: !214, file: !2, line: 195, column: 2)
!220 = !DILocation(line: 196, column: 26, scope: !219)
!221 = !DILocation(line: 198, column: 4, scope: !222)
!222 = distinct !DILexicalBlock(scope: !219, file: !2, line: 197, column: 3)
!223 = !DILocation(line: 199, column: 4, scope: !222)
!224 = !DILocation(line: 201, column: 10, scope: !219)
!225 = !DILocation(line: 203, column: 3, scope: !204)
!226 = distinct !DISubprogram(name: "dl_reg_callback", linkageName: "std.core.machoruntime.dl_reg_callback", scope: !2, file: !2, line: 217, type: !227, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36, retainedNodes: !49)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !89, !229}
!229 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!230 = !DILocalVariable(name: "mh", arg: 1, scope: !226, file: !2, line: 217, type: !89)
!231 = !DILocation(line: 217, column: 37, scope: !226)
!232 = !DILocalVariable(name: "vmaddr_slide", arg: 2, scope: !226, file: !2, line: 217, type: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !229)
!234 = !DILocation(line: 217, column: 45, scope: !226)
!235 = !DILocalVariable(name: "size", scope: !226, file: !2, line: 219, type: !56, align: 64)
!236 = !DILocation(line: 219, column: 6, scope: !226)
!237 = !DILocation(line: 219, column: 13, scope: !226)
!238 = !DILocation(line: 220, column: 9, scope: !226)
!239 = !DILocation(line: 220, column: 34, scope: !226)
!240 = !DILocalVariable(name: "section", scope: !241, file: !2, line: 98, type: !134, align: 64)
!241 = distinct !DISubprogram(name: "find_segment_section_body", linkageName: "find_segment_section_body", scope: !2, file: !2, line: 95, scopeLine: 95, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36, retainedNodes: !49)
!242 = !DILocation(line: 98, column: 14, scope: !241, inlinedAt: !243)
!243 = !DILocation(line: 221, column: 17, scope: !244)
!244 = distinct !DILexicalBlock(scope: !226, file: !2, line: 221, column: 2)
!245 = !DILocation(line: 98, column: 37, scope: !241, inlinedAt: !243)
!246 = !DILocation(line: 98, column: 24, scope: !241, inlinedAt: !243)
!247 = !DILocation(line: 99, column: 12, scope: !241, inlinedAt: !243)
!248 = !DILocation(line: 101, column: 10, scope: !249, inlinedAt: !243)
!249 = distinct !DILexicalBlock(scope: !241, file: !2, line: 100, column: 2)
!250 = !DILocalVariable(name: "ptr", scope: !241, file: !2, line: 103, type: !251, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64, dwarfAddressSpace: 0)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "DynamicMethod", scope: !2, file: !2, line: 133, size: 192, align: 64, elements: !253, identifier: "std.core.machoruntime.DynamicMethod")
!253 = !{!254, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "fn_ptr", scope: !252, file: !2, line: 135, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !252, file: !2, line: 136, baseType: !43, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !252, file: !2, line: 137, baseType: !258, size: 64, align: 64, offset: 128)
!258 = !DICompositeType(tag: DW_TAG_union_type, scope: !252, file: !2, line: 137, size: 64, align: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !2, line: 139, baseType: !251, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !258, file: !2, line: 140, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64, dwarfAddressSpace: 0)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeId", scope: !2, file: !2, line: 206, size: 384, align: 64, elements: !264, identifier: "std.core.machoruntime.TypeId")
!264 = !{!265, !266, !267, !268, !269, !270, !271}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !2, line: 208, baseType: !44, size: 8, align: 8)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "parentof", scope: !263, file: !2, line: 209, baseType: !262, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "dtable", scope: !263, file: !2, line: 210, baseType: !251, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sizeof", scope: !263, file: !2, line: 211, baseType: !56, size: 64, align: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !263, file: !2, line: 212, baseType: !262, size: 64, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !263, file: !2, line: 213, baseType: !56, size: 64, align: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "additional", scope: !263, file: !2, line: 214, baseType: !272, align: 64, offset: 384)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, align: 64, elements: !274)
!273 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!274 = !{!275}
!275 = !DISubrange(count: 0, lowerBound: 0)
!276 = !DILocation(line: 103, column: 9, scope: !241, inlinedAt: !243)
!277 = !DILocation(line: 103, column: 22, scope: !241, inlinedAt: !243)
!278 = !DILocation(line: 103, column: 31, scope: !241, inlinedAt: !243)
!279 = !DILocation(line: 104, column: 9, scope: !241, inlinedAt: !243)
!280 = !DILocation(line: 104, column: 14, scope: !241, inlinedAt: !243)
!281 = !DILocalVariable(name: ".temp", scope: !244, file: !2, line: 221, type: !56, align: 64)
!282 = !DILocalVariable(name: "dm", scope: !283, file: !2, line: 221, type: !251, align: 64)
!283 = distinct !DILexicalBlock(scope: !244, file: !2, line: 222, column: 2)
!284 = !DILocation(line: 221, column: 12, scope: !283)
!285 = !DILocation(line: 221, column: 17, scope: !283)
!286 = !DILocalVariable(name: "type", scope: !287, file: !2, line: 223, type: !262, align: 64)
!287 = distinct !DILexicalBlock(scope: !283, file: !2, line: 222, column: 2)
!288 = !DILocation(line: 223, column: 11, scope: !287)
!289 = !DILocation(line: 223, column: 18, scope: !287)
!290 = !DILocation(line: 224, column: 13, scope: !287)
!291 = !DILocation(line: 224, column: 3, scope: !287)
!292 = !DILocation(line: 225, column: 3, scope: !287)
!293 = !DILocalVariable(name: "m", scope: !287, file: !2, line: 226, type: !251, align: 64)
!294 = !DILocation(line: 226, column: 18, scope: !287)
!295 = !DILocation(line: 226, column: 22, scope: !287)
!296 = !DILocation(line: 227, column: 3, scope: !287)
!297 = !DILocation(line: 227, column: 10, scope: !298)
!298 = distinct !DILexicalBlock(scope: !287, file: !2, line: 227, column: 3)
!299 = !DILocation(line: 229, column: 8, scope: !300)
!300 = distinct !DILexicalBlock(scope: !298, file: !2, line: 228, column: 3)
!301 = !DILocalVariable(name: "section", scope: !302, file: !2, line: 98, type: !134, align: 64)
!302 = distinct !DISubprogram(name: "find_segment_section_body", linkageName: "find_segment_section_body", scope: !2, file: !2, line: 95, scopeLine: 95, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36, retainedNodes: !49)
!303 = !DILocation(line: 98, column: 14, scope: !302, inlinedAt: !304)
!304 = !DILocation(line: 232, column: 17, scope: !305)
!305 = distinct !DILexicalBlock(scope: !226, file: !2, line: 232, column: 2)
!306 = !DILocation(line: 98, column: 37, scope: !302, inlinedAt: !304)
!307 = !DILocation(line: 98, column: 24, scope: !302, inlinedAt: !304)
!308 = !DILocation(line: 99, column: 12, scope: !302, inlinedAt: !304)
!309 = !DILocation(line: 101, column: 10, scope: !310, inlinedAt: !304)
!310 = distinct !DILexicalBlock(scope: !302, file: !2, line: 100, column: 2)
!311 = !DILocalVariable(name: "ptr", scope: !302, file: !2, line: 103, type: !18, align: 64)
!312 = !DILocation(line: 103, column: 9, scope: !302, inlinedAt: !304)
!313 = !DILocation(line: 103, column: 22, scope: !302, inlinedAt: !304)
!314 = !DILocation(line: 103, column: 31, scope: !302, inlinedAt: !304)
!315 = !DILocation(line: 104, column: 9, scope: !302, inlinedAt: !304)
!316 = !DILocation(line: 104, column: 14, scope: !302, inlinedAt: !304)
!317 = !DILocalVariable(name: ".temp", scope: !305, file: !2, line: 232, type: !56, align: 64)
!318 = !DILocalVariable(name: "cb", scope: !319, file: !2, line: 232, type: !18, align: 64)
!319 = distinct !DILexicalBlock(scope: !305, file: !2, line: 233, column: 2)
!320 = !DILocation(line: 232, column: 12, scope: !319)
!321 = !DILocation(line: 232, column: 17, scope: !319)
!322 = !DILocation(line: 234, column: 31, scope: !323)
!323 = distinct !DILexicalBlock(scope: !319, file: !2, line: 233, column: 2)
!324 = !DILocation(line: 234, column: 3, scope: !323)
