; ModuleID = 'std::collections::list'
source_filename = "std::collections::list"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"List{String}" = type { i64, i64, %any, ptr }
%"List{PathImp}" = type { i64, i64, %any, ptr }
%"List{ZipEntry}" = type { i64, i64, %any, ptr }
%"List{Backtrace}" = type { i64, i64, %any, ptr }
%"List{Object*}" = type { i64, i64, %any, ptr }
%"List{Pem}" = type { i64, i64, %any, ptr }
%"List{Token}" = type { i64, i64, %any, ptr }
%"List{IndexMap}" = type { i64, i64, %any, ptr }
%"char[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"PathImp[]" = type { ptr, i64 }
%PathImp = type { %"char[]", i32, %any }
%"ZipEntry[]" = type { ptr, i64 }
%ZipEntry = type { %"char[]", i64, i64, i8, i8, i32, i64, i16, i16, i16 }
%"Backtrace[]" = type { ptr, i64 }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%"Object*[]" = type { ptr, i64 }
%"Pem[]" = type { ptr, i64 }
%Pem = type { %any, %"char[]", %"LinkedHashMap{String, String}", %"char[]" }
%"LinkedHashMap{String, String}" = type { %"LinkedEntry{String, String}*[]", %any, i64, i64, float, ptr, ptr }
%"LinkedEntry{String, String}*[]" = type { ptr, i64 }
%"Token[]" = type { ptr, i64 }
%Token = type { i16, i16 }
%"IndexMap[]" = type { ptr, i64 }
%IndexMap = type { i64, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE{String}", linkageName: "std.collections.list.ELEMENT_IS_EQUATABLE$String$", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER{String}", linkageName: "std.collections.list.ELEMENT_IS_POINTER$String$", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 8)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR{String}", linkageName: "std.collections.list.LIST_HEAP_ALLOCATOR$String$", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !9, identifier: "Allocator")
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !8, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "ONHEAP{String}", linkageName: "std.collections.list.ONHEAP$String$", scope: !2, file: !2, line: 14, type: !16, isLocal: false, isDefinition: true, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{String}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !17, identifier: "std.collections.list.List$String$")
!17 = !{!18, !21, !22, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !20)
!20 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !16, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !16, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !16, file: !2, line: 23, baseType: !24, size: 64, align: 64, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !27, identifier: "char[]")
!27 = !{!28, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !26, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, baseType: !19, size: 64, align: 64, offset: 64)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "dummy{String}", linkageName: "std.collections.list.dummy$String$.27584", scope: !2, file: !2, line: 574, type: !34, isLocal: true, isDefinition: true, align: 32)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE{PathImp}", linkageName: "std.collections.list.ELEMENT_IS_EQUATABLE$std.io.path.PathImp$", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 8)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER{PathImp}", linkageName: "std.collections.list.ELEMENT_IS_POINTER$std.io.path.PathImp$", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 8)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR{PathImp}", linkageName: "std.collections.list.LIST_HEAP_ALLOCATOR$std.io.path.PathImp$", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 64)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "ONHEAP{PathImp}", linkageName: "std.collections.list.ONHEAP$std.io.path.PathImp$", scope: !2, file: !2, line: 14, type: !43, isLocal: false, isDefinition: true, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{PathImp}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !44, identifier: "std.collections.list.List$std.io.path.PathImp$")
!44 = !{!45, !46, !47, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !43, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !43, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !43, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !43, file: !2, line: 23, baseType: !49, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !2, file: !2, line: 16, size: 320, align: 64, elements: !51, identifier: "std.io.path.PathImp")
!51 = !{!52, !53, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !50, file: !2, line: 18, baseType: !25, size: 128, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !50, file: !2, line: 19, baseType: !54, size: 32, align: 32, offset: 128)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !50, file: !2, line: 23, baseType: !34, size: 32, align: 32, elements: !55)
!55 = !{!56, !57}
!56 = !DIEnumerator(name: "WIN32", value: 0)
!57 = !DIEnumerator(name: "POSIX", value: 1)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !50, file: !2, line: 20, baseType: !8, size: 128, align: 64, offset: 192)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "dummy{PathImp}", linkageName: "std.collections.list.dummy$std.io.path.PathImp$.30806", scope: !2, file: !2, line: 574, type: !34, isLocal: true, isDefinition: true, align: 32)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE{ZipEntry}", linkageName: "std.collections.list.ELEMENT_IS_EQUATABLE$std.compression.zip.ZipEntry$", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 8)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER{ZipEntry}", linkageName: "std.collections.list.ELEMENT_IS_POINTER$std.compression.zip.ZipEntry$", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 8)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR{ZipEntry}", linkageName: "std.collections.list.LIST_HEAP_ALLOCATOR$std.compression.zip.ZipEntry$", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 64)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "ONHEAP{ZipEntry}", linkageName: "std.collections.list.ONHEAP$std.compression.zip.ZipEntry$", scope: !2, file: !2, line: 14, type: !69, isLocal: false, isDefinition: true, align: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{ZipEntry}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !70, identifier: "std.collections.list.List$std.compression.zip.ZipEntry$")
!70 = !{!71, !72, !73, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !69, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !69, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !69, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !69, file: !2, line: 23, baseType: !75, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64, dwarfAddressSpace: 0)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "ZipEntry", scope: !2, file: !2, line: 27, size: 448, align: 64, elements: !77, identifier: "std.compression.zip.ZipEntry")
!77 = !{!78, !79, !80, !81, !82, !83, !85, !86, !90, !91}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !2, line: 29, baseType: !25, size: 128, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !76, file: !2, line: 30, baseType: !20, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !76, file: !2, line: 31, baseType: !20, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "is_directory", scope: !76, file: !2, line: 32, baseType: !3, size: 8, align: 8, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "is_encrypted", scope: !76, file: !2, line: 33, baseType: !3, size: 8, align: 8, offset: 264)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !76, file: !2, line: 34, baseType: !84, size: 32, align: 32, offset: 288)
!84 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !76, file: !2, line: 35, baseType: !20, size: 64, align: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !76, file: !2, line: 36, baseType: !87, size: 16, align: 16, offset: 384)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ZipMethod", scope: !76, file: !2, line: 55, baseType: !88, size: 16, align: 16, elements: !89)
!88 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!89 = !{}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "last_mod_time", scope: !76, file: !2, line: 37, baseType: !88, size: 16, align: 16, offset: 400)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "last_mod_date", scope: !76, file: !2, line: 38, baseType: !88, size: 16, align: 16, offset: 416)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "dummy{ZipEntry}", linkageName: "std.collections.list.dummy$std.compression.zip.ZipEntry$.33486", scope: !2, file: !2, line: 574, type: !34, isLocal: true, isDefinition: true, align: 32)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE{Backtrace}", linkageName: "std.collections.list.ELEMENT_IS_EQUATABLE$std.os.backtrace.Backtrace$", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 8)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER{Backtrace}", linkageName: "std.collections.list.ELEMENT_IS_POINTER$std.os.backtrace.Backtrace$", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 8)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR{Backtrace}", linkageName: "std.collections.list.LIST_HEAP_ALLOCATOR$std.os.backtrace.Backtrace$", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 64)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "ONHEAP{Backtrace}", linkageName: "std.collections.list.ONHEAP$std.os.backtrace.Backtrace$", scope: !2, file: !2, line: 14, type: !102, isLocal: false, isDefinition: true, align: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{Backtrace}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !103, identifier: "std.collections.list.List$std.os.backtrace.Backtrace$")
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !102, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !102, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !102, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !102, file: !2, line: 23, baseType: !108, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64, dwarfAddressSpace: 0)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !110, identifier: "std.os.backtrace.Backtrace")
!110 = !{!111, !113, !114, !115, !116, !117, !118}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !109, file: !2, line: 11, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !20)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !109, file: !2, line: 12, baseType: !25, size: 128, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !109, file: !2, line: 13, baseType: !25, size: 128, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !109, file: !2, line: 14, baseType: !25, size: 128, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !109, file: !2, line: 15, baseType: !84, size: 32, align: 32, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !109, file: !2, line: 16, baseType: !8, size: 128, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !109, file: !2, line: 17, baseType: !3, size: 8, align: 8, offset: 640)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "dummy{Backtrace}", linkageName: "std.collections.list.dummy$std.os.backtrace.Backtrace$.33944", scope: !2, file: !2, line: 574, type: !34, isLocal: true, isDefinition: true, align: 32)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE{Object*}", linkageName: "std.collections.list.ELEMENT_IS_EQUATABLE$p$std.collections.object.Object$", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 8)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER{Object*}", linkageName: "std.collections.list.ELEMENT_IS_POINTER$p$std.collections.object.Object$", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 8)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR{Object*}", linkageName: "std.collections.list.LIST_HEAP_ALLOCATOR$p$std.collections.object.Object$", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "ONHEAP{Object*}", linkageName: "std.collections.list.ONHEAP$p$std.collections.object.Object$", scope: !2, file: !2, line: 14, type: !129, isLocal: false, isDefinition: true, align: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{Object*}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !130, identifier: "std.collections.list.List$p$std.collections.object.Object$")
!130 = !{!131, !132, !133, !134}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !129, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !129, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !129, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !129, file: !2, line: 23, baseType: !135, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 640, align: 128, elements: !138, identifier: "std.collections.object.Object")
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !2, line: 13, baseType: !13, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !137, file: !2, line: 14, baseType: !8, size: 128, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, scope: !137, file: !2, line: 15, baseType: !142, size: 384, align: 128, offset: 256)
!142 = !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !2, line: 15, size: 384, align: 128, elements: !143)
!143 = !{!144, !146, !148, !149, !150, !151, !153}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !142, file: !2, line: 17, baseType: !145, size: 128, align: 128)
!145 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !142, file: !2, line: 18, baseType: !147, size: 64, align: 64)
!147 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !142, file: !2, line: 19, baseType: !3, size: 8, align: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !142, file: !2, line: 20, baseType: !25, size: 128, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !142, file: !2, line: 21, baseType: !11, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !142, file: !2, line: 22, baseType: !152, size: 320, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 465, baseType: !129, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !142, file: !2, line: 23, baseType: !154, size: 384, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 464, baseType: !155, align: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap{String, Object*}", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !156, identifier: "std.collections.map.HashMap$String$p$std.collections.object.Object$")
!156 = !{!157, !170, !171, !172, !173}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !155, file: !2, line: 31, baseType: !158, size: 128, align: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{String, Object*}*[]", size: 128, align: 64, elements: !159, identifier: "Entry{String, Object*}*[]")
!159 = !{!160, !169}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !158, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64, dwarfAddressSpace: 0)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64, dwarfAddressSpace: 0)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{String, Object*}", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !164, identifier: "std.collections.map.Entry$String$p$std.collections.object.Object$")
!164 = !{!165, !166, !167, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !163, file: !2, line: 23, baseType: !84, size: 32, align: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !163, file: !2, line: 24, baseType: !25, size: 128, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !163, file: !2, line: 25, baseType: !136, size: 64, align: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !2, line: 26, baseType: !162, size: 64, align: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !158, baseType: !19, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !155, file: !2, line: 32, baseType: !8, size: 128, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !155, file: !2, line: 34, baseType: !84, size: 32, align: 32, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !155, file: !2, line: 36, baseType: !84, size: 32, align: 32, offset: 288)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !155, file: !2, line: 37, baseType: !174, size: 32, align: 32, offset: 320)
!174 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "dummy{Object*}", linkageName: "std.collections.list.dummy$p$std.collections.object.Object$.34958", scope: !2, file: !2, line: 574, type: !34, isLocal: true, isDefinition: true, align: 32)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE{Pem}", linkageName: "std.collections.list.ELEMENT_IS_EQUATABLE$std.encoding.pem.Pem$", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 8)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER{Pem}", linkageName: "std.collections.list.ELEMENT_IS_POINTER$std.encoding.pem.Pem$", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 8)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR{Pem}", linkageName: "std.collections.list.LIST_HEAP_ALLOCATOR$std.encoding.pem.Pem$", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 64)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "ONHEAP{Pem}", linkageName: "std.collections.list.ONHEAP$std.encoding.pem.Pem$", scope: !2, file: !2, line: 14, type: !185, isLocal: false, isDefinition: true, align: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{Pem}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !186, identifier: "std.collections.list.List$std.encoding.pem.Pem$")
!186 = !{!187, !188, !189, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !185, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !185, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !185, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !185, file: !2, line: 23, baseType: !191, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64, dwarfAddressSpace: 0)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pem", scope: !2, file: !2, line: 53, size: 960, align: 64, elements: !193, identifier: "std.encoding.pem.Pem")
!193 = !{!194, !195, !196, !220}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !192, file: !2, line: 56, baseType: !8, size: 128, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !192, file: !2, line: 58, baseType: !25, size: 128, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !192, file: !2, line: 60, baseType: !197, size: 576, align: 64, offset: 256)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkedHashMap{String, String}", scope: !192, file: !2, line: 26, size: 576, align: 64, elements: !198, identifier: "std.collections.map.LinkedHashMap$String$String$")
!198 = !{!199, !214, !215, !216, !217, !218, !219}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !197, file: !2, line: 28, baseType: !200, size: 128, align: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkedEntry{String, String}*[]", size: 128, align: 64, elements: !201, identifier: "LinkedEntry{String, String}*[]")
!201 = !{!202, !213}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !200, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64, dwarfAddressSpace: 0)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64, dwarfAddressSpace: 0)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkedEntry{String, String}", scope: !2, file: !2, line: 13, size: 512, align: 64, elements: !206, identifier: "std.collections.map.LinkedEntry$String$String$")
!206 = !{!207, !208, !209, !210, !211, !212}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !205, file: !2, line: 15, baseType: !84, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !205, file: !2, line: 16, baseType: !25, size: 128, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !205, file: !2, line: 17, baseType: !25, size: 128, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !2, line: 19, baseType: !204, size: 64, align: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !205, file: !2, line: 21, baseType: !204, size: 64, align: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !205, file: !2, line: 23, baseType: !204, size: 64, align: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !200, baseType: !19, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !197, file: !2, line: 29, baseType: !8, size: 128, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !197, file: !2, line: 30, baseType: !19, size: 64, align: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !197, file: !2, line: 31, baseType: !19, size: 64, align: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !197, file: !2, line: 32, baseType: !174, size: 32, align: 32, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !197, file: !2, line: 34, baseType: !204, size: 64, align: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !197, file: !2, line: 36, baseType: !204, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !2, line: 62, baseType: !26, size: 128, align: 64, offset: 832)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "dummy{Pem}", linkageName: "std.collections.list.dummy$std.encoding.pem.Pem$.51080", scope: !2, file: !2, line: 574, type: !34, isLocal: true, isDefinition: true, align: 32)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE{Token}", linkageName: "std.collections.list.ELEMENT_IS_EQUATABLE$std.compression.deflate.Token$", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 8)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER{Token}", linkageName: "std.collections.list.ELEMENT_IS_POINTER$std.compression.deflate.Token$", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 8)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR{Token}", linkageName: "std.collections.list.LIST_HEAP_ALLOCATOR$std.compression.deflate.Token$", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 64)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "ONHEAP{Token}", linkageName: "std.collections.list.ONHEAP$std.compression.deflate.Token$", scope: !2, file: !2, line: 14, type: !231, isLocal: false, isDefinition: true, align: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{Token}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !232, identifier: "std.collections.list.List$std.compression.deflate.Token$")
!232 = !{!233, !234, !235, !236}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !231, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !231, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !231, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !231, file: !2, line: 23, baseType: !237, size: 64, align: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", scope: !2, file: !2, line: 662, size: 32, align: 16, elements: !239, identifier: "std.compression.deflate.Token")
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !238, file: !2, line: 664, baseType: !88, size: 16, align: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !238, file: !2, line: 665, baseType: !88, size: 16, align: 16, offset: 16)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "dummy{Token}", linkageName: "std.collections.list.dummy$std.compression.deflate.Token$.55972", scope: !2, file: !2, line: 574, type: !34, isLocal: true, isDefinition: true, align: 32)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "ELEMENT_IS_EQUATABLE{IndexMap}", linkageName: "std.collections.list.ELEMENT_IS_EQUATABLE$std.compression.deflate.IndexMap$", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 8)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "ELEMENT_IS_POINTER{IndexMap}", linkageName: "std.collections.list.ELEMENT_IS_POINTER$std.compression.deflate.IndexMap$", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 8)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "LIST_HEAP_ALLOCATOR{IndexMap}", linkageName: "std.collections.list.LIST_HEAP_ALLOCATOR$std.compression.deflate.IndexMap$", scope: !2, file: !2, line: 12, type: !8, isLocal: false, isDefinition: true, align: 64)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "ONHEAP{IndexMap}", linkageName: "std.collections.list.ONHEAP$std.compression.deflate.IndexMap$", scope: !2, file: !2, line: 14, type: !252, isLocal: false, isDefinition: true, align: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{IndexMap}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !253, identifier: "std.collections.list.List$std.compression.deflate.IndexMap$")
!253 = !{!254, !255, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !252, file: !2, line: 20, baseType: !19, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !252, file: !2, line: 21, baseType: !19, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !252, file: !2, line: 22, baseType: !8, size: 128, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !252, file: !2, line: 23, baseType: !258, size: 64, align: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64, dwarfAddressSpace: 0)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "IndexMap", scope: !2, file: !2, line: 668, size: 128, align: 64, elements: !260, identifier: "std.compression.deflate.IndexMap")
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !259, file: !2, line: 670, baseType: !19, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !259, file: !2, line: 671, baseType: !84, size: 32, align: 32, offset: 64)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "dummy{IndexMap}", linkageName: "std.collections.list.dummy$std.compression.deflate.IndexMap$.56320", scope: !2, file: !2, line: 574, type: !34, isLocal: true, isDefinition: true, align: 32)
!265 = !{i32 2, !"Dwarf Version", i32 4}
!266 = !{i32 2, !"Debug Info Version", i32 3}
!267 = !{i32 2, !"wchar_size", i32 4}
!268 = !{i32 4, !"PIC Level", i32 2}
!269 = !{i32 1, !"uwtable", i32 1}
!270 = !{i32 2, !"frame-pointer", i32 1}
!271 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !272, globals: !273, splitDebugInlining: false)
!272 = !{!54, !87}
!273 = !{!0, !4, !6, !14, !32, !35, !37, !39, !41, !59, !61, !63, !65, !67, !92, !94, !96, !98, !100, !119, !121, !123, !125, !127, !175, !177, !179, !181, !183, !221, !223, !225, !227, !229, !242, !244, !246, !248, !250, !263}
!274 = distinct !DISubprogram(name: "init", linkageName: "std.collections.list.List$String$.init", scope: !2, file: !2, line: 30, type: !275, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!275 = !DISubroutineType(types: !276)
!276 = !{!277, !277, !8, !20}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!278 = !DILocation(line: 31, column: 1, scope: !274)
!279 = !DILocalVariable(name: "self", arg: 1, scope: !274, file: !2, line: 30, type: !277)
!280 = !DILocation(line: 30, column: 20, scope: !274)
!281 = !DILocalVariable(name: "allocator", arg: 2, scope: !274, file: !2, line: 30, type: !8)
!282 = !DILocation(line: 30, column: 37, scope: !274)
!283 = !DILocalVariable(name: "initial_capacity", arg: 3, scope: !274, file: !2, line: 30, type: !19)
!284 = !DILocation(line: 30, column: 52, scope: !274)
!285 = !DILocation(line: 32, column: 2, scope: !274)
!286 = !DILocation(line: 33, column: 2, scope: !274)
!287 = !DILocation(line: 34, column: 2, scope: !274)
!288 = !DILocation(line: 35, column: 2, scope: !274)
!289 = !DILocation(line: 36, column: 15, scope: !274)
!290 = !DILocation(line: 36, column: 2, scope: !274)
!291 = !DILocation(line: 37, column: 9, scope: !274)
!292 = distinct !DISubprogram(name: "tinit", linkageName: "std.collections.list.List$String$.tinit", scope: !2, file: !2, line: 46, type: !293, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!293 = !DISubroutineType(types: !294)
!294 = !{!277, !277, !20}
!295 = !DILocation(line: 47, column: 1, scope: !292)
!296 = !DILocalVariable(name: "self", arg: 1, scope: !292, file: !2, line: 46, type: !277)
!297 = !DILocation(line: 46, column: 21, scope: !292)
!298 = !DILocalVariable(name: "initial_capacity", arg: 2, scope: !292, file: !2, line: 46, type: !19)
!299 = !DILocation(line: 46, column: 32, scope: !292)
!300 = !DILocation(line: 48, column: 19, scope: !292)
!301 = !DILocation(line: 48, column: 25, scope: !292)
!302 = !DILocation(line: 48, column: 9, scope: !292)
!303 = distinct !DISubprogram(name: "init_with_array", linkageName: "std.collections.list.List$String$.init_with_array", scope: !2, file: !2, line: 57, type: !304, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!304 = !DISubroutineType(types: !305)
!305 = !{!277, !277, !8, !306}
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !307, identifier: "String[]")
!307 = !{!308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !306, baseType: !24, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !306, baseType: !19, size: 64, align: 64, offset: 64)
!310 = !DILocation(line: 58, column: 1, scope: !303)
!311 = !DILocalVariable(name: "self", arg: 1, scope: !303, file: !2, line: 57, type: !277)
!312 = !DILocation(line: 57, column: 31, scope: !303)
!313 = !DILocalVariable(name: "allocator", arg: 2, scope: !303, file: !2, line: 57, type: !8)
!314 = !DILocation(line: 57, column: 48, scope: !303)
!315 = !DILocalVariable(name: "values", arg: 3, scope: !303, file: !2, line: 57, type: !306)
!316 = !DILocation(line: 57, column: 66, scope: !303)
!317 = !DILocation(line: 55, column: 11, scope: !318)
!318 = distinct !DILexicalBlock(scope: !303, file: !2, line: 58, column: 1)
!319 = !DILocation(line: 59, column: 23, scope: !303)
!320 = !DILocation(line: 59, column: 2, scope: !303)
!321 = !DILocation(line: 60, column: 16, scope: !303)
!322 = !DILocation(line: 60, column: 2, scope: !303)
!323 = !DILocation(line: 61, column: 9, scope: !303)
!324 = distinct !DISubprogram(name: "tinit_with_array", linkageName: "std.collections.list.List$String$.tinit_with_array", scope: !2, file: !2, line: 70, type: !325, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!325 = !DISubroutineType(types: !326)
!326 = !{!277, !277, !306}
!327 = !DILocation(line: 71, column: 1, scope: !324)
!328 = !DILocalVariable(name: "self", arg: 1, scope: !324, file: !2, line: 70, type: !277)
!329 = !DILocation(line: 70, column: 32, scope: !324)
!330 = !DILocalVariable(name: "values", arg: 2, scope: !324, file: !2, line: 70, type: !306)
!331 = !DILocation(line: 70, column: 46, scope: !324)
!332 = !DILocation(line: 68, column: 11, scope: !333)
!333 = distinct !DILexicalBlock(scope: !324, file: !2, line: 71, column: 1)
!334 = !DILocation(line: 72, column: 13, scope: !324)
!335 = !DILocation(line: 72, column: 2, scope: !324)
!336 = !DILocation(line: 73, column: 16, scope: !324)
!337 = !DILocation(line: 73, column: 2, scope: !324)
!338 = !DILocation(line: 74, column: 9, scope: !324)
!339 = distinct !DISubprogram(name: "init_wrapping_array", linkageName: "std.collections.list.List$String$.init_wrapping_array", scope: !2, file: !2, line: 80, type: !340, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !277, !8, !306}
!342 = !DILocation(line: 81, column: 1, scope: !339)
!343 = !DILocalVariable(name: "self", arg: 1, scope: !339, file: !2, line: 80, type: !277)
!344 = !DILocation(line: 80, column: 34, scope: !339)
!345 = !DILocalVariable(name: "allocator", arg: 2, scope: !339, file: !2, line: 80, type: !8)
!346 = !DILocation(line: 80, column: 51, scope: !339)
!347 = !DILocalVariable(name: "types", arg: 3, scope: !339, file: !2, line: 80, type: !306)
!348 = !DILocation(line: 80, column: 69, scope: !339)
!349 = !DILocation(line: 78, column: 12, scope: !350)
!350 = distinct !DILexicalBlock(scope: !339, file: !2, line: 81, column: 1)
!351 = !DILocation(line: 78, column: 11, scope: !350)
!352 = !DILocation(line: 82, column: 2, scope: !339)
!353 = !DILocation(line: 83, column: 18, scope: !339)
!354 = !DILocation(line: 83, column: 2, scope: !339)
!355 = !DILocation(line: 84, column: 2, scope: !339)
!356 = !DILocation(line: 85, column: 16, scope: !339)
!357 = !DILocation(line: 85, column: 22, scope: !339)
!358 = !DILocation(line: 437, column: 11, scope: !339)
!359 = !DILocation(line: 437, column: 28, scope: !339)
!360 = !DILocation(line: 85, column: 2, scope: !339)
!361 = distinct !DISubprogram(name: "is_initialized", linkageName: "std.collections.list.List$String$.is_initialized", scope: !2, file: !2, line: 88, type: !362, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!362 = !DISubroutineType(types: !363)
!363 = !{!3, !277}
!364 = !DILocation(line: 88, column: 47, scope: !361)
!365 = !DILocalVariable(name: "self", arg: 1, scope: !361, file: !2, line: 88, type: !277)
!366 = !DILocation(line: 88, column: 29, scope: !361)
!367 = !DILocation(line: 88, column: 73, scope: !361)
!368 = distinct !DISubprogram(name: "to_format", linkageName: "std.collections.list.List$String$.to_format", scope: !2, file: !2, line: 90, type: !369, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!369 = !DISubroutineType(types: !370)
!370 = !{!20, !277, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64, dwarfAddressSpace: 0)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 65, size: 320, align: 64, elements: !373, identifier: "std.io.Formatter")
!373 = !{!374, !375, !380}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !372, file: !2, line: 67, baseType: !11, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !372, file: !2, line: 68, baseType: !376, size: 64, align: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 18, baseType: !377, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64, dwarfAddressSpace: 0)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !11, !30}
!380 = !DIDerivedType(tag: DW_TAG_member, scope: !372, file: !2, line: 69, baseType: !381, size: 192, align: 64, offset: 128)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !372, file: !2, line: 69, size: 192, align: 64, elements: !382)
!382 = !{!383, !384, !385, !386}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !381, file: !2, line: 71, baseType: !84, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !381, file: !2, line: 72, baseType: !84, size: 32, align: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !381, file: !2, line: 73, baseType: !84, size: 32, align: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !381, file: !2, line: 74, baseType: !387, size: 64, align: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !388)
!388 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!389 = !DILocation(line: 91, column: 1, scope: !368)
!390 = !DILocalVariable(name: "self", arg: 1, scope: !368, file: !2, line: 90, type: !277)
!391 = !DILocation(line: 90, column: 24, scope: !368)
!392 = !DILocalVariable(name: "formatter", arg: 2, scope: !368, file: !2, line: 90, type: !371)
!393 = !DILocation(line: 90, column: 42, scope: !368)
!394 = !DILocation(line: 92, column: 10, scope: !395)
!395 = distinct !DILexicalBlock(scope: !368, file: !2, line: 92, column: 2)
!396 = !DILocation(line: 95, column: 11, scope: !397)
!397 = distinct !DILexicalBlock(scope: !395, file: !2, line: 95, column: 4)
!398 = !DILocation(line: 97, column: 36, scope: !399)
!399 = distinct !DILexicalBlock(scope: !395, file: !2, line: 97, column: 4)
!400 = !DILocation(line: 97, column: 49, scope: !399)
!401 = !DILocation(line: 97, column: 11, scope: !399)
!402 = !DILocalVariable(name: "n", scope: !403, file: !2, line: 99, type: !19, align: 64)
!403 = distinct !DILexicalBlock(scope: !395, file: !2, line: 99, column: 4)
!404 = !DILocation(line: 99, column: 8, scope: !403)
!405 = !DILocation(line: 99, column: 12, scope: !403)
!406 = !DILocation(line: 100, column: 26, scope: !407)
!407 = distinct !DILexicalBlock(scope: !403, file: !2, line: 100, column: 4)
!408 = !DILocation(line: 100, column: 40, scope: !407)
!409 = !DILocalVariable(name: ".temp", scope: !407, file: !2, line: 100, type: !19, align: 64)
!410 = !DILocation(line: 100, column: 13, scope: !407)
!411 = !DILocalVariable(name: "i", scope: !412, file: !2, line: 100, type: !19, align: 64)
!412 = distinct !DILexicalBlock(scope: !407, file: !2, line: 101, column: 4)
!413 = !DILocation(line: 100, column: 13, scope: !412)
!414 = !DILocalVariable(name: "element", scope: !412, file: !2, line: 100, type: !25, align: 64)
!415 = !DILocation(line: 100, column: 16, scope: !412)
!416 = !DILocation(line: 100, column: 26, scope: !412)
!417 = !DILocation(line: 102, column: 9, scope: !418)
!418 = distinct !DILexicalBlock(scope: !412, file: !2, line: 101, column: 4)
!419 = !DILocation(line: 102, column: 17, scope: !418)
!420 = !DILocation(line: 103, column: 5, scope: !418)
!421 = !DILocation(line: 103, column: 33, scope: !418)
!422 = !DILocation(line: 103, column: 10, scope: !418)
!423 = !DILocation(line: 105, column: 4, scope: !403)
!424 = !DILocation(line: 105, column: 9, scope: !403)
!425 = !DILocation(line: 106, column: 11, scope: !403)
!426 = distinct !DISubprogram(name: "push", linkageName: "std.collections.list.List$String$.push", scope: !2, file: !2, line: 110, type: !427, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !277, !25}
!429 = !DILocation(line: 111, column: 1, scope: !426)
!430 = !DILocalVariable(name: "self", arg: 1, scope: !426, file: !2, line: 110, type: !277)
!431 = !DILocation(line: 110, column: 19, scope: !426)
!432 = !DILocalVariable(name: "element", arg: 2, scope: !426, file: !2, line: 110, type: !25)
!433 = !DILocation(line: 110, column: 31, scope: !426)
!434 = !DILocation(line: 112, column: 15, scope: !426)
!435 = !DILocation(line: 112, column: 2, scope: !426)
!436 = !DILocation(line: 113, column: 2, scope: !426)
!437 = !DILocation(line: 113, column: 29, scope: !426)
!438 = !DILocation(line: 113, column: 35, scope: !426)
!439 = !DILocation(line: 437, column: 11, scope: !426)
!440 = !DILocation(line: 437, column: 28, scope: !426)
!441 = !DILocation(line: 113, column: 15, scope: !426)
!442 = distinct !DISubprogram(name: "pop", linkageName: "std.collections.list.List$String$.pop", scope: !2, file: !2, line: 116, type: !443, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!443 = !DISubroutineType(types: !444)
!444 = !{!26, !277}
!445 = !DILocation(line: 117, column: 1, scope: !442)
!446 = !DILocalVariable(name: "self", arg: 1, scope: !442, file: !2, line: 116, type: !277)
!447 = !DILocation(line: 116, column: 19, scope: !442)
!448 = !DILocation(line: 118, column: 7, scope: !442)
!449 = !DILocation(line: 118, column: 25, scope: !442)
!450 = !DILocation(line: 120, column: 9, scope: !442)
!451 = !DILocation(line: 120, column: 22, scope: !442)
!452 = !DILocation(line: 119, column: 22, scope: !453)
!453 = distinct !DILexicalBlock(scope: !442, file: !2, line: 119, column: 8)
!454 = !DILocation(line: 119, column: 28, scope: !453)
!455 = !DILocation(line: 437, column: 11, scope: !453)
!456 = !DILocation(line: 437, column: 28, scope: !453)
!457 = !DILocation(line: 119, column: 8, scope: !453)
!458 = distinct !DISubprogram(name: "clear", linkageName: "std.collections.list.List$String$.clear", scope: !2, file: !2, line: 123, type: !459, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !277}
!461 = !DILocation(line: 124, column: 1, scope: !458)
!462 = !DILocalVariable(name: "self", arg: 1, scope: !458, file: !2, line: 123, type: !277)
!463 = !DILocation(line: 123, column: 20, scope: !458)
!464 = !DILocation(line: 125, column: 16, scope: !458)
!465 = !DILocation(line: 437, column: 11, scope: !458)
!466 = !DILocation(line: 437, column: 28, scope: !458)
!467 = !DILocation(line: 125, column: 2, scope: !458)
!468 = distinct !DISubprogram(name: "pop_first", linkageName: "std.collections.list.List$String$.pop_first", scope: !2, file: !2, line: 128, type: !443, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!469 = !DILocation(line: 129, column: 1, scope: !468)
!470 = !DILocalVariable(name: "self", arg: 1, scope: !468, file: !2, line: 128, type: !277)
!471 = !DILocation(line: 128, column: 25, scope: !468)
!472 = !DILocation(line: 130, column: 7, scope: !468)
!473 = !DILocation(line: 130, column: 25, scope: !468)
!474 = !DILocation(line: 132, column: 9, scope: !468)
!475 = !DILocation(line: 132, column: 22, scope: !468)
!476 = !DILocation(line: 131, column: 8, scope: !477)
!477 = distinct !DILexicalBlock(scope: !468, file: !2, line: 131, column: 8)
!478 = !DILocation(line: 136, column: 19, scope: !477)
!479 = distinct !DISubprogram(name: "remove_at", linkageName: "std.collections.list.List$String$.remove_at", scope: !2, file: !2, line: 138, type: !480, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !277, !20}
!482 = !DILocation(line: 139, column: 1, scope: !479)
!483 = !DILocalVariable(name: "self", arg: 1, scope: !479, file: !2, line: 138, type: !277)
!484 = !DILocation(line: 138, column: 24, scope: !479)
!485 = !DILocalVariable(name: "index", arg: 2, scope: !479, file: !2, line: 138, type: !19)
!486 = !DILocation(line: 138, column: 35, scope: !479)
!487 = !DILocation(line: 136, column: 11, scope: !488)
!488 = distinct !DILexicalBlock(scope: !479, file: !2, line: 139, column: 1)
!489 = !DILocation(line: 136, column: 19, scope: !488)
!490 = !DILocalVariable(name: "new_size", scope: !479, file: !2, line: 140, type: !19, align: 64)
!491 = !DILocation(line: 140, column: 6, scope: !479)
!492 = !DILocation(line: 140, column: 17, scope: !479)
!493 = !DILocation(line: 142, column: 6, scope: !479)
!494 = !DILocation(line: 142, column: 19, scope: !479)
!495 = !DILocation(line: 142, column: 28, scope: !479)
!496 = !DILocation(line: 141, column: 22, scope: !497)
!497 = distinct !DILexicalBlock(scope: !479, file: !2, line: 141, column: 8)
!498 = !DILocation(line: 141, column: 28, scope: !497)
!499 = !DILocation(line: 437, column: 11, scope: !497)
!500 = !DILocation(line: 437, column: 28, scope: !497)
!501 = !DILocation(line: 141, column: 8, scope: !497)
!502 = !DILocation(line: 143, column: 40, scope: !479)
!503 = !DILocation(line: 143, column: 53, scope: !479)
!504 = !DILocation(line: 143, column: 66, scope: !479)
!505 = !DILocation(line: 143, column: 2, scope: !479)
!506 = !DILocation(line: 143, column: 15, scope: !479)
!507 = !DILocation(line: 143, column: 24, scope: !479)
!508 = !DILocation(line: 141, column: 22, scope: !509)
!509 = distinct !DILexicalBlock(scope: !479, file: !2, line: 141, column: 8)
!510 = !DILocation(line: 141, column: 28, scope: !509)
!511 = !DILocation(line: 437, column: 11, scope: !509)
!512 = !DILocation(line: 437, column: 28, scope: !509)
!513 = !DILocation(line: 141, column: 8, scope: !509)
!514 = distinct !DISubprogram(name: "add_all", linkageName: "std.collections.list.List$String$.add_all", scope: !2, file: !2, line: 146, type: !515, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !277, !277}
!517 = !DILocation(line: 147, column: 1, scope: !514)
!518 = !DILocalVariable(name: "self", arg: 1, scope: !514, file: !2, line: 146, type: !277)
!519 = !DILocation(line: 146, column: 22, scope: !514)
!520 = !DILocalVariable(name: "other_list", arg: 2, scope: !514, file: !2, line: 146, type: !277)
!521 = !DILocation(line: 146, column: 35, scope: !514)
!522 = !DILocation(line: 148, column: 7, scope: !514)
!523 = !DILocation(line: 148, column: 30, scope: !514)
!524 = !DILocation(line: 149, column: 15, scope: !514)
!525 = !DILocation(line: 149, column: 2, scope: !514)
!526 = !DILocalVariable(name: "index", scope: !514, file: !2, line: 150, type: !19, align: 64)
!527 = !DILocation(line: 150, column: 6, scope: !514)
!528 = !DILocation(line: 150, column: 28, scope: !514)
!529 = !DILocation(line: 150, column: 34, scope: !514)
!530 = !DILocation(line: 150, column: 46, scope: !514)
!531 = !DILocation(line: 437, column: 11, scope: !514)
!532 = !DILocation(line: 437, column: 28, scope: !514)
!533 = !DILocation(line: 150, column: 14, scope: !514)
!534 = !DILocation(line: 151, column: 20, scope: !535)
!535 = distinct !DILexicalBlock(scope: !514, file: !2, line: 151, column: 2)
!536 = !DILocalVariable(name: ".temp", scope: !535, file: !2, line: 151, type: !19, align: 64)
!537 = !DILocalVariable(name: "value", scope: !538, file: !2, line: 151, type: !24, align: 64)
!538 = distinct !DILexicalBlock(scope: !535, file: !2, line: 152, column: 2)
!539 = !DILocation(line: 151, column: 12, scope: !538)
!540 = !DILocation(line: 151, column: 20, scope: !538)
!541 = !DILocation(line: 399, column: 19, scope: !538)
!542 = !DILocation(line: 153, column: 28, scope: !543)
!543 = distinct !DILexicalBlock(scope: !538, file: !2, line: 152, column: 2)
!544 = !DILocation(line: 153, column: 3, scope: !543)
!545 = !DILocation(line: 153, column: 16, scope: !543)
!546 = distinct !DISubprogram(name: "to_aligned_array", linkageName: "std.collections.list.List$String$.to_aligned_array", scope: !2, file: !2, line: 161, type: !547, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!547 = !DISubroutineType(types: !548)
!548 = !{!306, !277, !8}
!549 = !DILocation(line: 162, column: 1, scope: !546)
!550 = !DILocalVariable(name: "self", arg: 1, scope: !546, file: !2, line: 161, type: !277)
!551 = !DILocation(line: 161, column: 33, scope: !546)
!552 = !DILocalVariable(name: "allocator", arg: 2, scope: !546, file: !2, line: 161, type: !8)
!553 = !DILocation(line: 161, column: 50, scope: !546)
!554 = !DILocation(line: 8, column: 7, scope: !555, inlinedAt: !557)
!555 = distinct !DISubprogram(name: "list_to_aligned_array", linkageName: "list_to_aligned_array", scope: !556, file: !556, line: 6, scopeLine: 6, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271, retainedNodes: !89)
!556 = !DIFile(filename: "list_common.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!557 = !DILocation(line: 163, column: 9, scope: !546)
!558 = !DILocation(line: 8, column: 25, scope: !555, inlinedAt: !557)
!559 = !DILocalVariable(name: "result", scope: !555, file: !2, line: 9, type: !306, align: 64)
!560 = !DILocation(line: 9, column: 10, scope: !555, inlinedAt: !557)
!561 = !DILocation(line: 9, column: 68, scope: !555, inlinedAt: !557)
!562 = !DILocation(line: 296, column: 59, scope: !563, inlinedAt: !565)
!563 = distinct !DISubprogram(name: "alloc_array_aligned", linkageName: "alloc_array_aligned", scope: !564, file: !564, line: 294, scopeLine: 294, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271)
!564 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!565 = !DILocation(line: 9, column: 19, scope: !555, inlinedAt: !557)
!566 = !DILocation(line: 296, column: 44, scope: !563, inlinedAt: !565)
!567 = !DILocation(line: 128, column: 6, scope: !568, inlinedAt: !569)
!568 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "malloc_aligned", scope: !564, file: !564, line: 126, scopeLine: 126, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271)
!569 = !DILocation(line: 296, column: 18, scope: !563, inlinedAt: !565)
!570 = !DILocation(line: 128, column: 20, scope: !568, inlinedAt: !569)
!571 = !DILocation(line: 134, column: 28, scope: !568, inlinedAt: !569)
!572 = !DILocation(line: 134, column: 43, scope: !568, inlinedAt: !569)
!573 = !DILocation(line: 38, column: 12, scope: !568, inlinedAt: !569)
!574 = !DILocation(line: 1039, column: 9, scope: !575, inlinedAt: !577)
!575 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !576, file: !576, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271)
!576 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!577 = !DILocation(line: 38, column: 26, scope: !568, inlinedAt: !569)
!578 = !DILocation(line: 1039, column: 20, scope: !575, inlinedAt: !577)
!579 = !DILocation(line: 1039, column: 25, scope: !575, inlinedAt: !577)
!580 = !DILocation(line: 1039, column: 19, scope: !575, inlinedAt: !577)
!581 = !DILocation(line: 134, column: 10, scope: !568, inlinedAt: !569)
!582 = !DILocation(line: 296, column: 86, scope: !563, inlinedAt: !565)
!583 = !DILocation(line: 296, column: 9, scope: !563, inlinedAt: !565)
!584 = !DILocation(line: 10, column: 15, scope: !555, inlinedAt: !557)
!585 = !DILocation(line: 10, column: 29, scope: !555, inlinedAt: !557)
!586 = !DILocation(line: 10, column: 2, scope: !555, inlinedAt: !557)
!587 = !DILocation(line: 10, column: 9, scope: !555, inlinedAt: !557)
!588 = !DILocation(line: 11, column: 9, scope: !555, inlinedAt: !557)
!589 = distinct !DISubprogram(name: "to_tarray", linkageName: "std.collections.list.List$String$.to_tarray", scope: !2, file: !2, line: 174, type: !590, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!590 = !DISubroutineType(types: !591)
!591 = !{!306, !277}
!592 = !DILocation(line: 175, column: 1, scope: !589)
!593 = !DILocalVariable(name: "self", arg: 1, scope: !589, file: !2, line: 174, type: !277)
!594 = !DILocation(line: 174, column: 26, scope: !589)
!595 = !DILocation(line: 179, column: 23, scope: !589)
!596 = !DILocation(line: 169, column: 28, scope: !597, inlinedAt: !599)
!597 = distinct !DILexicalBlock(scope: !598, file: !2, line: 170, column: 1)
!598 = distinct !DISubprogram(name: "to_array", linkageName: "to_array", scope: !2, file: !2, line: 169, scopeLine: 169, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271)
!599 = !DILocation(line: 179, column: 9, scope: !589)
!600 = !DILocation(line: 16, column: 7, scope: !601, inlinedAt: !602)
!601 = distinct !DISubprogram(name: "list_to_array", linkageName: "list_to_array", scope: !556, file: !556, line: 14, scopeLine: 14, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271, retainedNodes: !89)
!602 = !DILocation(line: 171, column: 9, scope: !598, inlinedAt: !599)
!603 = !DILocation(line: 16, column: 25, scope: !601, inlinedAt: !602)
!604 = !DILocalVariable(name: "result", scope: !601, file: !2, line: 17, type: !306, align: 64)
!605 = !DILocation(line: 17, column: 10, scope: !601, inlinedAt: !602)
!606 = !DILocation(line: 17, column: 60, scope: !601, inlinedAt: !602)
!607 = !DILocation(line: 304, column: 55, scope: !608, inlinedAt: !609)
!608 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !564, file: !564, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271)
!609 = !DILocation(line: 287, column: 9, scope: !610, inlinedAt: !611)
!610 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !564, file: !564, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271)
!611 = !DILocation(line: 17, column: 19, scope: !601, inlinedAt: !602)
!612 = !DILocation(line: 304, column: 40, scope: !608, inlinedAt: !609)
!613 = !DILocation(line: 80, column: 6, scope: !614, inlinedAt: !615)
!614 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !564, file: !564, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271)
!615 = !DILocation(line: 304, column: 18, scope: !608, inlinedAt: !609)
!616 = !DILocation(line: 80, column: 20, scope: !614, inlinedAt: !615)
!617 = !DILocation(line: 86, column: 28, scope: !614, inlinedAt: !615)
!618 = !DILocation(line: 38, column: 12, scope: !614, inlinedAt: !615)
!619 = !DILocation(line: 1039, column: 9, scope: !620, inlinedAt: !621)
!620 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !576, file: !576, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271)
!621 = !DILocation(line: 38, column: 26, scope: !614, inlinedAt: !615)
!622 = !DILocation(line: 1039, column: 20, scope: !620, inlinedAt: !621)
!623 = !DILocation(line: 1039, column: 25, scope: !620, inlinedAt: !621)
!624 = !DILocation(line: 1039, column: 19, scope: !620, inlinedAt: !621)
!625 = !DILocation(line: 86, column: 10, scope: !614, inlinedAt: !615)
!626 = !DILocation(line: 304, column: 67, scope: !608, inlinedAt: !609)
!627 = !DILocation(line: 304, column: 9, scope: !608, inlinedAt: !609)
!628 = !DILocation(line: 18, column: 15, scope: !601, inlinedAt: !602)
!629 = !DILocation(line: 18, column: 29, scope: !601, inlinedAt: !602)
!630 = !DILocation(line: 18, column: 2, scope: !601, inlinedAt: !602)
!631 = !DILocation(line: 18, column: 9, scope: !601, inlinedAt: !602)
!632 = !DILocation(line: 19, column: 9, scope: !601, inlinedAt: !602)
!633 = distinct !DISubprogram(name: "reverse", linkageName: "std.collections.list.List$String$.reverse", scope: !2, file: !2, line: 186, type: !459, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!634 = !DILocation(line: 187, column: 1, scope: !633)
!635 = !DILocalVariable(name: "self", arg: 1, scope: !633, file: !2, line: 186, type: !277)
!636 = !DILocation(line: 186, column: 22, scope: !633)
!637 = !DILocation(line: 24, column: 6, scope: !638, inlinedAt: !639)
!638 = distinct !DISubprogram(name: "list_reverse", linkageName: "list_reverse", scope: !556, file: !556, line: 22, scopeLine: 22, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271, retainedNodes: !89)
!639 = !DILocation(line: 188, column: 2, scope: !633)
!640 = !DILocation(line: 24, column: 27, scope: !638, inlinedAt: !639)
!641 = !DILocalVariable(name: "half", scope: !638, file: !2, line: 25, type: !19, align: 64)
!642 = !DILocation(line: 25, column: 6, scope: !638, inlinedAt: !639)
!643 = !DILocation(line: 25, column: 13, scope: !638, inlinedAt: !639)
!644 = !DILocalVariable(name: "end", scope: !638, file: !2, line: 26, type: !19, align: 64)
!645 = !DILocation(line: 26, column: 6, scope: !638, inlinedAt: !639)
!646 = !DILocation(line: 26, column: 12, scope: !638, inlinedAt: !639)
!647 = !DILocalVariable(name: "i", scope: !648, file: !2, line: 27, type: !19, align: 64)
!648 = distinct !DILexicalBlock(scope: !638, file: !556, line: 27, column: 2)
!649 = !DILocation(line: 27, column: 11, scope: !648, inlinedAt: !639)
!650 = !DILocation(line: 27, column: 15, scope: !648, inlinedAt: !639)
!651 = !DILocation(line: 27, column: 18, scope: !648, inlinedAt: !639)
!652 = !DILocation(line: 27, column: 22, scope: !648, inlinedAt: !639)
!653 = !DILocalVariable(name: "temp", scope: !654, file: !2, line: 91, type: !25, align: 64)
!654 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !655, file: !655, line: 89, scopeLine: 89, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271, retainedNodes: !89)
!655 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!656 = !DILocation(line: 91, column: 6, scope: !654, inlinedAt: !657)
!657 = !DILocation(line: 29, column: 3, scope: !658, inlinedAt: !639)
!658 = distinct !DILexicalBlock(scope: !648, file: !556, line: 28, column: 2)
!659 = !DILocation(line: 29, column: 9, scope: !654, inlinedAt: !657)
!660 = !DILocation(line: 29, column: 22, scope: !654, inlinedAt: !657)
!661 = !DILocation(line: 29, column: 26, scope: !654, inlinedAt: !657)
!662 = !DILocation(line: 29, column: 39, scope: !654, inlinedAt: !657)
!663 = !DILocation(line: 29, column: 45, scope: !654, inlinedAt: !657)
!664 = !DILocation(line: 27, column: 28, scope: !648, inlinedAt: !639)
!665 = distinct !DISubprogram(name: "array_view", linkageName: "std.collections.list.List$String$.array_view", scope: !2, file: !2, line: 191, type: !590, scopeLine: 191, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!666 = !DILocation(line: 192, column: 1, scope: !665)
!667 = !DILocalVariable(name: "self", arg: 1, scope: !665, file: !2, line: 191, type: !277)
!668 = !DILocation(line: 191, column: 27, scope: !665)
!669 = !DILocation(line: 193, column: 9, scope: !665)
!670 = !DILocation(line: 193, column: 23, scope: !665)
!671 = distinct !DISubprogram(name: "add_array", linkageName: "std.collections.list.List$String$.add_array", scope: !2, file: !2, line: 202, type: !672, scopeLine: 202, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !277, !306}
!674 = !DILocation(line: 203, column: 1, scope: !671)
!675 = !DILocalVariable(name: "self", arg: 1, scope: !671, file: !2, line: 202, type: !277)
!676 = !DILocation(line: 202, column: 24, scope: !671)
!677 = !DILocalVariable(name: "array", arg: 2, scope: !671, file: !2, line: 202, type: !306)
!678 = !DILocation(line: 202, column: 38, scope: !671)
!679 = !DILocation(line: 204, column: 6, scope: !671)
!680 = !DILocation(line: 200, column: 10, scope: !671)
!681 = !DILocation(line: 200, column: 23, scope: !671)
!682 = !DILocation(line: 204, column: 24, scope: !671)
!683 = !DILocation(line: 205, column: 15, scope: !671)
!684 = !DILocation(line: 205, column: 2, scope: !671)
!685 = !DILocalVariable(name: "index", scope: !671, file: !2, line: 206, type: !19, align: 64)
!686 = !DILocation(line: 206, column: 6, scope: !671)
!687 = !DILocation(line: 206, column: 28, scope: !671)
!688 = !DILocation(line: 206, column: 34, scope: !671)
!689 = !DILocation(line: 206, column: 46, scope: !671)
!690 = !DILocation(line: 437, column: 11, scope: !671)
!691 = !DILocation(line: 437, column: 28, scope: !671)
!692 = !DILocation(line: 206, column: 14, scope: !671)
!693 = !DILocation(line: 207, column: 36, scope: !671)
!694 = !DILocation(line: 207, column: 42, scope: !671)
!695 = !DILocation(line: 207, column: 2, scope: !671)
!696 = !DILocation(line: 207, column: 15, scope: !671)
!697 = !DILocation(line: 207, column: 23, scope: !671)
!698 = distinct !DISubprogram(name: "push_all", linkageName: "std.collections.list.List$String$.push_all", scope: !2, file: !2, line: 216, type: !672, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!699 = !DILocation(line: 217, column: 1, scope: !698)
!700 = !DILocalVariable(name: "self", arg: 1, scope: !698, file: !2, line: 216, type: !277)
!701 = !DILocation(line: 216, column: 23, scope: !698)
!702 = !DILocalVariable(name: "array", arg: 2, scope: !698, file: !2, line: 216, type: !306)
!703 = !DILocation(line: 216, column: 37, scope: !698)
!704 = !DILocation(line: 218, column: 6, scope: !698)
!705 = !DILocation(line: 214, column: 10, scope: !698)
!706 = !DILocation(line: 214, column: 23, scope: !698)
!707 = !DILocation(line: 218, column: 24, scope: !698)
!708 = !DILocation(line: 219, column: 15, scope: !698)
!709 = !DILocation(line: 219, column: 2, scope: !698)
!710 = !DILocalVariable(name: "index", scope: !698, file: !2, line: 220, type: !19, align: 64)
!711 = !DILocation(line: 220, column: 6, scope: !698)
!712 = !DILocation(line: 220, column: 28, scope: !698)
!713 = !DILocation(line: 220, column: 34, scope: !698)
!714 = !DILocation(line: 220, column: 46, scope: !698)
!715 = !DILocation(line: 437, column: 11, scope: !698)
!716 = !DILocation(line: 437, column: 28, scope: !698)
!717 = !DILocation(line: 220, column: 14, scope: !698)
!718 = !DILocation(line: 221, column: 36, scope: !698)
!719 = !DILocation(line: 221, column: 42, scope: !698)
!720 = !DILocation(line: 221, column: 2, scope: !698)
!721 = !DILocation(line: 221, column: 15, scope: !698)
!722 = !DILocation(line: 221, column: 23, scope: !698)
!723 = distinct !DISubprogram(name: "push_front", linkageName: "std.collections.list.List$String$.push_front", scope: !2, file: !2, line: 224, type: !427, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!724 = !DILocation(line: 225, column: 1, scope: !723)
!725 = !DILocalVariable(name: "self", arg: 1, scope: !723, file: !2, line: 224, type: !277)
!726 = !DILocation(line: 224, column: 25, scope: !723)
!727 = !DILocalVariable(name: "type", arg: 2, scope: !723, file: !2, line: 224, type: !25)
!728 = !DILocation(line: 224, column: 37, scope: !723)
!729 = !DILocation(line: 226, column: 2, scope: !723)
!730 = !DILocation(line: 226, column: 20, scope: !723)
!731 = !DILocation(line: 230, column: 20, scope: !723)
!732 = distinct !DISubprogram(name: "insert_at", linkageName: "std.collections.list.List$String$.insert_at", scope: !2, file: !2, line: 232, type: !733, scopeLine: 232, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !277, !20, !25}
!735 = !DILocation(line: 233, column: 1, scope: !732)
!736 = !DILocalVariable(name: "self", arg: 1, scope: !732, file: !2, line: 232, type: !277)
!737 = !DILocation(line: 232, column: 24, scope: !732)
!738 = !DILocalVariable(name: "index", arg: 2, scope: !732, file: !2, line: 232, type: !19)
!739 = !DILocation(line: 232, column: 35, scope: !732)
!740 = !DILocalVariable(name: "type", arg: 3, scope: !732, file: !2, line: 232, type: !25)
!741 = !DILocation(line: 232, column: 47, scope: !732)
!742 = !DILocation(line: 230, column: 11, scope: !743)
!743 = distinct !DILexicalBlock(scope: !732, file: !2, line: 233, column: 1)
!744 = !DILocation(line: 230, column: 20, scope: !743)
!745 = !DILocation(line: 234, column: 15, scope: !732)
!746 = !DILocation(line: 234, column: 2, scope: !732)
!747 = !DILocation(line: 235, column: 16, scope: !732)
!748 = !DILocation(line: 235, column: 22, scope: !732)
!749 = !DILocation(line: 437, column: 11, scope: !732)
!750 = !DILocation(line: 437, column: 28, scope: !732)
!751 = !DILocation(line: 235, column: 2, scope: !732)
!752 = !DILocalVariable(name: "i", scope: !753, file: !2, line: 236, type: !754, align: 64)
!753 = distinct !DILexicalBlock(scope: !732, file: !2, line: 236, column: 2)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !388)
!755 = !DILocation(line: 236, column: 11, scope: !753)
!756 = !DILocation(line: 236, column: 15, scope: !753)
!757 = !DILocation(line: 236, column: 30, scope: !753)
!758 = !DILocation(line: 236, column: 34, scope: !753)
!759 = !DILocation(line: 238, column: 21, scope: !760)
!760 = distinct !DILexicalBlock(scope: !753, file: !2, line: 237, column: 2)
!761 = !DILocation(line: 238, column: 34, scope: !760)
!762 = !DILocation(line: 238, column: 3, scope: !760)
!763 = !DILocation(line: 238, column: 16, scope: !760)
!764 = !DILocation(line: 236, column: 41, scope: !753)
!765 = !DILocation(line: 240, column: 2, scope: !732)
!766 = !DILocation(line: 240, column: 15, scope: !732)
!767 = distinct !DISubprogram(name: "set_at", linkageName: "std.collections.list.List$String$.set_at", scope: !2, file: !2, line: 246, type: !733, scopeLine: 246, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!768 = !DILocation(line: 247, column: 1, scope: !767)
!769 = !DILocalVariable(name: "self", arg: 1, scope: !767, file: !2, line: 246, type: !277)
!770 = !DILocation(line: 246, column: 21, scope: !767)
!771 = !DILocalVariable(name: "index", arg: 2, scope: !767, file: !2, line: 246, type: !19)
!772 = !DILocation(line: 246, column: 32, scope: !767)
!773 = !DILocalVariable(name: "type", arg: 3, scope: !767, file: !2, line: 246, type: !25)
!774 = !DILocation(line: 246, column: 44, scope: !767)
!775 = !DILocation(line: 244, column: 11, scope: !776)
!776 = distinct !DILexicalBlock(scope: !767, file: !2, line: 247, column: 1)
!777 = !DILocation(line: 244, column: 19, scope: !776)
!778 = !DILocation(line: 248, column: 2, scope: !767)
!779 = !DILocation(line: 248, column: 15, scope: !767)
!780 = distinct !DISubprogram(name: "remove_last", linkageName: "std.collections.list.List$String$.remove_last", scope: !2, file: !2, line: 251, type: !459, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!781 = !DILocation(line: 252, column: 1, scope: !780)
!782 = !DILocalVariable(name: "self", arg: 1, scope: !780, file: !2, line: 251, type: !277)
!783 = !DILocation(line: 251, column: 27, scope: !780)
!784 = !DILocation(line: 253, column: 7, scope: !780)
!785 = !DILocation(line: 253, column: 25, scope: !780)
!786 = !DILocation(line: 254, column: 16, scope: !780)
!787 = !DILocation(line: 254, column: 22, scope: !780)
!788 = !DILocation(line: 437, column: 11, scope: !780)
!789 = !DILocation(line: 437, column: 28, scope: !780)
!790 = !DILocation(line: 254, column: 2, scope: !780)
!791 = distinct !DISubprogram(name: "remove_first", linkageName: "std.collections.list.List$String$.remove_first", scope: !2, file: !2, line: 257, type: !459, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!792 = !DILocation(line: 258, column: 1, scope: !791)
!793 = !DILocalVariable(name: "self", arg: 1, scope: !791, file: !2, line: 257, type: !277)
!794 = !DILocation(line: 257, column: 28, scope: !791)
!795 = !DILocation(line: 259, column: 7, scope: !791)
!796 = !DILocation(line: 259, column: 25, scope: !791)
!797 = !DILocation(line: 260, column: 2, scope: !791)
!798 = !DILocation(line: 136, column: 19, scope: !791)
!799 = distinct !DISubprogram(name: "first", linkageName: "std.collections.list.List$String$.first", scope: !2, file: !2, line: 263, type: !443, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!800 = !DILocation(line: 264, column: 1, scope: !799)
!801 = !DILocalVariable(name: "self", arg: 1, scope: !799, file: !2, line: 263, type: !277)
!802 = !DILocation(line: 263, column: 21, scope: !799)
!803 = !DILocation(line: 265, column: 7, scope: !799)
!804 = !DILocation(line: 265, column: 25, scope: !799)
!805 = !DILocation(line: 266, column: 9, scope: !799)
!806 = !DILocation(line: 266, column: 22, scope: !799)
!807 = distinct !DISubprogram(name: "last", linkageName: "std.collections.list.List$String$.last", scope: !2, file: !2, line: 269, type: !443, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!808 = !DILocation(line: 270, column: 1, scope: !807)
!809 = !DILocalVariable(name: "self", arg: 1, scope: !807, file: !2, line: 269, type: !277)
!810 = !DILocation(line: 269, column: 20, scope: !807)
!811 = !DILocation(line: 271, column: 7, scope: !807)
!812 = !DILocation(line: 271, column: 25, scope: !807)
!813 = !DILocation(line: 272, column: 9, scope: !807)
!814 = !DILocation(line: 272, column: 22, scope: !807)
!815 = distinct !DISubprogram(name: "is_empty", linkageName: "std.collections.list.List$String$.is_empty", scope: !2, file: !2, line: 275, type: !362, scopeLine: 275, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!816 = !DILocation(line: 276, column: 1, scope: !815)
!817 = !DILocalVariable(name: "self", arg: 1, scope: !815, file: !2, line: 275, type: !277)
!818 = !DILocation(line: 275, column: 23, scope: !815)
!819 = !DILocation(line: 277, column: 10, scope: !815)
!820 = distinct !DISubprogram(name: "byte_size", linkageName: "std.collections.list.List$String$.byte_size", scope: !2, file: !2, line: 280, type: !821, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!821 = !DISubroutineType(types: !822)
!822 = !{!19, !277}
!823 = !DILocation(line: 281, column: 1, scope: !820)
!824 = !DILocalVariable(name: "self", arg: 1, scope: !820, file: !2, line: 280, type: !277)
!825 = !DILocation(line: 280, column: 23, scope: !820)
!826 = !DILocation(line: 282, column: 23, scope: !820)
!827 = !DILocation(line: 282, column: 9, scope: !820)
!828 = distinct !DISubprogram(name: "len", linkageName: "std.collections.list.List$String$.len", scope: !2, file: !2, line: 285, type: !821, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!829 = !DILocation(line: 286, column: 1, scope: !828)
!830 = !DILocalVariable(name: "self", arg: 1, scope: !828, file: !2, line: 285, type: !277)
!831 = !DILocation(line: 285, column: 17, scope: !828)
!832 = !DILocation(line: 287, column: 9, scope: !828)
!833 = distinct !DISubprogram(name: "get", linkageName: "std.collections.list.List$String$.get", scope: !2, file: !2, line: 293, type: !834, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!834 = !DISubroutineType(types: !835)
!835 = !{!25, !277, !20}
!836 = !DILocation(line: 294, column: 1, scope: !833)
!837 = !DILocalVariable(name: "self", arg: 1, scope: !833, file: !2, line: 293, type: !277)
!838 = !DILocation(line: 293, column: 18, scope: !833)
!839 = !DILocalVariable(name: "index", arg: 2, scope: !833, file: !2, line: 293, type: !19)
!840 = !DILocation(line: 293, column: 29, scope: !833)
!841 = !DILocation(line: 291, column: 11, scope: !842)
!842 = distinct !DILexicalBlock(scope: !833, file: !2, line: 294, column: 1)
!843 = !DILocation(line: 291, column: 19, scope: !842)
!844 = !DILocation(line: 295, column: 9, scope: !833)
!845 = !DILocation(line: 295, column: 22, scope: !833)
!846 = distinct !DISubprogram(name: "free", linkageName: "std.collections.list.List$String$.free", scope: !2, file: !2, line: 298, type: !459, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!847 = !DILocation(line: 299, column: 1, scope: !846)
!848 = !DILocalVariable(name: "self", arg: 1, scope: !846, file: !2, line: 298, type: !277)
!849 = !DILocation(line: 298, column: 19, scope: !846)
!850 = !DILocation(line: 300, column: 7, scope: !846)
!851 = !DILocation(line: 300, column: 25, scope: !846)
!852 = !DILocation(line: 300, column: 58, scope: !846)
!853 = !DILocation(line: 300, column: 79, scope: !846)
!854 = !DILocation(line: 449, column: 7, scope: !855, inlinedAt: !856)
!855 = distinct !DISubprogram(name: "list_pre_free{String}", linkageName: "list_pre_free{String}", scope: !2, file: !2, line: 447, scopeLine: 447, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271)
!856 = !DILocation(line: 302, column: 2, scope: !846)
!857 = !DILocation(line: 449, column: 28, scope: !855, inlinedAt: !856)
!858 = !DILocation(line: 450, column: 27, scope: !855, inlinedAt: !856)
!859 = !DILocation(line: 450, column: 38, scope: !855, inlinedAt: !856)
!860 = !DILocation(line: 450, column: 2, scope: !855, inlinedAt: !856)
!861 = !DILocation(line: 307, column: 19, scope: !846)
!862 = !DILocation(line: 307, column: 35, scope: !846)
!863 = !DILocation(line: 119, column: 6, scope: !864, inlinedAt: !865)
!864 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !564, file: !564, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271)
!865 = !DILocation(line: 307, column: 3, scope: !846)
!866 = !DILocation(line: 119, column: 18, scope: !864, inlinedAt: !865)
!867 = !DILocation(line: 123, column: 20, scope: !864, inlinedAt: !865)
!868 = !DILocation(line: 123, column: 2, scope: !864, inlinedAt: !865)
!869 = !DILocation(line: 309, column: 2, scope: !846)
!870 = !DILocation(line: 310, column: 2, scope: !846)
!871 = !DILocation(line: 311, column: 2, scope: !846)
!872 = distinct !DISubprogram(name: "swap", linkageName: "std.collections.list.List$String$.swap", scope: !2, file: !2, line: 317, type: !873, scopeLine: 317, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !277, !20, !20}
!875 = !DILocation(line: 318, column: 1, scope: !872)
!876 = !DILocalVariable(name: "self", arg: 1, scope: !872, file: !2, line: 317, type: !277)
!877 = !DILocation(line: 317, column: 19, scope: !872)
!878 = !DILocalVariable(name: "i", arg: 2, scope: !872, file: !2, line: 317, type: !19)
!879 = !DILocation(line: 317, column: 30, scope: !872)
!880 = !DILocalVariable(name: "j", arg: 3, scope: !872, file: !2, line: 317, type: !19)
!881 = !DILocation(line: 317, column: 37, scope: !872)
!882 = !DILocation(line: 315, column: 11, scope: !883)
!883 = distinct !DILexicalBlock(scope: !872, file: !2, line: 318, column: 1)
!884 = !DILocation(line: 315, column: 15, scope: !883)
!885 = !DILocation(line: 315, column: 28, scope: !883)
!886 = !DILocation(line: 315, column: 32, scope: !883)
!887 = !DILocalVariable(name: "temp", scope: !888, file: !2, line: 91, type: !25, align: 64)
!888 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !655, file: !655, line: 89, scopeLine: 89, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271, retainedNodes: !89)
!889 = !DILocation(line: 91, column: 6, scope: !888, inlinedAt: !890)
!890 = !DILocation(line: 319, column: 2, scope: !872)
!891 = !DILocation(line: 319, column: 8, scope: !888, inlinedAt: !890)
!892 = !DILocation(line: 319, column: 21, scope: !888, inlinedAt: !890)
!893 = !DILocation(line: 319, column: 25, scope: !888, inlinedAt: !890)
!894 = !DILocation(line: 319, column: 38, scope: !888, inlinedAt: !890)
!895 = distinct !DISubprogram(name: "remove_if", linkageName: "std.collections.list.List$String$.remove_if", scope: !2, file: !2, line: 326, type: !896, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!896 = !DISubroutineType(types: !897)
!897 = !{!19, !277, !898}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64, dwarfAddressSpace: 0)
!899 = !DISubroutineType(types: !900)
!900 = !{!3, !24}
!901 = !DILocation(line: 327, column: 1, scope: !895)
!902 = !DILocalVariable(name: "self", arg: 1, scope: !895, file: !2, line: 326, type: !277)
!903 = !DILocation(line: 326, column: 23, scope: !895)
!904 = !DILocalVariable(name: "filter", arg: 2, scope: !895, file: !2, line: 326, type: !905)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementPredicate{String}", scope: !2, file: !2, line: 7, baseType: !898, align: 64)
!906 = !DILocation(line: 326, column: 47, scope: !895)
!907 = !DILocalVariable(name: "size", scope: !908, file: !2, line: 91, type: !19, align: 64)
!908 = distinct !DISubprogram(name: "list_remove_if", linkageName: "list_remove_if", scope: !556, file: !556, line: 89, scopeLine: 89, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271, retainedNodes: !89)
!909 = !DILocation(line: 91, column: 6, scope: !908, inlinedAt: !910)
!910 = !DILocation(line: 328, column: 9, scope: !895)
!911 = !DILocation(line: 91, column: 13, scope: !908, inlinedAt: !910)
!912 = !DILocalVariable(name: "i", scope: !913, file: !2, line: 92, type: !19, align: 64)
!913 = distinct !DILexicalBlock(scope: !908, file: !556, line: 92, column: 2)
!914 = !DILocation(line: 92, column: 11, scope: !913, inlinedAt: !910)
!915 = !DILocation(line: 92, column: 15, scope: !913, inlinedAt: !910)
!916 = !DILocalVariable(name: "k", scope: !913, file: !2, line: 92, type: !19, align: 64)
!917 = !DILocation(line: 92, column: 25, scope: !913, inlinedAt: !910)
!918 = !DILocation(line: 92, column: 29, scope: !913, inlinedAt: !910)
!919 = !DILocation(line: 92, column: 35, scope: !913, inlinedAt: !910)
!920 = !DILocation(line: 98, column: 4, scope: !921, inlinedAt: !910)
!921 = distinct !DILexicalBlock(scope: !913, file: !556, line: 93, column: 2)
!922 = !DILocation(line: 98, column: 11, scope: !923, inlinedAt: !910)
!923 = distinct !DILexicalBlock(scope: !921, file: !556, line: 98, column: 4)
!924 = !DILocation(line: 98, column: 20, scope: !923, inlinedAt: !910)
!925 = !DILocation(line: 98, column: 28, scope: !923, inlinedAt: !910)
!926 = !DILocation(line: 98, column: 41, scope: !923, inlinedAt: !910)
!927 = !DILocation(line: 98, column: 50, scope: !923, inlinedAt: !910)
!928 = !DILocalVariable(name: "n", scope: !921, file: !2, line: 101, type: !19, align: 64)
!929 = !DILocation(line: 101, column: 7, scope: !921, inlinedAt: !910)
!930 = !DILocation(line: 101, column: 11, scope: !921, inlinedAt: !910)
!931 = !DILocation(line: 101, column: 23, scope: !921, inlinedAt: !910)
!932 = !DILocation(line: 102, column: 23, scope: !921, inlinedAt: !910)
!933 = !DILocation(line: 102, column: 36, scope: !921, inlinedAt: !910)
!934 = !DILocation(line: 102, column: 38, scope: !921, inlinedAt: !910)
!935 = !DILocation(line: 102, column: 3, scope: !921, inlinedAt: !910)
!936 = !DILocation(line: 102, column: 16, scope: !921, inlinedAt: !910)
!937 = !DILocation(line: 102, column: 18, scope: !921, inlinedAt: !910)
!938 = !DILocation(line: 103, column: 3, scope: !921, inlinedAt: !910)
!939 = !DILocation(line: 103, column: 16, scope: !921, inlinedAt: !910)
!940 = !DILocation(line: 103, column: 20, scope: !921, inlinedAt: !910)
!941 = !DILocation(line: 108, column: 4, scope: !921, inlinedAt: !910)
!942 = !DILocation(line: 108, column: 11, scope: !943, inlinedAt: !910)
!943 = distinct !DILexicalBlock(scope: !921, file: !556, line: 108, column: 4)
!944 = !DILocation(line: 108, column: 21, scope: !943, inlinedAt: !910)
!945 = !DILocation(line: 108, column: 29, scope: !943, inlinedAt: !910)
!946 = !DILocation(line: 108, column: 42, scope: !943, inlinedAt: !910)
!947 = !DILocation(line: 108, column: 51, scope: !943, inlinedAt: !910)
!948 = !DILocation(line: 92, column: 46, scope: !913, inlinedAt: !910)
!949 = !DILocation(line: 111, column: 9, scope: !908, inlinedAt: !910)
!950 = !DILocation(line: 111, column: 16, scope: !908, inlinedAt: !910)
!951 = distinct !DISubprogram(name: "retain_if", linkageName: "std.collections.list.List$String$.retain_if", scope: !2, file: !2, line: 335, type: !896, scopeLine: 335, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!952 = !DILocation(line: 336, column: 1, scope: !951)
!953 = !DILocalVariable(name: "self", arg: 1, scope: !951, file: !2, line: 335, type: !277)
!954 = !DILocation(line: 335, column: 23, scope: !951)
!955 = !DILocalVariable(name: "selection", arg: 2, scope: !951, file: !2, line: 335, type: !905)
!956 = !DILocation(line: 335, column: 47, scope: !951)
!957 = !DILocalVariable(name: "size", scope: !958, file: !2, line: 91, type: !19, align: 64)
!958 = distinct !DISubprogram(name: "list_remove_if", linkageName: "list_remove_if", scope: !556, file: !556, line: 89, scopeLine: 89, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271, retainedNodes: !89)
!959 = !DILocation(line: 91, column: 6, scope: !958, inlinedAt: !960)
!960 = !DILocation(line: 337, column: 9, scope: !951)
!961 = !DILocation(line: 91, column: 13, scope: !958, inlinedAt: !960)
!962 = !DILocalVariable(name: "i", scope: !963, file: !2, line: 92, type: !19, align: 64)
!963 = distinct !DILexicalBlock(scope: !958, file: !556, line: 92, column: 2)
!964 = !DILocation(line: 92, column: 11, scope: !963, inlinedAt: !960)
!965 = !DILocation(line: 92, column: 15, scope: !963, inlinedAt: !960)
!966 = !DILocalVariable(name: "k", scope: !963, file: !2, line: 92, type: !19, align: 64)
!967 = !DILocation(line: 92, column: 25, scope: !963, inlinedAt: !960)
!968 = !DILocation(line: 92, column: 29, scope: !963, inlinedAt: !960)
!969 = !DILocation(line: 92, column: 35, scope: !963, inlinedAt: !960)
!970 = !DILocation(line: 96, column: 4, scope: !971, inlinedAt: !960)
!971 = distinct !DILexicalBlock(scope: !963, file: !556, line: 93, column: 2)
!972 = !DILocation(line: 96, column: 11, scope: !973, inlinedAt: !960)
!973 = distinct !DILexicalBlock(scope: !971, file: !556, line: 96, column: 4)
!974 = !DILocation(line: 96, column: 21, scope: !973, inlinedAt: !960)
!975 = !DILocation(line: 96, column: 29, scope: !973, inlinedAt: !960)
!976 = !DILocation(line: 96, column: 42, scope: !973, inlinedAt: !960)
!977 = !DILocation(line: 96, column: 51, scope: !973, inlinedAt: !960)
!978 = !DILocalVariable(name: "n", scope: !971, file: !2, line: 101, type: !19, align: 64)
!979 = !DILocation(line: 101, column: 7, scope: !971, inlinedAt: !960)
!980 = !DILocation(line: 101, column: 11, scope: !971, inlinedAt: !960)
!981 = !DILocation(line: 101, column: 23, scope: !971, inlinedAt: !960)
!982 = !DILocation(line: 102, column: 23, scope: !971, inlinedAt: !960)
!983 = !DILocation(line: 102, column: 36, scope: !971, inlinedAt: !960)
!984 = !DILocation(line: 102, column: 38, scope: !971, inlinedAt: !960)
!985 = !DILocation(line: 102, column: 3, scope: !971, inlinedAt: !960)
!986 = !DILocation(line: 102, column: 16, scope: !971, inlinedAt: !960)
!987 = !DILocation(line: 102, column: 18, scope: !971, inlinedAt: !960)
!988 = !DILocation(line: 103, column: 3, scope: !971, inlinedAt: !960)
!989 = !DILocation(line: 103, column: 16, scope: !971, inlinedAt: !960)
!990 = !DILocation(line: 103, column: 20, scope: !971, inlinedAt: !960)
!991 = !DILocation(line: 106, column: 4, scope: !971, inlinedAt: !960)
!992 = !DILocation(line: 106, column: 11, scope: !993, inlinedAt: !960)
!993 = distinct !DILexicalBlock(scope: !971, file: !556, line: 106, column: 4)
!994 = !DILocation(line: 106, column: 20, scope: !993, inlinedAt: !960)
!995 = !DILocation(line: 106, column: 28, scope: !993, inlinedAt: !960)
!996 = !DILocation(line: 106, column: 41, scope: !993, inlinedAt: !960)
!997 = !DILocation(line: 106, column: 50, scope: !993, inlinedAt: !960)
!998 = !DILocation(line: 92, column: 46, scope: !963, inlinedAt: !960)
!999 = !DILocation(line: 111, column: 9, scope: !958, inlinedAt: !960)
!1000 = !DILocation(line: 111, column: 16, scope: !958, inlinedAt: !960)
!1001 = distinct !DISubprogram(name: "remove_using_test", linkageName: "std.collections.list.List$String$.remove_using_test", scope: !2, file: !2, line: 340, type: !1002, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!19, !277, !1004, !1007}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64, dwarfAddressSpace: 0)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!3, !24, !1007}
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !1008, identifier: "any")
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1007, baseType: !11, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1007, baseType: !13, size: 64, align: 64, offset: 64)
!1011 = !DILocation(line: 341, column: 1, scope: !1001)
!1012 = !DILocalVariable(name: "self", arg: 1, scope: !1001, file: !2, line: 340, type: !277)
!1013 = !DILocation(line: 340, column: 31, scope: !1001)
!1014 = !DILocalVariable(name: "filter", arg: 2, scope: !1001, file: !2, line: 340, type: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementTest{String}", scope: !2, file: !2, line: 8, baseType: !1004, align: 64)
!1016 = !DILocation(line: 340, column: 50, scope: !1001)
!1017 = !DILocalVariable(name: "context", arg: 3, scope: !1001, file: !2, line: 340, type: !1007)
!1018 = !DILocation(line: 340, column: 62, scope: !1001)
!1019 = !DILocalVariable(name: "old_size", scope: !1001, file: !2, line: 342, type: !19, align: 64)
!1020 = !DILocation(line: 342, column: 6, scope: !1001)
!1021 = !DILocation(line: 342, column: 17, scope: !1001)
!1022 = !DILocalVariable(name: "size", scope: !1023, file: !2, line: 35, type: !19, align: 64)
!1023 = distinct !DISubprogram(name: "list_remove_using_test", linkageName: "list_remove_using_test", scope: !556, file: !556, line: 33, scopeLine: 33, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271, retainedNodes: !89)
!1024 = !DILocation(line: 35, column: 6, scope: !1023, inlinedAt: !1025)
!1025 = !DILocation(line: 347, column: 9, scope: !1001)
!1026 = !DILocation(line: 35, column: 13, scope: !1023, inlinedAt: !1025)
!1027 = !DILocalVariable(name: "i", scope: !1028, file: !2, line: 36, type: !19, align: 64)
!1028 = distinct !DILexicalBlock(scope: !1023, file: !556, line: 36, column: 2)
!1029 = !DILocation(line: 36, column: 11, scope: !1028, inlinedAt: !1025)
!1030 = !DILocation(line: 36, column: 15, scope: !1028, inlinedAt: !1025)
!1031 = !DILocalVariable(name: "k", scope: !1028, file: !2, line: 36, type: !19, align: 64)
!1032 = !DILocation(line: 36, column: 25, scope: !1028, inlinedAt: !1025)
!1033 = !DILocation(line: 36, column: 29, scope: !1028, inlinedAt: !1025)
!1034 = !DILocation(line: 36, column: 35, scope: !1028, inlinedAt: !1025)
!1035 = !DILocation(line: 42, column: 4, scope: !1036, inlinedAt: !1025)
!1036 = distinct !DILexicalBlock(scope: !1028, file: !556, line: 37, column: 2)
!1037 = !DILocation(line: 42, column: 11, scope: !1038, inlinedAt: !1025)
!1038 = distinct !DILexicalBlock(scope: !1036, file: !556, line: 42, column: 4)
!1039 = !DILocation(line: 42, column: 20, scope: !1038, inlinedAt: !1025)
!1040 = !DILocation(line: 42, column: 28, scope: !1038, inlinedAt: !1025)
!1041 = !DILocation(line: 42, column: 41, scope: !1038, inlinedAt: !1025)
!1042 = !DILocation(line: 42, column: 49, scope: !1038, inlinedAt: !1025)
!1043 = !DILocation(line: 42, column: 55, scope: !1038, inlinedAt: !1025)
!1044 = !DILocalVariable(name: "n", scope: !1036, file: !2, line: 45, type: !19, align: 64)
!1045 = !DILocation(line: 45, column: 7, scope: !1036, inlinedAt: !1025)
!1046 = !DILocation(line: 45, column: 11, scope: !1036, inlinedAt: !1025)
!1047 = !DILocation(line: 45, column: 23, scope: !1036, inlinedAt: !1025)
!1048 = !DILocation(line: 46, column: 23, scope: !1036, inlinedAt: !1025)
!1049 = !DILocation(line: 46, column: 36, scope: !1036, inlinedAt: !1025)
!1050 = !DILocation(line: 46, column: 38, scope: !1036, inlinedAt: !1025)
!1051 = !DILocation(line: 46, column: 3, scope: !1036, inlinedAt: !1025)
!1052 = !DILocation(line: 46, column: 16, scope: !1036, inlinedAt: !1025)
!1053 = !DILocation(line: 46, column: 18, scope: !1036, inlinedAt: !1025)
!1054 = !DILocation(line: 47, column: 3, scope: !1036, inlinedAt: !1025)
!1055 = !DILocation(line: 47, column: 16, scope: !1036, inlinedAt: !1025)
!1056 = !DILocation(line: 47, column: 20, scope: !1036, inlinedAt: !1025)
!1057 = !DILocation(line: 52, column: 4, scope: !1036, inlinedAt: !1025)
!1058 = !DILocation(line: 52, column: 11, scope: !1059, inlinedAt: !1025)
!1059 = distinct !DILexicalBlock(scope: !1036, file: !556, line: 52, column: 4)
!1060 = !DILocation(line: 52, column: 21, scope: !1059, inlinedAt: !1025)
!1061 = !DILocation(line: 52, column: 29, scope: !1059, inlinedAt: !1025)
!1062 = !DILocation(line: 52, column: 42, scope: !1059, inlinedAt: !1025)
!1063 = !DILocation(line: 52, column: 50, scope: !1059, inlinedAt: !1025)
!1064 = !DILocation(line: 52, column: 56, scope: !1059, inlinedAt: !1025)
!1065 = !DILocation(line: 36, column: 46, scope: !1028, inlinedAt: !1025)
!1066 = !DILocation(line: 55, column: 9, scope: !1023, inlinedAt: !1025)
!1067 = !DILocation(line: 55, column: 16, scope: !1023, inlinedAt: !1025)
!1068 = !DILocation(line: 345, column: 7, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1001, file: !2, line: 344, column: 2)
!1070 = !DILocation(line: 345, column: 19, scope: !1069)
!1071 = !DILocation(line: 345, column: 65, scope: !1069)
!1072 = !DILocation(line: 345, column: 30, scope: !1069)
!1073 = distinct !DISubprogram(name: "retain_using_test", linkageName: "std.collections.list.List$String$.retain_using_test", scope: !2, file: !2, line: 352, type: !1002, scopeLine: 352, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !271, retainedNodes: !89)
!1074 = !DILocation(line: 353, column: 1, scope: !1073)
!1075 = !DILocalVariable(name: "self", arg: 1, scope: !1073, file: !2, line: 352, type: !277)
!1076 = !DILocation(line: 352, column: 31, scope: !1073)
!1077 = !DILocalVariable(name: "filter", arg: 2, scope: !1073, file: !2, line: 352, type: !1015)
!1078 = !DILocation(line: 352, column: 50, scope: !1073)
!1079 = !DILocalVariable(name: "context", arg: 3, scope: !1073, file: !2, line: 352, type: !1007)
!1080 = !DILocation(line: 352, column: 62, scope: !1073)
!1081 = !DILocalVariable(name: "old_size", scope: !1073, file: !2, line: 354, type: !19, align: 64)
!1082 = !DILocation(line: 354, column: 6, scope: !1073)
!1083 = !DILocation(line: 354, column: 17, scope: !1073)
!1084 = !DILocalVariable(name: "size", scope: !1085, file: !2, line: 35, type: !19, align: 64)
!1085 = distinct !DISubprogram(name: "list_remove_using_test", linkageName: "list_remove_using_test", scope: !556, file: !556, line: 33, scopeLine: 33, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !271, retainedNodes: !89)
!1086 = !DILocation(line: 35, column: 6, scope: !1085, inlinedAt: !1087)
!1087 = !DILocation(line: 358, column: 9, scope: !1073)
!1088 = !DILocation(line: 35, column: 13, scope: !1085, inlinedAt: !1087)
!1089 = !DILocalVariable(name: "i", scope: !1090, file: !2, line: 36, type: !19, align: 64)
!1090 = distinct !DILexicalBlock(scope: !1085, file: !556, line: 36, column: 2)
!1091 = !DILocation(line: 36, column: 11, scope: !1090, inlinedAt: !1087)
!1092 = !DILocation(line: 36, column: 15, scope: !1090, inlinedAt: !1087)
!1093 = !DILocalVariable(name: "k", scope: !1090, file: !2, line: 36, type: !19, align: 64)
