; ModuleID = 'std::io::os'
source_filename = "std::io::os"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%Stat = type { i32, i16, i16, i64, i32, i32, i32, %TimeSpec, %TimeSpec, %TimeSpec, %TimeSpec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%TimeSpec = type { i64, i64 }
%"any[]" = type { ptr, i64 }
%PathImp = type { %"char[]", i32, %any }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%Utimbuf = type { i64, i64 }
%"List{PathImp}" = type { i64, i64, %any, ptr }

@"$ct.std.io.os.Utimbuf" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 16, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@.enum.DESKTOP = internal constant [8 x i8] c"DESKTOP\00", align 1
@.enum.DOCUMENTS = internal constant [10 x i8] c"DOCUMENTS\00", align 1
@.enum.VIDEOS = internal constant [7 x i8] c"VIDEOS\00", align 1
@.enum.MUSIC = internal constant [6 x i8] c"MUSIC\00", align 1
@.enum.DOWNLOADS = internal constant [10 x i8] c"DOWNLOADS\00", align 1
@.enum.PICTURES = internal constant [9 x i8] c"PICTURES\00", align 1
@.enum.TEMPLATES = internal constant [10 x i8] c"TEMPLATES\00", align 1
@.enum.PUBLIC_SHARE = internal constant [13 x i8] c"PUBLIC_SHARE\00", align 1
@.enum.SAVED_GAMES = internal constant [12 x i8] c"SAVED_GAMES\00", align 1

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "fileinfo.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io/os")
!8 = !{!9, !35, !41}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !11, file: !10, line: 23, baseType: !31, size: 32, align: 32, elements: !32)
!10 = !DIFile(filename: "rmtree.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io/os")
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !10, file: !10, line: 16, size: 320, align: 64, elements: !12, identifier: "std.io.path.PathImp")
!12 = !{!13, !23, !24}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !11, file: !10, line: 18, baseType: !14, size: 128, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !16, identifier: "char[]")
!16 = !{!17, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !22)
!22 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !11, file: !10, line: 19, baseType: !9, size: 32, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !11, file: !10, line: 20, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !26, identifier: "Allocator")
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !25, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !{!33, !34}
!33 = !DIEnumerator(name: "WIN32", value: 0)
!34 = !DIEnumerator(name: "POSIX", value: 1)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SeekOrigin", scope: !36, file: !36, line: 14, baseType: !31, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "file_libc.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io/os")
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "FROM_START", value: 0)
!39 = !DIEnumerator(name: "FROM_CURSOR", value: 1)
!40 = !DIEnumerator(name: "FROM_END", value: 2)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NativeSystemDir", scope: !42, file: !42, line: 3, baseType: !31, size: 32, align: 32, elements: !43)
!42 = !DIFile(filename: "temp_directory.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io/os")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!44 = !DIEnumerator(name: "DESKTOP", value: 0)
!45 = !DIEnumerator(name: "DOCUMENTS", value: 1)
!46 = !DIEnumerator(name: "VIDEOS", value: 2)
!47 = !DIEnumerator(name: "MUSIC", value: 3)
!48 = !DIEnumerator(name: "DOWNLOADS", value: 4)
!49 = !DIEnumerator(name: "PICTURES", value: 5)
!50 = !DIEnumerator(name: "TEMPLATES", value: 6)
!51 = !DIEnumerator(name: "PUBLIC_SHARE", value: 7)
!52 = !DIEnumerator(name: "SAVED_GAMES", value: 8)
!53 = !DIEnumerator(name: "SCREENSHOTS", value: 9)
!54 = distinct !DISubprogram(name: "native_file_or_dir_exists", linkageName: "std.io.os.native_file_or_dir_exists", scope: !7, file: !7, line: 65, type: !55, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !14}
!57 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!58 = !{}
!59 = !DILocalVariable(name: "path", arg: 1, scope: !54, file: !7, line: 65, type: !14)
!60 = !DILocation(line: 65, column: 42, scope: !54)
!61 = !DILocalVariable(name: "stat", scope: !54, file: !7, line: 74, type: !62, align: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stat", scope: !7, file: !7, line: 10, size: 1152, align: 64, elements: !63, identifier: "libc.Stat")
!63 = !{!64, !66, !69, !71, !73, !76, !78, !79, !87, !88, !89, !90, !92, !94, !96, !97, !98, !99}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !62, file: !7, line: 12, baseType: !65, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dev_t", scope: !7, file: !7, line: 3, baseType: !31, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !62, file: !7, line: 13, baseType: !67, size: 16, align: 16, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mode_t", scope: !7, file: !7, line: 4, baseType: !68, align: 16)
!68 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !62, file: !7, line: 14, baseType: !70, size: 16, align: 16, offset: 48)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nlink_t", scope: !7, file: !7, line: 5, baseType: !68, align: 16)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !62, file: !7, line: 15, baseType: !72, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ino_t", scope: !7, file: !7, line: 8, baseType: !22, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !62, file: !7, line: 16, baseType: !74, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uid_t", scope: !7, file: !7, line: 22, baseType: !75, align: 32)
!75 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !62, file: !7, line: 17, baseType: !77, size: 32, align: 32, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gid_t", scope: !7, file: !7, line: 23, baseType: !75, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !62, file: !7, line: 18, baseType: !65, size: 32, align: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !62, file: !7, line: 21, baseType: !80, size: 128, align: 64, offset: 256)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "TimeSpec", scope: !62, file: !7, line: 429, size: 128, align: 64, elements: !81, identifier: "libc.TimeSpec")
!81 = !{!82, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !80, file: !7, line: 431, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !7, file: !7, line: 67, baseType: !84, align: 64)
!84 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !80, file: !7, line: 433, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLong", scope: !7, file: !7, line: 25, baseType: !84, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !62, file: !7, line: 23, baseType: !80, size: 128, align: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !62, file: !7, line: 25, baseType: !80, size: 128, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !62, file: !7, line: 27, baseType: !80, size: 128, align: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !62, file: !7, line: 29, baseType: !91, size: 64, align: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "Off_t", scope: !7, file: !7, line: 68, baseType: !84, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !62, file: !7, line: 31, baseType: !93, size: 64, align: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blkcnt_t", scope: !7, file: !7, line: 6, baseType: !84, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocksize", scope: !62, file: !7, line: 33, baseType: !95, size: 32, align: 32, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blksize_t", scope: !7, file: !7, line: 7, baseType: !31, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !62, file: !7, line: 35, baseType: !75, size: 32, align: 32, offset: 928)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !62, file: !7, line: 37, baseType: !75, size: 32, align: 32, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !62, file: !7, line: 39, baseType: !31, size: 32, align: 32, offset: 992)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !62, file: !7, line: 41, baseType: !100, size: 128, align: 64, offset: 1024)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, align: 64, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 2, lowerBound: 0)
!103 = !DILocation(line: 74, column: 9, scope: !54)
!104 = !DILocation(line: 75, column: 34, scope: !105, inlinedAt: !107)
!105 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !106, file: !106, line: 527, scopeLine: 527, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!106 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!107 = !DILocation(line: 75, column: 11, scope: !54)
!108 = !DILocation(line: 529, column: 12, scope: !105, inlinedAt: !107)
!109 = !DILocation(line: 529, column: 26, scope: !105, inlinedAt: !107)
!110 = !DILocation(line: 530, column: 9, scope: !105, inlinedAt: !107)
!111 = distinct !DISubprogram(name: "native_is_file", linkageName: "std.io.os.native_is_file", scope: !7, file: !7, line: 91, type: !55, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!112 = !DILocalVariable(name: "path", arg: 1, scope: !111, file: !7, line: 91, type: !14)
!113 = !DILocation(line: 91, column: 31, scope: !111)
!114 = !DILocalVariable(name: "stat", scope: !111, file: !7, line: 100, type: !62, align: 64)
!115 = !DILocation(line: 100, column: 9, scope: !111)
!116 = !DILocation(line: 101, column: 34, scope: !117, inlinedAt: !118)
!117 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !106, file: !106, line: 527, scopeLine: 527, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!118 = !DILocation(line: 101, column: 11, scope: !111)
!119 = !DILocation(line: 529, column: 12, scope: !117, inlinedAt: !118)
!120 = !DILocation(line: 529, column: 26, scope: !117, inlinedAt: !118)
!121 = !DILocation(line: 530, column: 9, scope: !117, inlinedAt: !118)
!122 = !DILocation(line: 101, column: 58, scope: !111)
!123 = !DILocation(line: 380, column: 52, scope: !124, inlinedAt: !126)
!124 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !125, file: !125, line: 380, scopeLine: 380, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!125 = !DIFile(filename: "libc.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/libc")
!126 = !DILocation(line: 101, column: 44, scope: !111)
!127 = !DILocation(line: 380, column: 71, scope: !124, inlinedAt: !126)
!128 = !DILocation(line: 380, column: 51, scope: !124, inlinedAt: !126)
!129 = distinct !DISubprogram(name: "native_is_dir", linkageName: "std.io.os.native_is_dir", scope: !7, file: !7, line: 109, type: !55, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!130 = !DILocalVariable(name: "path", arg: 1, scope: !129, file: !7, line: 109, type: !14)
!131 = !DILocation(line: 109, column: 30, scope: !129)
!132 = !DILocalVariable(name: "stat", scope: !129, file: !7, line: 112, type: !62, align: 64)
!133 = !DILocation(line: 112, column: 8, scope: !129)
!134 = !DILocation(line: 113, column: 33, scope: !135, inlinedAt: !136)
!135 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !106, file: !106, line: 527, scopeLine: 527, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!136 = !DILocation(line: 113, column: 10, scope: !129)
!137 = !DILocation(line: 529, column: 12, scope: !135, inlinedAt: !136)
!138 = !DILocation(line: 529, column: 26, scope: !135, inlinedAt: !136)
!139 = !DILocation(line: 530, column: 9, scope: !135, inlinedAt: !136)
!140 = !DILocation(line: 113, column: 57, scope: !129)
!141 = !DILocation(line: 380, column: 52, scope: !142, inlinedAt: !143)
!142 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !125, file: !125, line: 380, scopeLine: 380, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!143 = !DILocation(line: 113, column: 43, scope: !129)
!144 = !DILocation(line: 380, column: 71, scope: !142, inlinedAt: !143)
!145 = !DILocation(line: 380, column: 51, scope: !142, inlinedAt: !143)
!146 = distinct !DISubprogram(name: "native_stat", linkageName: "std.io.os.native_stat", scope: !7, file: !7, line: 4, type: !147, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !149, !14}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DILocalVariable(name: "stat", arg: 1, scope: !146, file: !7, line: 4, type: !149)
!151 = !DILocation(line: 4, column: 28, scope: !146)
!152 = !DILocalVariable(name: "path", arg: 2, scope: !146, file: !7, line: 4, type: !14)
!153 = !DILocation(line: 4, column: 41, scope: !146)
!154 = !DILocalVariable(name: "state", scope: !155, file: !7, line: 679, type: !157, align: 64)
!155 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !156, file: !156, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!156 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !7, file: !7, line: 496, baseType: !158, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64, dwarfAddressSpace: 0)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 31, size: 704, align: 64, elements: !160, identifier: "std.core.mem.allocator.TempAllocator")
!160 = !{!161, !162, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !159, file: !7, line: 33, baseType: !25, size: 128, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !159, file: !7, line: 34, baseType: !163, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64, dwarfAddressSpace: 0)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 54, size: 256, align: 64, elements: !165, identifier: "std.core.mem.allocator.TempAllocatorPage")
!165 = !{!166, !167, !168, !169, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !164, file: !7, line: 56, baseType: !163, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !164, file: !7, line: 57, baseType: !28, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !164, file: !7, line: 58, baseType: !21, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !164, file: !7, line: 59, baseType: !21, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !7, line: 60, baseType: !171, align: 8, offset: 256)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, align: 8, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 0, lowerBound: 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !159, file: !7, line: 35, baseType: !158, size: 64, align: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !159, file: !7, line: 36, baseType: !57, size: 8, align: 8, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !159, file: !7, line: 37, baseType: !21, size: 64, align: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !159, file: !7, line: 38, baseType: !21, size: 64, align: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !159, file: !7, line: 39, baseType: !21, size: 64, align: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !159, file: !7, line: 40, baseType: !21, size: 64, align: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !159, file: !7, line: 41, baseType: !21, size: 64, align: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !159, file: !7, line: 42, baseType: !21, size: 64, align: 64, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !159, file: !7, line: 43, baseType: !171, align: 8, offset: 704)
!183 = !DILocation(line: 679, column: 12, scope: !155, inlinedAt: !184)
!184 = !DILocation(line: 4, column: 116, scope: !146)
!185 = !DILocation(line: 679, column: 41, scope: !155, inlinedAt: !184)
!186 = !DILocation(line: 679, column: 20, scope: !155, inlinedAt: !184)
!187 = !DILocalVariable(name: "res", scope: !188, file: !7, line: 7, type: !31, align: 32)
!188 = distinct !DILexicalBlock(scope: !146, file: !7, line: 5, column: 1)
!189 = !DILocation(line: 7, column: 7, scope: !188)
!190 = !DILocation(line: 7, column: 24, scope: !188)
!191 = !DILocation(line: 7, column: 43, scope: !188)
!192 = !DILocation(line: 7, column: 13, scope: !188)
!193 = !DILocation(line: 12, column: 6, scope: !188)
!194 = !DILocation(line: 14, column: 11, scope: !195)
!195 = distinct !DILexicalBlock(scope: !196, file: !7, line: 14, column: 3)
!196 = distinct !DILexicalBlock(scope: !188, file: !7, line: 13, column: 2)
!197 = !DILocation(line: 682, column: 23, scope: !198, inlinedAt: !184)
!198 = distinct !DILexicalBlock(scope: !155, file: !156, line: 681, column: 2)
!199 = !DILocation(line: 682, column: 3, scope: !198, inlinedAt: !184)
!200 = !DILocation(line: 286, column: 33, scope: !201, inlinedAt: !202)
!201 = distinct !DISubprogram(name: "unreachable", linkageName: "unreachable", scope: !106, file: !106, line: 283, scopeLine: 283, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!202 = !DILocation(line: 19, column: 5, scope: !203)
!203 = distinct !DILexicalBlock(scope: !195, file: !7, line: 19, column: 5)
!204 = !DILocation(line: 286, column: 2, scope: !201, inlinedAt: !202)
!205 = !DILocation(line: 682, column: 23, scope: !206, inlinedAt: !184)
!206 = distinct !DILexicalBlock(scope: !155, file: !156, line: 681, column: 2)
!207 = !DILocation(line: 682, column: 3, scope: !206, inlinedAt: !184)
!208 = !DILocation(line: 682, column: 23, scope: !209, inlinedAt: !184)
!209 = distinct !DILexicalBlock(scope: !155, file: !156, line: 681, column: 2)
!210 = !DILocation(line: 682, column: 3, scope: !209, inlinedAt: !184)
!211 = !DILocation(line: 682, column: 23, scope: !212, inlinedAt: !184)
!212 = distinct !DILexicalBlock(scope: !155, file: !156, line: 681, column: 2)
!213 = !DILocation(line: 682, column: 3, scope: !212, inlinedAt: !184)
!214 = !DILocation(line: 682, column: 23, scope: !215, inlinedAt: !184)
!215 = distinct !DILexicalBlock(scope: !155, file: !156, line: 681, column: 2)
!216 = !DILocation(line: 682, column: 3, scope: !215, inlinedAt: !184)
!217 = !DILocation(line: 682, column: 23, scope: !218, inlinedAt: !184)
!218 = distinct !DILexicalBlock(scope: !155, file: !156, line: 681, column: 2)
!219 = !DILocation(line: 682, column: 3, scope: !218, inlinedAt: !184)
!220 = !DILocation(line: 682, column: 23, scope: !221, inlinedAt: !184)
!221 = distinct !DILexicalBlock(scope: !155, file: !156, line: 681, column: 2)
!222 = !DILocation(line: 682, column: 3, scope: !221, inlinedAt: !184)
!223 = !DILocation(line: 682, column: 23, scope: !224, inlinedAt: !184)
!224 = distinct !DILexicalBlock(scope: !155, file: !156, line: 681, column: 2)
!225 = !DILocation(line: 682, column: 3, scope: !224, inlinedAt: !184)
!226 = !DILocation(line: 682, column: 23, scope: !227, inlinedAt: !184)
!227 = distinct !DILexicalBlock(scope: !155, file: !156, line: 681, column: 2)
!228 = !DILocation(line: 682, column: 3, scope: !227, inlinedAt: !184)
!229 = !DILocation(line: 682, column: 23, scope: !230, inlinedAt: !184)
!230 = distinct !DILexicalBlock(scope: !155, file: !156, line: 681, column: 2)
!231 = !DILocation(line: 682, column: 3, scope: !230, inlinedAt: !184)
!232 = distinct !DISubprogram(name: "native_file_size", linkageName: "std.io.os.native_file_size", scope: !7, file: !7, line: 58, type: !233, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!233 = !DISubroutineType(types: !234)
!234 = !{!22, !14}
!235 = !DILocalVariable(name: "path", arg: 1, scope: !232, file: !7, line: 58, type: !14)
!236 = !DILocation(line: 58, column: 35, scope: !232)
!237 = !DILocalVariable(name: "stat", scope: !232, file: !7, line: 60, type: !62, align: 64)
!238 = !DILocation(line: 60, column: 7, scope: !232)
!239 = !DILocation(line: 61, column: 21, scope: !232)
!240 = !DILocation(line: 61, column: 2, scope: !232)
!241 = !DILocation(line: 62, column: 9, scope: !232)
!242 = distinct !DISubprogram(name: "native_rmtree", linkageName: "std.io.os.native_rmtree", scope: !10, file: !10, line: 7, type: !243, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !11}
!245 = !DILocalVariable(name: "dir", arg: 1, scope: !242, file: !10, line: 7, type: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !10, file: !10, line: 14, baseType: !11, align: 64)
!247 = !DILocation(line: 7, column: 29, scope: !242)
!248 = !DILocation(line: 5, column: 11, scope: !249)
!249 = distinct !DILexicalBlock(scope: !242, file: !10, line: 8, column: 1)
!250 = !DILocalVariable(name: "state", scope: !251, file: !10, line: 679, type: !157, align: 64)
!251 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !156, file: !156, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!252 = !DILocation(line: 679, column: 12, scope: !251, inlinedAt: !253)
!253 = !DILocation(line: 9, column: 2, scope: !242)
!254 = !DILocation(line: 679, column: 41, scope: !251, inlinedAt: !253)
!255 = !DILocation(line: 679, column: 20, scope: !251, inlinedAt: !253)
!256 = !DILocalVariable(name: "directory", scope: !257, file: !10, line: 11, type: !258, align: 64)
!257 = distinct !DILexicalBlock(scope: !242, file: !10, line: 10, column: 2)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIRPtr", scope: !10, file: !10, line: 5, baseType: !28, align: 64)
!259 = !DILocation(line: 11, column: 10, scope: !257)
!260 = !DILocation(line: 11, column: 37, scope: !257)
!261 = !DILocation(line: 11, column: 22, scope: !257)
!262 = !DILocation(line: 13, column: 7, scope: !257)
!263 = !DILocation(line: 13, column: 26, scope: !257)
!264 = !DILocation(line: 13, column: 46, scope: !257)
!265 = !DILocation(line: 13, column: 69, scope: !257)
!266 = !DILocation(line: 12, column: 13, scope: !267)
!267 = distinct !DILexicalBlock(scope: !257, file: !10, line: 12, column: 9)
!268 = !DILocation(line: 12, column: 40, scope: !267)
!269 = !DILocation(line: 12, column: 24, scope: !267)
!270 = !DILocation(line: 682, column: 23, scope: !271, inlinedAt: !253)
!271 = distinct !DILexicalBlock(scope: !251, file: !156, line: 681, column: 2)
!272 = !DILocation(line: 682, column: 3, scope: !271, inlinedAt: !253)
!273 = !DILocation(line: 12, column: 13, scope: !274)
!274 = distinct !DILexicalBlock(scope: !257, file: !10, line: 12, column: 9)
!275 = !DILocation(line: 12, column: 40, scope: !274)
!276 = !DILocation(line: 12, column: 24, scope: !274)
!277 = !DILocation(line: 682, column: 23, scope: !278, inlinedAt: !253)
!278 = distinct !DILexicalBlock(scope: !251, file: !156, line: 681, column: 2)
!279 = !DILocation(line: 682, column: 3, scope: !278, inlinedAt: !253)
!280 = !DILocalVariable(name: "entry", scope: !257, file: !10, line: 14, type: !281, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64, dwarfAddressSpace: 0)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Posix_dirent", scope: !10, file: !10, line: 7, size: 8384, align: 64, elements: !283, identifier: "std.os.posix.Posix_dirent")
!283 = !{!284, !285, !286, !287, !288, !289}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "d_fileno", scope: !282, file: !10, line: 9, baseType: !72, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !282, file: !10, line: 10, baseType: !91, size: 64, align: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !282, file: !10, line: 11, baseType: !68, size: 16, align: 16, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "d_namelen", scope: !282, file: !10, line: 12, baseType: !68, size: 16, align: 16, offset: 144)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !282, file: !10, line: 13, baseType: !19, size: 8, align: 8, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !282, file: !10, line: 24, baseType: !290, size: 8192, align: 8, offset: 168)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8192, align: 8, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 1024, lowerBound: 0)
!293 = !DILocation(line: 14, column: 17, scope: !257)
!294 = !DILocation(line: 15, column: 3, scope: !257)
!295 = !DILocation(line: 15, column: 34, scope: !296)
!296 = distinct !DILexicalBlock(scope: !257, file: !10, line: 15, column: 3)
!297 = !DILocation(line: 15, column: 19, scope: !296)
!298 = !DILocalVariable(name: "state", scope: !299, file: !10, line: 679, type: !157, align: 64)
!299 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !156, file: !156, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!300 = !DILocation(line: 679, column: 12, scope: !299, inlinedAt: !301)
!301 = !DILocation(line: 17, column: 4, scope: !302)
!302 = distinct !DILexicalBlock(scope: !296, file: !10, line: 16, column: 3)
!303 = !DILocation(line: 679, column: 41, scope: !299, inlinedAt: !301)
!304 = !DILocation(line: 679, column: 20, scope: !299, inlinedAt: !301)
!305 = !DILocalVariable(name: "name", scope: !306, file: !10, line: 19, type: !14, align: 64)
!306 = distinct !DILexicalBlock(scope: !302, file: !10, line: 18, column: 4)
!307 = !DILocation(line: 19, column: 12, scope: !306)
!308 = !DILocation(line: 19, column: 30, scope: !306)
!309 = !DILocation(line: 19, column: 19, scope: !306)
!310 = !DILocation(line: 20, column: 10, scope: !306)
!311 = !DILocation(line: 20, column: 18, scope: !306)
!312 = !DILocation(line: 20, column: 33, scope: !306)
!313 = !DILocation(line: 682, column: 23, scope: !314, inlinedAt: !301)
!314 = distinct !DILexicalBlock(scope: !299, file: !156, line: 681, column: 2)
!315 = !DILocation(line: 682, column: 3, scope: !314, inlinedAt: !301)
!316 = !DILocalVariable(name: "new_path", scope: !306, file: !10, line: 21, type: !246, align: 64)
!317 = !DILocation(line: 21, column: 10, scope: !306)
!318 = !DILocation(line: 21, column: 21, scope: !306)
!319 = !DILocation(line: 682, column: 23, scope: !320, inlinedAt: !301)
!320 = distinct !DILexicalBlock(scope: !299, file: !156, line: 681, column: 2)
!321 = !DILocation(line: 682, column: 3, scope: !320, inlinedAt: !301)
!322 = !DILocation(line: 12, column: 13, scope: !323)
!323 = distinct !DILexicalBlock(scope: !257, file: !10, line: 12, column: 9)
!324 = !DILocation(line: 12, column: 40, scope: !323)
!325 = !DILocation(line: 12, column: 24, scope: !323)
!326 = !DILocation(line: 682, column: 23, scope: !327, inlinedAt: !253)
!327 = distinct !DILexicalBlock(scope: !251, file: !156, line: 681, column: 2)
!328 = !DILocation(line: 682, column: 3, scope: !327, inlinedAt: !253)
!329 = !DILocation(line: 22, column: 9, scope: !306)
!330 = !DILocalVariable(name: "dir", scope: !331, file: !10, line: 24, type: !246, align: 64)
!331 = distinct !DILexicalBlock(scope: !306, file: !10, line: 23, column: 5)
!332 = !DILocation(line: 24, column: 6, scope: !331)
!333 = !DILocation(line: 24, column: 20, scope: !331)
!334 = !DILocation(line: 5, column: 11, scope: !331)
!335 = !DILocation(line: 682, column: 23, scope: !336, inlinedAt: !301)
!336 = distinct !DILexicalBlock(scope: !299, file: !156, line: 681, column: 2)
!337 = !DILocation(line: 682, column: 3, scope: !336, inlinedAt: !301)
!338 = !DILocation(line: 12, column: 13, scope: !339)
!339 = distinct !DILexicalBlock(scope: !257, file: !10, line: 12, column: 9)
!340 = !DILocation(line: 12, column: 40, scope: !339)
!341 = !DILocation(line: 12, column: 24, scope: !339)
!342 = !DILocation(line: 682, column: 23, scope: !343, inlinedAt: !253)
!343 = distinct !DILexicalBlock(scope: !251, file: !156, line: 681, column: 2)
!344 = !DILocation(line: 682, column: 3, scope: !343, inlinedAt: !253)
!345 = !DILocation(line: 682, column: 23, scope: !346, inlinedAt: !301)
!346 = distinct !DILexicalBlock(scope: !299, file: !156, line: 681, column: 2)
!347 = !DILocation(line: 682, column: 3, scope: !346, inlinedAt: !301)
!348 = !DILocation(line: 27, column: 22, scope: !306)
!349 = !DILocation(line: 27, column: 9, scope: !306)
!350 = !DILocation(line: 682, column: 23, scope: !351, inlinedAt: !301)
!351 = distinct !DILexicalBlock(scope: !299, file: !156, line: 681, column: 2)
!352 = !DILocation(line: 682, column: 3, scope: !351, inlinedAt: !301)
!353 = !DILocation(line: 12, column: 13, scope: !354)
!354 = distinct !DILexicalBlock(scope: !257, file: !10, line: 12, column: 9)
!355 = !DILocation(line: 12, column: 40, scope: !354)
!356 = !DILocation(line: 12, column: 24, scope: !354)
!357 = !DILocation(line: 682, column: 23, scope: !358, inlinedAt: !253)
!358 = distinct !DILexicalBlock(scope: !251, file: !156, line: 681, column: 2)
!359 = !DILocation(line: 682, column: 3, scope: !358, inlinedAt: !253)
!360 = !DILocation(line: 682, column: 23, scope: !361, inlinedAt: !301)
!361 = distinct !DILexicalBlock(scope: !299, file: !156, line: 681, column: 2)
!362 = !DILocation(line: 682, column: 3, scope: !361, inlinedAt: !301)
!363 = !DILocalVariable(name: "state", scope: !364, file: !10, line: 679, type: !157, align: 64)
!364 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !156, file: !156, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!365 = !DILocation(line: 679, column: 12, scope: !364, inlinedAt: !366)
!366 = !DILocation(line: 9, column: 2, scope: !367, inlinedAt: !369)
!367 = distinct !DISubprogram(name: "native_rmdir", linkageName: "native_rmdir", scope: !368, file: !368, line: 7, scopeLine: 7, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!368 = !DIFile(filename: "rmdir.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io/os")
!369 = !DILocation(line: 34, column: 3, scope: !257)
!370 = !DILocation(line: 679, column: 41, scope: !364, inlinedAt: !366)
!371 = !DILocation(line: 679, column: 20, scope: !364, inlinedAt: !366)
!372 = !DILocation(line: 13, column: 22, scope: !373, inlinedAt: !369)
!373 = distinct !DILexicalBlock(scope: !367, file: !368, line: 10, column: 2)
!374 = !DILocation(line: 13, column: 8, scope: !373, inlinedAt: !369)
!375 = !DILocation(line: 13, column: 60, scope: !373, inlinedAt: !369)
!376 = !DILocation(line: 682, column: 23, scope: !377, inlinedAt: !366)
!377 = distinct !DILexicalBlock(scope: !364, file: !156, line: 681, column: 2)
!378 = !DILocation(line: 682, column: 3, scope: !377, inlinedAt: !366)
!379 = !DILocation(line: 14, column: 12, scope: !380, inlinedAt: !369)
!380 = distinct !DILexicalBlock(scope: !373, file: !368, line: 14, column: 4)
!381 = !DILocation(line: 16, column: 31, scope: !382, inlinedAt: !369)
!382 = distinct !DILexicalBlock(scope: !380, file: !368, line: 16, column: 24)
!383 = !DILocation(line: 682, column: 23, scope: !384, inlinedAt: !366)
!384 = distinct !DILexicalBlock(scope: !364, file: !156, line: 681, column: 2)
!385 = !DILocation(line: 682, column: 3, scope: !384, inlinedAt: !366)
!386 = !DILocation(line: 20, column: 32, scope: !387, inlinedAt: !369)
!387 = distinct !DILexicalBlock(scope: !380, file: !368, line: 20, column: 25)
!388 = !DILocation(line: 682, column: 23, scope: !389, inlinedAt: !366)
!389 = distinct !DILexicalBlock(scope: !364, file: !156, line: 681, column: 2)
!390 = !DILocation(line: 682, column: 3, scope: !389, inlinedAt: !366)
!391 = !DILocation(line: 21, column: 38, scope: !392, inlinedAt: !369)
!392 = distinct !DILexicalBlock(scope: !380, file: !368, line: 21, column: 31)
!393 = !DILocation(line: 682, column: 23, scope: !394, inlinedAt: !366)
!394 = distinct !DILexicalBlock(scope: !364, file: !156, line: 681, column: 2)
!395 = !DILocation(line: 682, column: 3, scope: !394, inlinedAt: !366)
!396 = !DILocation(line: 23, column: 32, scope: !397, inlinedAt: !369)
!397 = distinct !DILexicalBlock(scope: !380, file: !368, line: 23, column: 25)
!398 = !DILocation(line: 682, column: 23, scope: !399, inlinedAt: !366)
!399 = distinct !DILexicalBlock(scope: !364, file: !156, line: 681, column: 2)
!400 = !DILocation(line: 682, column: 3, scope: !399, inlinedAt: !366)
!401 = !DILocation(line: 24, column: 35, scope: !402, inlinedAt: !369)
!402 = distinct !DILexicalBlock(scope: !380, file: !368, line: 24, column: 28)
!403 = !DILocation(line: 682, column: 23, scope: !404, inlinedAt: !366)
!404 = distinct !DILexicalBlock(scope: !364, file: !156, line: 681, column: 2)
!405 = !DILocation(line: 682, column: 3, scope: !404, inlinedAt: !366)
!406 = !DILocation(line: 25, column: 31, scope: !407, inlinedAt: !369)
!407 = distinct !DILexicalBlock(scope: !380, file: !368, line: 25, column: 24)
!408 = !DILocation(line: 682, column: 23, scope: !409, inlinedAt: !366)
!409 = distinct !DILexicalBlock(scope: !364, file: !156, line: 681, column: 2)
!410 = !DILocation(line: 682, column: 3, scope: !409, inlinedAt: !366)
!411 = !DILocation(line: 26, column: 21, scope: !412, inlinedAt: !369)
!412 = distinct !DILexicalBlock(scope: !380, file: !368, line: 26, column: 14)
!413 = !DILocation(line: 682, column: 23, scope: !414, inlinedAt: !366)
!414 = distinct !DILexicalBlock(scope: !364, file: !156, line: 681, column: 2)
!415 = !DILocation(line: 682, column: 3, scope: !414, inlinedAt: !366)
!416 = !DILocation(line: 12, column: 13, scope: !417)
!417 = distinct !DILexicalBlock(scope: !257, file: !10, line: 12, column: 9)
!418 = !DILocation(line: 12, column: 40, scope: !417)
!419 = !DILocation(line: 12, column: 24, scope: !417)
!420 = !DILocation(line: 682, column: 23, scope: !421, inlinedAt: !253)
!421 = distinct !DILexicalBlock(scope: !251, file: !156, line: 681, column: 2)
!422 = !DILocation(line: 682, column: 3, scope: !421, inlinedAt: !253)
!423 = !DILocation(line: 12, column: 13, scope: !424)
!424 = distinct !DILexicalBlock(scope: !257, file: !10, line: 12, column: 9)
!425 = !DILocation(line: 12, column: 40, scope: !424)
!426 = !DILocation(line: 12, column: 24, scope: !424)
!427 = !DILocation(line: 682, column: 23, scope: !428, inlinedAt: !253)
!428 = distinct !DILexicalBlock(scope: !251, file: !156, line: 681, column: 2)
!429 = !DILocation(line: 682, column: 3, scope: !428, inlinedAt: !253)
!430 = distinct !DISubprogram(name: "native_fopen", linkageName: "std.io.os.native_fopen", scope: !36, file: !36, line: 8, type: !431, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!431 = !DISubroutineType(types: !432)
!432 = !{!28, !14, !14}
!433 = !DILocalVariable(name: "filename", arg: 1, scope: !430, file: !36, line: 8, type: !14)
!434 = !DILocation(line: 8, column: 31, scope: !430)
!435 = !DILocalVariable(name: "mode", arg: 2, scope: !430, file: !36, line: 8, type: !14)
!436 = !DILocation(line: 8, column: 48, scope: !430)
!437 = !DILocation(line: 5, column: 11, scope: !438)
!438 = distinct !DILexicalBlock(scope: !430, file: !36, line: 8, column: 65)
!439 = !DILocation(line: 6, column: 11, scope: !438)
!440 = !DILocalVariable(name: "buffer", scope: !441, file: !36, line: 610, type: !442, align: 8)
!441 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !156, file: !156, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2048, align: 8, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 256, lowerBound: 0)
!445 = !DILocation(line: 610, column: 14, scope: !441, inlinedAt: !446)
!446 = !DILocation(line: 8, column: 65, scope: !430)
!447 = !DILocalVariable(name: "allocator", scope: !441, file: !36, line: 611, type: !448, align: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !36, file: !36, line: 12, size: 384, align: 64, elements: !449, identifier: "std.core.mem.allocator.OnStackAllocator")
!449 = !{!450, !451, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !448, file: !36, line: 14, baseType: !25, size: 128, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !448, file: !36, line: 15, baseType: !15, size: 128, align: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !448, file: !36, line: 16, baseType: !21, size: 64, align: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !448, file: !36, line: 17, baseType: !454, size: 64, align: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64, dwarfAddressSpace: 0)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !36, file: !36, line: 20, size: 192, align: 64, elements: !456, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.7818")
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !455, file: !36, line: 22, baseType: !57, size: 8, align: 8)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !455, file: !36, line: 23, baseType: !454, size: 64, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !455, file: !36, line: 24, baseType: !28, size: 64, align: 64, offset: 128)
!460 = !DILocation(line: 611, column: 19, scope: !441, inlinedAt: !446)
!461 = !DILocation(line: 612, column: 18, scope: !441, inlinedAt: !446)
!462 = !DILocation(line: 612, column: 26, scope: !441, inlinedAt: !446)
!463 = !DILocation(line: 612, column: 2, scope: !441, inlinedAt: !446)
!464 = !DILocalVariable(name: "smem", scope: !430, file: !36, line: 8, type: !25, align: 64)
!465 = !DILocation(line: 8, column: 91, scope: !430)
!466 = !DILocation(line: 614, column: 8, scope: !467, inlinedAt: !446)
!467 = distinct !DILexicalBlock(scope: !441, file: !156, line: 614, column: 2)
!468 = !DILocalVariable(name: "file", scope: !469, file: !36, line: 13, type: !28, align: 64)
!469 = distinct !DILexicalBlock(scope: !430, file: !36, line: 9, column: 1)
!470 = !DILocation(line: 13, column: 9, scope: !469)
!471 = !DILocation(line: 13, column: 47, scope: !469)
!472 = !DILocation(line: 13, column: 28, scope: !469)
!473 = !DILocation(line: 13, column: 69, scope: !469)
!474 = !DILocation(line: 13, column: 54, scope: !469)
!475 = !DILocation(line: 13, column: 16, scope: !469)
!476 = !DILocation(line: 15, column: 9, scope: !469)
!477 = !DILocation(line: 86, column: 10, scope: !478, inlinedAt: !480)
!478 = distinct !DILexicalBlock(scope: !479, file: !36, line: 86, column: 2)
!479 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !36, file: !36, line: 84, scopeLine: 84, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!480 = !DILocation(line: 15, column: 17, scope: !469)
!481 = !DILocation(line: 88, column: 30, scope: !482, inlinedAt: !480)
!482 = distinct !DILexicalBlock(scope: !478, file: !36, line: 88, column: 23)
!483 = !DILocation(line: 89, column: 30, scope: !484, inlinedAt: !480)
!484 = distinct !DILexicalBlock(scope: !478, file: !36, line: 89, column: 23)
!485 = !DILocation(line: 90, column: 29, scope: !486, inlinedAt: !480)
!486 = distinct !DILexicalBlock(scope: !478, file: !36, line: 90, column: 22)
!487 = !DILocation(line: 91, column: 30, scope: !488, inlinedAt: !480)
!488 = distinct !DILexicalBlock(scope: !478, file: !36, line: 91, column: 23)
!489 = !DILocation(line: 92, column: 29, scope: !490, inlinedAt: !480)
!490 = distinct !DILexicalBlock(scope: !478, file: !36, line: 92, column: 22)
!491 = !DILocation(line: 93, column: 30, scope: !492, inlinedAt: !480)
!492 = distinct !DILexicalBlock(scope: !478, file: !36, line: 93, column: 23)
!493 = !DILocation(line: 94, column: 30, scope: !494, inlinedAt: !480)
!494 = distinct !DILexicalBlock(scope: !478, file: !36, line: 94, column: 23)
!495 = !DILocation(line: 95, column: 29, scope: !496, inlinedAt: !480)
!496 = distinct !DILexicalBlock(scope: !478, file: !36, line: 95, column: 22)
!497 = !DILocation(line: 96, column: 30, scope: !498, inlinedAt: !480)
!498 = distinct !DILexicalBlock(scope: !478, file: !36, line: 96, column: 23)
!499 = !DILocation(line: 97, column: 36, scope: !500, inlinedAt: !480)
!500 = distinct !DILexicalBlock(scope: !478, file: !36, line: 97, column: 29)
!501 = !DILocation(line: 98, column: 30, scope: !502, inlinedAt: !480)
!502 = distinct !DILexicalBlock(scope: !478, file: !36, line: 98, column: 23)
!503 = !DILocation(line: 99, column: 31, scope: !504, inlinedAt: !480)
!504 = distinct !DILexicalBlock(scope: !478, file: !36, line: 99, column: 24)
!505 = !DILocation(line: 100, column: 30, scope: !506, inlinedAt: !480)
!506 = distinct !DILexicalBlock(scope: !478, file: !36, line: 100, column: 23)
!507 = !DILocation(line: 101, column: 30, scope: !508, inlinedAt: !480)
!508 = distinct !DILexicalBlock(scope: !478, file: !36, line: 101, column: 23)
!509 = !DILocation(line: 102, column: 29, scope: !510, inlinedAt: !480)
!510 = distinct !DILexicalBlock(scope: !478, file: !36, line: 102, column: 22)
!511 = !DILocation(line: 103, column: 33, scope: !512, inlinedAt: !480)
!512 = distinct !DILexicalBlock(scope: !478, file: !36, line: 103, column: 26)
!513 = !DILocation(line: 104, column: 29, scope: !514, inlinedAt: !480)
!514 = distinct !DILexicalBlock(scope: !478, file: !36, line: 104, column: 22)
!515 = !DILocation(line: 105, column: 34, scope: !516, inlinedAt: !480)
!516 = distinct !DILexicalBlock(scope: !478, file: !36, line: 105, column: 27)
!517 = !DILocation(line: 106, column: 27, scope: !518, inlinedAt: !480)
!518 = distinct !DILexicalBlock(scope: !478, file: !36, line: 106, column: 20)
!519 = !DILocation(line: 107, column: 35, scope: !520, inlinedAt: !480)
!520 = distinct !DILexicalBlock(scope: !478, file: !36, line: 107, column: 28)
!521 = !DILocation(line: 108, column: 19, scope: !522, inlinedAt: !480)
!522 = distinct !DILexicalBlock(scope: !478, file: !36, line: 108, column: 12)
!523 = !DILocation(line: 613, column: 8, scope: !524, inlinedAt: !446)
!524 = distinct !DILexicalBlock(scope: !441, file: !156, line: 613, column: 8)
!525 = !DILocation(line: 613, column: 8, scope: !526, inlinedAt: !446)
!526 = distinct !DILexicalBlock(scope: !441, file: !156, line: 613, column: 8)
!527 = distinct !DISubprogram(name: "native_remove", linkageName: "std.io.os.native_remove", scope: !36, file: !36, line: 18, type: !528, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !14}
!530 = !DILocalVariable(name: "filename", arg: 1, scope: !527, file: !36, line: 18, type: !14)
!531 = !DILocation(line: 18, column: 31, scope: !527)
!532 = !DILocalVariable(name: "buffer", scope: !533, file: !36, line: 610, type: !442, align: 8)
!533 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !156, file: !156, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!534 = !DILocation(line: 610, column: 14, scope: !533, inlinedAt: !535)
!535 = !DILocation(line: 18, column: 44, scope: !527)
!536 = !DILocalVariable(name: "allocator", scope: !533, file: !36, line: 611, type: !448, align: 64)
!537 = !DILocation(line: 611, column: 19, scope: !533, inlinedAt: !535)
!538 = !DILocation(line: 612, column: 18, scope: !533, inlinedAt: !535)
!539 = !DILocation(line: 612, column: 26, scope: !533, inlinedAt: !535)
!540 = !DILocation(line: 612, column: 2, scope: !533, inlinedAt: !535)
!541 = !DILocalVariable(name: "smem", scope: !527, file: !36, line: 18, type: !25, align: 64)
!542 = !DILocation(line: 18, column: 70, scope: !527)
!543 = !DILocation(line: 614, column: 8, scope: !544, inlinedAt: !535)
!544 = distinct !DILexicalBlock(scope: !533, file: !156, line: 614, column: 2)
!545 = !DILocalVariable(name: "result", scope: !546, file: !36, line: 23, type: !547, align: 32)
!546 = distinct !DILexicalBlock(scope: !527, file: !36, line: 19, column: 1)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !36, file: !36, line: 23, baseType: !31, align: 32)
!548 = !DILocation(line: 23, column: 8, scope: !546)
!549 = !DILocation(line: 23, column: 49, scope: !546)
!550 = !DILocation(line: 23, column: 30, scope: !546)
!551 = !DILocation(line: 23, column: 17, scope: !546)
!552 = !DILocation(line: 25, column: 6, scope: !546)
!553 = !DILocation(line: 27, column: 11, scope: !554)
!554 = distinct !DILexicalBlock(scope: !555, file: !36, line: 27, column: 3)
!555 = distinct !DILexicalBlock(scope: !546, file: !36, line: 26, column: 2)
!556 = !DILocation(line: 613, column: 8, scope: !557, inlinedAt: !535)
!557 = distinct !DILexicalBlock(scope: !533, file: !156, line: 613, column: 8)
!558 = !DILocation(line: 613, column: 8, scope: !559, inlinedAt: !535)
!559 = distinct !DILexicalBlock(scope: !533, file: !156, line: 613, column: 8)
!560 = !DILocation(line: 613, column: 8, scope: !561, inlinedAt: !535)
!561 = distinct !DILexicalBlock(scope: !533, file: !156, line: 613, column: 8)
!562 = distinct !DISubprogram(name: "native_freopen", linkageName: "std.io.os.native_freopen", scope: !36, file: !36, line: 42, type: !563, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!563 = !DISubroutineType(types: !564)
!564 = !{!28, !28, !14, !14}
!565 = !DILocalVariable(name: "file", arg: 1, scope: !562, file: !36, line: 42, type: !28)
!566 = !DILocation(line: 42, column: 32, scope: !562)
!567 = !DILocalVariable(name: "filename", arg: 2, scope: !562, file: !36, line: 42, type: !14)
!568 = !DILocation(line: 42, column: 45, scope: !562)
!569 = !DILocalVariable(name: "mode", arg: 3, scope: !562, file: !36, line: 42, type: !14)
!570 = !DILocation(line: 42, column: 62, scope: !562)
!571 = !DILocation(line: 39, column: 11, scope: !572)
!572 = distinct !DILexicalBlock(scope: !562, file: !36, line: 42, column: 80)
!573 = !DILocation(line: 40, column: 11, scope: !572)
!574 = !DILocalVariable(name: "buffer", scope: !575, file: !36, line: 610, type: !442, align: 8)
!575 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !156, file: !156, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!576 = !DILocation(line: 610, column: 14, scope: !575, inlinedAt: !577)
!577 = !DILocation(line: 42, column: 80, scope: !562)
!578 = !DILocalVariable(name: "allocator", scope: !575, file: !36, line: 611, type: !448, align: 64)
!579 = !DILocation(line: 611, column: 19, scope: !575, inlinedAt: !577)
!580 = !DILocation(line: 612, column: 18, scope: !575, inlinedAt: !577)
!581 = !DILocation(line: 612, column: 26, scope: !575, inlinedAt: !577)
!582 = !DILocation(line: 612, column: 2, scope: !575, inlinedAt: !577)
!583 = !DILocalVariable(name: "smem", scope: !562, file: !36, line: 42, type: !25, align: 64)
!584 = !DILocation(line: 42, column: 106, scope: !562)
!585 = !DILocation(line: 614, column: 8, scope: !586, inlinedAt: !577)
!586 = distinct !DILexicalBlock(scope: !575, file: !156, line: 614, column: 2)
!587 = !DILocation(line: 47, column: 43, scope: !588)
!588 = distinct !DILexicalBlock(scope: !562, file: !36, line: 43, column: 1)
!589 = !DILocation(line: 47, column: 24, scope: !588)
!590 = !DILocation(line: 47, column: 65, scope: !588)
!591 = !DILocation(line: 47, column: 50, scope: !588)
!592 = !DILocation(line: 47, column: 72, scope: !588)
!593 = !DILocation(line: 47, column: 10, scope: !588)
!594 = !DILocation(line: 49, column: 10, scope: !588)
!595 = !DILocation(line: 86, column: 10, scope: !596, inlinedAt: !598)
!596 = distinct !DILexicalBlock(scope: !597, file: !36, line: 86, column: 2)
!597 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !36, file: !36, line: 84, scopeLine: 84, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!598 = !DILocation(line: 49, column: 18, scope: !588)
!599 = !DILocation(line: 88, column: 30, scope: !600, inlinedAt: !598)
!600 = distinct !DILexicalBlock(scope: !596, file: !36, line: 88, column: 23)
!601 = !DILocation(line: 89, column: 30, scope: !602, inlinedAt: !598)
!602 = distinct !DILexicalBlock(scope: !596, file: !36, line: 89, column: 23)
!603 = !DILocation(line: 90, column: 29, scope: !604, inlinedAt: !598)
!604 = distinct !DILexicalBlock(scope: !596, file: !36, line: 90, column: 22)
!605 = !DILocation(line: 91, column: 30, scope: !606, inlinedAt: !598)
!606 = distinct !DILexicalBlock(scope: !596, file: !36, line: 91, column: 23)
!607 = !DILocation(line: 92, column: 29, scope: !608, inlinedAt: !598)
!608 = distinct !DILexicalBlock(scope: !596, file: !36, line: 92, column: 22)
!609 = !DILocation(line: 93, column: 30, scope: !610, inlinedAt: !598)
!610 = distinct !DILexicalBlock(scope: !596, file: !36, line: 93, column: 23)
!611 = !DILocation(line: 94, column: 30, scope: !612, inlinedAt: !598)
!612 = distinct !DILexicalBlock(scope: !596, file: !36, line: 94, column: 23)
!613 = !DILocation(line: 95, column: 29, scope: !614, inlinedAt: !598)
!614 = distinct !DILexicalBlock(scope: !596, file: !36, line: 95, column: 22)
!615 = !DILocation(line: 96, column: 30, scope: !616, inlinedAt: !598)
!616 = distinct !DILexicalBlock(scope: !596, file: !36, line: 96, column: 23)
!617 = !DILocation(line: 97, column: 36, scope: !618, inlinedAt: !598)
!618 = distinct !DILexicalBlock(scope: !596, file: !36, line: 97, column: 29)
!619 = !DILocation(line: 98, column: 30, scope: !620, inlinedAt: !598)
!620 = distinct !DILexicalBlock(scope: !596, file: !36, line: 98, column: 23)
!621 = !DILocation(line: 99, column: 31, scope: !622, inlinedAt: !598)
!622 = distinct !DILexicalBlock(scope: !596, file: !36, line: 99, column: 24)
!623 = !DILocation(line: 100, column: 30, scope: !624, inlinedAt: !598)
!624 = distinct !DILexicalBlock(scope: !596, file: !36, line: 100, column: 23)
!625 = !DILocation(line: 101, column: 30, scope: !626, inlinedAt: !598)
!626 = distinct !DILexicalBlock(scope: !596, file: !36, line: 101, column: 23)
!627 = !DILocation(line: 102, column: 29, scope: !628, inlinedAt: !598)
!628 = distinct !DILexicalBlock(scope: !596, file: !36, line: 102, column: 22)
!629 = !DILocation(line: 103, column: 33, scope: !630, inlinedAt: !598)
!630 = distinct !DILexicalBlock(scope: !596, file: !36, line: 103, column: 26)
!631 = !DILocation(line: 104, column: 29, scope: !632, inlinedAt: !598)
!632 = distinct !DILexicalBlock(scope: !596, file: !36, line: 104, column: 22)
!633 = !DILocation(line: 105, column: 34, scope: !634, inlinedAt: !598)
!634 = distinct !DILexicalBlock(scope: !596, file: !36, line: 105, column: 27)
!635 = !DILocation(line: 106, column: 27, scope: !636, inlinedAt: !598)
!636 = distinct !DILexicalBlock(scope: !596, file: !36, line: 106, column: 20)
!637 = !DILocation(line: 107, column: 35, scope: !638, inlinedAt: !598)
!638 = distinct !DILexicalBlock(scope: !596, file: !36, line: 107, column: 28)
!639 = !DILocation(line: 108, column: 19, scope: !640, inlinedAt: !598)
!640 = distinct !DILexicalBlock(scope: !596, file: !36, line: 108, column: 12)
!641 = !DILocation(line: 613, column: 8, scope: !642, inlinedAt: !577)
!642 = distinct !DILexicalBlock(scope: !575, file: !156, line: 613, column: 8)
!643 = !DILocation(line: 613, column: 8, scope: !644, inlinedAt: !577)
!644 = distinct !DILexicalBlock(scope: !575, file: !156, line: 613, column: 8)
!645 = distinct !DISubprogram(name: "native_fseek", linkageName: "std.io.os.native_fseek", scope: !36, file: !36, line: 52, type: !646, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !28, !84, !35}
!648 = !DILocalVariable(name: "file", arg: 1, scope: !645, file: !36, line: 52, type: !28)
!649 = !DILocation(line: 52, column: 29, scope: !645)
!650 = !DILocalVariable(name: "offset", arg: 2, scope: !645, file: !36, line: 52, type: !84)
!651 = !DILocation(line: 52, column: 40, scope: !645)
!652 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !645, file: !36, line: 52, type: !35)
!653 = !DILocation(line: 52, column: 59, scope: !645)
!654 = !DILocation(line: 54, column: 43, scope: !645)
!655 = !DILocation(line: 54, column: 6, scope: !645)
!656 = !DILocation(line: 114, column: 10, scope: !657, inlinedAt: !659)
!657 = distinct !DILexicalBlock(scope: !658, file: !36, line: 114, column: 2)
!658 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !36, file: !36, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!659 = !DILocation(line: 54, column: 70, scope: !645)
!660 = !DILocation(line: 116, column: 30, scope: !661, inlinedAt: !659)
!661 = distinct !DILexicalBlock(scope: !657, file: !36, line: 116, column: 23)
!662 = !DILocation(line: 117, column: 29, scope: !663, inlinedAt: !659)
!663 = distinct !DILexicalBlock(scope: !657, file: !36, line: 117, column: 22)
!664 = !DILocation(line: 118, column: 33, scope: !665, inlinedAt: !659)
!665 = distinct !DILexicalBlock(scope: !657, file: !36, line: 118, column: 26)
!666 = !DILocation(line: 119, column: 29, scope: !667, inlinedAt: !659)
!667 = distinct !DILexicalBlock(scope: !657, file: !36, line: 119, column: 22)
!668 = !DILocation(line: 120, column: 30, scope: !669, inlinedAt: !659)
!669 = distinct !DILexicalBlock(scope: !657, file: !36, line: 120, column: 23)
!670 = !DILocation(line: 121, column: 27, scope: !671, inlinedAt: !659)
!671 = distinct !DILexicalBlock(scope: !657, file: !36, line: 121, column: 20)
!672 = !DILocation(line: 122, column: 30, scope: !673, inlinedAt: !659)
!673 = distinct !DILexicalBlock(scope: !657, file: !36, line: 122, column: 23)
!674 = !DILocation(line: 123, column: 29, scope: !675, inlinedAt: !659)
!675 = distinct !DILexicalBlock(scope: !657, file: !36, line: 123, column: 22)
!676 = !DILocation(line: 124, column: 29, scope: !677, inlinedAt: !659)
!677 = distinct !DILexicalBlock(scope: !657, file: !36, line: 124, column: 22)
!678 = !DILocation(line: 125, column: 29, scope: !679, inlinedAt: !659)
!679 = distinct !DILexicalBlock(scope: !657, file: !36, line: 125, column: 22)
!680 = !DILocation(line: 126, column: 30, scope: !681, inlinedAt: !659)
!681 = distinct !DILexicalBlock(scope: !657, file: !36, line: 126, column: 23)
!682 = !DILocation(line: 127, column: 19, scope: !683, inlinedAt: !659)
!683 = distinct !DILexicalBlock(scope: !657, file: !36, line: 127, column: 12)
!684 = distinct !DISubprogram(name: "native_ftell", linkageName: "std.io.os.native_ftell", scope: !36, file: !36, line: 58, type: !685, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!685 = !DISubroutineType(types: !686)
!686 = !{!84, !28}
!687 = !DILocalVariable(name: "file", arg: 1, scope: !684, file: !36, line: 58, type: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !36, file: !36, line: 362, baseType: !28, align: 64)
!689 = !DILocation(line: 58, column: 29, scope: !684)
!690 = !DILocalVariable(name: "index", scope: !684, file: !36, line: 60, type: !84, align: 64)
!691 = !DILocation(line: 60, column: 7, scope: !684)
!692 = !DILocation(line: 60, column: 27, scope: !684)
!693 = !DILocation(line: 60, column: 15, scope: !684)
!694 = !DILocation(line: 61, column: 9, scope: !684)
!695 = !DILocation(line: 61, column: 22, scope: !684)
!696 = !DILocation(line: 114, column: 10, scope: !697, inlinedAt: !699)
!697 = distinct !DILexicalBlock(scope: !698, file: !36, line: 114, column: 2)
!698 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !36, file: !36, line: 112, scopeLine: 112, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!699 = !DILocation(line: 61, column: 30, scope: !684)
!700 = !DILocation(line: 116, column: 30, scope: !701, inlinedAt: !699)
!701 = distinct !DILexicalBlock(scope: !697, file: !36, line: 116, column: 23)
!702 = !DILocation(line: 117, column: 29, scope: !703, inlinedAt: !699)
!703 = distinct !DILexicalBlock(scope: !697, file: !36, line: 117, column: 22)
!704 = !DILocation(line: 118, column: 33, scope: !705, inlinedAt: !699)
!705 = distinct !DILexicalBlock(scope: !697, file: !36, line: 118, column: 26)
!706 = !DILocation(line: 119, column: 29, scope: !707, inlinedAt: !699)
!707 = distinct !DILexicalBlock(scope: !697, file: !36, line: 119, column: 22)
!708 = !DILocation(line: 120, column: 30, scope: !709, inlinedAt: !699)
!709 = distinct !DILexicalBlock(scope: !697, file: !36, line: 120, column: 23)
!710 = !DILocation(line: 121, column: 27, scope: !711, inlinedAt: !699)
!711 = distinct !DILexicalBlock(scope: !697, file: !36, line: 121, column: 20)
!712 = !DILocation(line: 122, column: 30, scope: !713, inlinedAt: !699)
!713 = distinct !DILexicalBlock(scope: !697, file: !36, line: 122, column: 23)
!714 = !DILocation(line: 123, column: 29, scope: !715, inlinedAt: !699)
!715 = distinct !DILexicalBlock(scope: !697, file: !36, line: 123, column: 22)
!716 = !DILocation(line: 124, column: 29, scope: !717, inlinedAt: !699)
!717 = distinct !DILexicalBlock(scope: !697, file: !36, line: 124, column: 22)
!718 = !DILocation(line: 125, column: 29, scope: !719, inlinedAt: !699)
!719 = distinct !DILexicalBlock(scope: !697, file: !36, line: 125, column: 22)
!720 = !DILocation(line: 126, column: 30, scope: !721, inlinedAt: !699)
!721 = distinct !DILexicalBlock(scope: !697, file: !36, line: 126, column: 23)
!722 = !DILocation(line: 127, column: 19, scope: !723, inlinedAt: !699)
!723 = distinct !DILexicalBlock(scope: !697, file: !36, line: 127, column: 12)
!724 = distinct !DISubprogram(name: "native_fwrite", linkageName: "std.io.os.native_fwrite", scope: !36, file: !36, line: 64, type: !725, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!725 = !DISubroutineType(types: !726)
!726 = !{!22, !28, !15}
!727 = !DILocalVariable(name: "file", arg: 1, scope: !724, file: !36, line: 64, type: !688)
!728 = !DILocation(line: 64, column: 29, scope: !724)
!729 = !DILocalVariable(name: "buffer", arg: 2, scope: !724, file: !36, line: 64, type: !15)
!730 = !DILocation(line: 64, column: 42, scope: !724)
!731 = !DILocation(line: 66, column: 22, scope: !724)
!732 = !DILocation(line: 66, column: 37, scope: !724)
!733 = !DILocation(line: 66, column: 49, scope: !724)
!734 = !DILocation(line: 66, column: 9, scope: !724)
!735 = distinct !DISubprogram(name: "native_fputc", linkageName: "std.io.os.native_fputc", scope: !36, file: !36, line: 69, type: !736, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !31, !28}
!738 = !DILocalVariable(name: "c", arg: 1, scope: !735, file: !36, line: 69, type: !547)
!739 = !DILocation(line: 69, column: 28, scope: !735)
!740 = !DILocalVariable(name: "stream", arg: 2, scope: !735, file: !36, line: 69, type: !688)
!741 = !DILocation(line: 69, column: 37, scope: !735)
!742 = !DILocation(line: 71, column: 21, scope: !735)
!743 = !DILocation(line: 71, column: 6, scope: !735)
!744 = !DILocation(line: 71, column: 50, scope: !735)
!745 = distinct !DISubprogram(name: "native_fread", linkageName: "std.io.os.native_fread", scope: !36, file: !36, line: 74, type: !725, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!746 = !DILocalVariable(name: "file", arg: 1, scope: !745, file: !36, line: 74, type: !688)
!747 = !DILocation(line: 74, column: 28, scope: !745)
!748 = !DILocalVariable(name: "buffer", arg: 2, scope: !745, file: !36, line: 74, type: !15)
!749 = !DILocation(line: 74, column: 41, scope: !745)
!750 = !DILocation(line: 76, column: 21, scope: !745)
!751 = !DILocation(line: 76, column: 36, scope: !745)
!752 = !DILocation(line: 76, column: 48, scope: !745)
!753 = !DILocation(line: 76, column: 9, scope: !745)
!754 = distinct !DISubprogram(name: "native_fflush", linkageName: "std.io.os.native_fflush", scope: !36, file: !36, line: 79, type: !755, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !28}
!757 = !DILocalVariable(name: "file", arg: 1, scope: !754, file: !36, line: 79, type: !688)
!758 = !DILocation(line: 79, column: 30, scope: !754)
!759 = !DILocation(line: 81, column: 19, scope: !754)
!760 = !DILocation(line: 81, column: 6, scope: !754)
!761 = !DILocation(line: 81, column: 38, scope: !754)
!762 = distinct !DISubprogram(name: "native_set_modified_time", linkageName: "std.io.os.native_set_modified_time", scope: !36, file: !36, line: 141, type: !763, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !14, !84}
!765 = !DILocalVariable(name: "filename", arg: 1, scope: !762, file: !36, line: 141, type: !14)
!766 = !DILocation(line: 141, column: 42, scope: !762)
!767 = !DILocalVariable(name: "time", arg: 2, scope: !762, file: !36, line: 141, type: !83)
!768 = !DILocation(line: 141, column: 65, scope: !762)
!769 = !DILocalVariable(name: "buffer", scope: !770, file: !36, line: 610, type: !442, align: 8)
!770 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !156, file: !156, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!771 = !DILocation(line: 610, column: 14, scope: !770, inlinedAt: !772)
!772 = !DILocation(line: 141, column: 74, scope: !762)
!773 = !DILocalVariable(name: "allocator", scope: !770, file: !36, line: 611, type: !448, align: 64)
!774 = !DILocation(line: 611, column: 19, scope: !770, inlinedAt: !772)
!775 = !DILocation(line: 612, column: 18, scope: !770, inlinedAt: !772)
!776 = !DILocation(line: 612, column: 26, scope: !770, inlinedAt: !772)
!777 = !DILocation(line: 612, column: 2, scope: !770, inlinedAt: !772)
!778 = !DILocalVariable(name: "smem", scope: !762, file: !36, line: 141, type: !25, align: 64)
!779 = !DILocation(line: 141, column: 100, scope: !762)
!780 = !DILocation(line: 614, column: 8, scope: !781, inlinedAt: !772)
!781 = distinct !DILexicalBlock(scope: !770, file: !156, line: 614, column: 2)
!782 = !DILocalVariable(name: "times", scope: !783, file: !36, line: 143, type: !784, align: 64)
!783 = distinct !DILexicalBlock(scope: !762, file: !36, line: 142, column: 1)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utimbuf", scope: !36, file: !36, line: 132, size: 128, align: 64, elements: !785, identifier: "std.io.os.Utimbuf")
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "actime", scope: !784, file: !36, line: 134, baseType: !83, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "modtime", scope: !784, file: !36, line: 135, baseType: !83, size: 64, align: 64, offset: 64)
!788 = !DILocation(line: 143, column: 10, scope: !783)
!789 = !DILocation(line: 143, column: 20, scope: !783)
!790 = !DILocation(line: 143, column: 26, scope: !783)
!791 = !DILocation(line: 147, column: 32, scope: !783)
!792 = !DILocation(line: 147, column: 13, scope: !783)
!793 = !DILocation(line: 147, column: 7, scope: !783)
!794 = !DILocation(line: 613, column: 8, scope: !795, inlinedAt: !772)
!795 = distinct !DILexicalBlock(scope: !770, file: !156, line: 613, column: 8)
!796 = !DILocation(line: 613, column: 8, scope: !797, inlinedAt: !772)
!797 = distinct !DILexicalBlock(scope: !770, file: !156, line: 613, column: 8)
!798 = distinct !DISubprogram(name: "native_ls", linkageName: "std.io.os.native_ls", scope: !799, file: !799, line: 4, type: !800, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !58)
!799 = !DIFile(filename: "ls.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io/os")
!800 = !DISubroutineType(types: !801)
!801 = !{!802, !11, !57, !57, !14, !25}
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{PathImp}", scope: !799, file: !799, line: 18, size: 320, align: 64, elements: !803, identifier: "std.collections.list.List$std.io.path.PathImp$")
!803 = !{!804, !805, !806, !807}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !802, file: !799, line: 20, baseType: !21, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !802, file: !799, line: 21, baseType: !21, size: 64, align: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !802, file: !799, line: 22, baseType: !25, size: 128, align: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !802, file: !799, line: 23, baseType: !808, size: 64, align: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!809 = !DILocalVariable(name: "dir", arg: 1, scope: !798, file: !799, line: 4, type: !246)
!810 = !DILocation(line: 4, column: 29, scope: !798)
!811 = !DILocalVariable(name: "no_dirs", arg: 2, scope: !798, file: !799, line: 4, type: !57)
!812 = !DILocation(line: 4, column: 39, scope: !798)
!813 = !DILocalVariable(name: "no_symlinks", arg: 3, scope: !798, file: !799, line: 4, type: !57)
!814 = !DILocation(line: 4, column: 53, scope: !798)
!815 = !DILocalVariable(name: "mask", arg: 4, scope: !798, file: !799, line: 4, type: !14)
!816 = !DILocation(line: 4, column: 73, scope: !798)
!817 = !DILocalVariable(name: "allocator", arg: 5, scope: !798, file: !799, line: 4, type: !25)
!818 = !DILocation(line: 4, column: 89, scope: !798)
!819 = !DILocalVariable(name: "list", scope: !798, file: !799, line: 6, type: !820, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathList", scope: !799, file: !799, line: 10, baseType: !802, align: 64)
!821 = !DILocation(line: 6, column: 11, scope: !798)
!822 = !DILocation(line: 30, column: 71, scope: !823, inlinedAt: !825)
!823 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !824, file: !824, line: 30, scopeLine: 30, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!824 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!825 = !DILocation(line: 7, column: 2, scope: !798)
!826 = !DILocalVariable(name: "directory", scope: !798, file: !799, line: 8, type: !258, align: 64)
!827 = !DILocation(line: 8, column: 9, scope: !798)
!828 = !DILocalVariable(name: "state", scope: !829, file: !799, line: 679, type: !157, align: 64)
!829 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !156, file: !156, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !58)
!830 = !DILocation(line: 679, column: 12, scope: !829, inlinedAt: !831)
!831 = !DILocation(line: 9, column: 2, scope: !798)
!832 = !DILocation(line: 679, column: 41, scope: !829, inlinedAt: !831)
!833 = !DILocation(line: 679, column: 20, scope: !829, inlinedAt: !831)
!834 = !DILocation(line: 11, column: 30, scope: !835)
!835 = distinct !DILexicalBlock(scope: !798, file: !799, line: 10, column: 2)
!836 = !DILocation(line: 11, column: 47, scope: !835)
!837 = !DILocation(line: 11, column: 77, scope: !835)
!838 = !DILocation(line: 11, column: 15, scope: !835)
!839 = !DILocation(line: 682, column: 23, scope: !840, inlinedAt: !831)
!840 = distinct !DILexicalBlock(scope: !829, file: !156, line: 681, column: 2)
!841 = !DILocation(line: 682, column: 3, scope: !840, inlinedAt: !831)
!842 = !DILocation(line: 14, column: 6, scope: !798)
!843 = !DILocation(line: 14, column: 26, scope: !798)
!844 = !DILocation(line: 14, column: 68, scope: !798)
!845 = !DILocation(line: 13, column: 12, scope: !846)
!846 = distinct !DILexicalBlock(scope: !798, file: !799, line: 13, column: 8)
!847 = !DILocation(line: 13, column: 39, scope: !846)
!848 = !DILocation(line: 13, column: 23, scope: !846)
!849 = !DILocalVariable(name: "entry", scope: !798, file: !799, line: 15, type: !281, align: 64)
!850 = !DILocation(line: 15, column: 16, scope: !798)
!851 = !DILocation(line: 16, column: 2, scope: !798)
!852 = !DILocation(line: 16, column: 33, scope: !853)
!853 = distinct !DILexicalBlock(scope: !798, file: !799, line: 16, column: 2)
!854 = !DILocation(line: 16, column: 18, scope: !853)
!855 = !DILocalVariable(name: "name", scope: !856, file: !799, line: 18, type: !14, align: 64)
!856 = distinct !DILexicalBlock(scope: !853, file: !799, line: 17, column: 2)
!857 = !DILocation(line: 18, column: 10, scope: !856)
!858 = !DILocation(line: 18, column: 28, scope: !856)
