; ModuleID = 'std::math::matrix'
source_filename = "std::math::matrix"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%"Matrix2x2{float}" = type { %.anon }
%.anon = type { %.anon.0 }
%.anon.0 = type { float, float, float, float }
%"Matrix3x3{float}" = type { %.anon.1 }
%.anon.1 = type { %.anon.2 }
%.anon.2 = type { float, float, float, float, float, float, float, float, float }
%"Matrix4x4{float}" = type { %.anon.3 }
%.anon.3 = type { %.anon.4 }
%.anon.4 = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float }
%"Matrix2x2{double}" = type { %.anon.5 }
%.anon.5 = type { %.anon.6 }
%.anon.6 = type { double, double, double, double }
%"Matrix3x3{double}" = type { %.anon.7 }
%.anon.7 = type { %.anon.8 }
%.anon.8 = type { double, double, double, double, double, double, double, double, double }
%"Matrix4x4{double}" = type { %.anon.9 }
%.anon.9 = type { %.anon.10 }
%.anon.10 = type { double, double, double, double, double, double, double, double, double, double, double, double, double, double, double, double }

@"$ct.std.math.matrix.Matrix2x2.$anon.$anon$float$" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 16, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "IDENTITY2{float}", linkageName: "std.math.matrix.IDENTITY2$float$", scope: !2, file: !2, line: 458, type: !3, isLocal: false, isDefinition: true, align: 32)
!2 = !DIFile(filename: "matrix.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix2x2{float}", scope: !2, file: !2, line: 34, size: 128, align: 32, elements: !4, identifier: "std.math.matrix.Matrix2x2$float$")
!4 = !{!5}
!5 = !DIDerivedType(tag: DW_TAG_member, scope: !3, file: !2, line: 36, baseType: !6, size: 128, align: 32)
!6 = !DICompositeType(tag: DW_TAG_union_type, scope: !3, file: !2, line: 36, size: 128, align: 32, elements: !7)
!7 = !{!8, !16}
!8 = !DIDerivedType(tag: DW_TAG_member, scope: !6, file: !2, line: 38, baseType: !9, size: 128, align: 32)
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix2x2.$anon.$anon", scope: !6, file: !2, line: 38, size: 128, align: 32, elements: !10)
!10 = !{!11, !13, !14, !15}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !9, file: !2, line: 40, baseType: !12, size: 32, align: 32)
!12 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !9, file: !2, line: 40, baseType: !12, size: 32, align: 32, offset: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !9, file: !2, line: 41, baseType: !12, size: 32, align: 32, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !9, file: !2, line: 41, baseType: !12, size: 32, align: 32, offset: 96)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !6, file: !2, line: 43, baseType: !17, size: 128, align: 32)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, align: 32, elements: !18)
!18 = !{!19}
!19 = !DISubrange(count: 4, lowerBound: 0)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "IDENTITY3{float}", linkageName: "std.math.matrix.IDENTITY3$float$", scope: !2, file: !2, line: 459, type: !22, isLocal: false, isDefinition: true, align: 32)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix3x3{float}", scope: !2, file: !2, line: 47, size: 288, align: 32, elements: !23, identifier: "std.math.matrix.Matrix3x3$float$")
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_member, scope: !22, file: !2, line: 49, baseType: !25, size: 288, align: 32)
!25 = !DICompositeType(tag: DW_TAG_union_type, scope: !22, file: !2, line: 49, size: 288, align: 32, elements: !26)
!26 = !{!27, !39}
!27 = !DIDerivedType(tag: DW_TAG_member, scope: !25, file: !2, line: 51, baseType: !28, size: 288, align: 32)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix3x3.$anon.$anon", scope: !25, file: !2, line: 51, size: 288, align: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !28, file: !2, line: 53, baseType: !12, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !28, file: !2, line: 53, baseType: !12, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !28, file: !2, line: 53, baseType: !12, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !28, file: !2, line: 54, baseType: !12, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !28, file: !2, line: 54, baseType: !12, size: 32, align: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !28, file: !2, line: 54, baseType: !12, size: 32, align: 32, offset: 160)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !28, file: !2, line: 55, baseType: !12, size: 32, align: 32, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !28, file: !2, line: 55, baseType: !12, size: 32, align: 32, offset: 224)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !28, file: !2, line: 55, baseType: !12, size: 32, align: 32, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !25, file: !2, line: 57, baseType: !40, size: 288, align: 32)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 288, align: 32, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 9, lowerBound: 0)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "IDENTITY4{float}", linkageName: "std.math.matrix.IDENTITY4$float$", scope: !2, file: !2, line: 460, type: !45, isLocal: false, isDefinition: true, align: 32)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4{float}", scope: !2, file: !2, line: 61, size: 512, align: 32, elements: !46, identifier: "std.math.matrix.Matrix4x4$float$")
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, scope: !45, file: !2, line: 63, baseType: !48, size: 512, align: 32)
!48 = !DICompositeType(tag: DW_TAG_union_type, scope: !45, file: !2, line: 63, size: 512, align: 32, elements: !49)
!49 = !{!50, !69}
!50 = !DIDerivedType(tag: DW_TAG_member, scope: !48, file: !2, line: 65, baseType: !51, size: 512, align: 32)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4.$anon.$anon", scope: !48, file: !2, line: 65, size: 512, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !51, file: !2, line: 67, baseType: !12, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !51, file: !2, line: 67, baseType: !12, size: 32, align: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !51, file: !2, line: 67, baseType: !12, size: 32, align: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !51, file: !2, line: 67, baseType: !12, size: 32, align: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !51, file: !2, line: 68, baseType: !12, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !51, file: !2, line: 68, baseType: !12, size: 32, align: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !51, file: !2, line: 68, baseType: !12, size: 32, align: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !51, file: !2, line: 68, baseType: !12, size: 32, align: 32, offset: 224)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !51, file: !2, line: 69, baseType: !12, size: 32, align: 32, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !51, file: !2, line: 69, baseType: !12, size: 32, align: 32, offset: 288)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !51, file: !2, line: 69, baseType: !12, size: 32, align: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !51, file: !2, line: 69, baseType: !12, size: 32, align: 32, offset: 352)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !51, file: !2, line: 70, baseType: !12, size: 32, align: 32, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !51, file: !2, line: 70, baseType: !12, size: 32, align: 32, offset: 416)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !51, file: !2, line: 70, baseType: !12, size: 32, align: 32, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !51, file: !2, line: 70, baseType: !12, size: 32, align: 32, offset: 480)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !48, file: !2, line: 72, baseType: !70, size: 512, align: 32)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 512, align: 32, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 16, lowerBound: 0)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "IDENTITY2{double}", linkageName: "std.math.matrix.IDENTITY2$double$", scope: !2, file: !2, line: 458, type: !75, isLocal: false, isDefinition: true, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix2x2{double}", scope: !2, file: !2, line: 34, size: 256, align: 64, elements: !76, identifier: "std.math.matrix.Matrix2x2$double$")
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, scope: !75, file: !2, line: 36, baseType: !78, size: 256, align: 64)
!78 = !DICompositeType(tag: DW_TAG_union_type, scope: !75, file: !2, line: 36, size: 256, align: 64, elements: !79)
!79 = !{!80, !88}
!80 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !2, line: 38, baseType: !81, size: 256, align: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix2x2.$anon.$anon", scope: !78, file: !2, line: 38, size: 256, align: 64, elements: !82)
!82 = !{!83, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !81, file: !2, line: 40, baseType: !84, size: 64, align: 64)
!84 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !81, file: !2, line: 40, baseType: !84, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !81, file: !2, line: 41, baseType: !84, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !81, file: !2, line: 41, baseType: !84, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !78, file: !2, line: 43, baseType: !89, size: 256, align: 64)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, align: 64, elements: !18)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "IDENTITY3{double}", linkageName: "std.math.matrix.IDENTITY3$double$", scope: !2, file: !2, line: 459, type: !92, isLocal: false, isDefinition: true, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix3x3{double}", scope: !2, file: !2, line: 47, size: 576, align: 64, elements: !93, identifier: "std.math.matrix.Matrix3x3$double$")
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, scope: !92, file: !2, line: 49, baseType: !95, size: 576, align: 64)
!95 = !DICompositeType(tag: DW_TAG_union_type, scope: !92, file: !2, line: 49, size: 576, align: 64, elements: !96)
!96 = !{!97, !109}
!97 = !DIDerivedType(tag: DW_TAG_member, scope: !95, file: !2, line: 51, baseType: !98, size: 576, align: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix3x3.$anon.$anon", scope: !95, file: !2, line: 51, size: 576, align: 64, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !98, file: !2, line: 53, baseType: !84, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !98, file: !2, line: 53, baseType: !84, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !98, file: !2, line: 53, baseType: !84, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !98, file: !2, line: 54, baseType: !84, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !98, file: !2, line: 54, baseType: !84, size: 64, align: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !98, file: !2, line: 54, baseType: !84, size: 64, align: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !98, file: !2, line: 55, baseType: !84, size: 64, align: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !98, file: !2, line: 55, baseType: !84, size: 64, align: 64, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !98, file: !2, line: 55, baseType: !84, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !95, file: !2, line: 57, baseType: !110, size: 576, align: 64)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 576, align: 64, elements: !41)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "IDENTITY4{double}", linkageName: "std.math.matrix.IDENTITY4$double$", scope: !2, file: !2, line: 460, type: !113, isLocal: false, isDefinition: true, align: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4{double}", scope: !2, file: !2, line: 61, size: 1024, align: 64, elements: !114, identifier: "std.math.matrix.Matrix4x4$double$")
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, scope: !113, file: !2, line: 63, baseType: !116, size: 1024, align: 64)
!116 = !DICompositeType(tag: DW_TAG_union_type, scope: !113, file: !2, line: 63, size: 1024, align: 64, elements: !117)
!117 = !{!118, !137}
!118 = !DIDerivedType(tag: DW_TAG_member, scope: !116, file: !2, line: 65, baseType: !119, size: 1024, align: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4.$anon.$anon", scope: !116, file: !2, line: 65, size: 1024, align: 64, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !119, file: !2, line: 67, baseType: !84, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !119, file: !2, line: 67, baseType: !84, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !119, file: !2, line: 67, baseType: !84, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !119, file: !2, line: 67, baseType: !84, size: 64, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !119, file: !2, line: 68, baseType: !84, size: 64, align: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !119, file: !2, line: 68, baseType: !84, size: 64, align: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !119, file: !2, line: 68, baseType: !84, size: 64, align: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !119, file: !2, line: 68, baseType: !84, size: 64, align: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !119, file: !2, line: 69, baseType: !84, size: 64, align: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !119, file: !2, line: 69, baseType: !84, size: 64, align: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !119, file: !2, line: 69, baseType: !84, size: 64, align: 64, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !119, file: !2, line: 69, baseType: !84, size: 64, align: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !119, file: !2, line: 70, baseType: !84, size: 64, align: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !119, file: !2, line: 70, baseType: !84, size: 64, align: 64, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !119, file: !2, line: 70, baseType: !84, size: 64, align: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !119, file: !2, line: 70, baseType: !84, size: 64, align: 64, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !116, file: !2, line: 72, baseType: !138, size: 1024, align: 64)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1024, align: 64, elements: !71)
!139 = !{i32 2, !"Dwarf Version", i32 4}
!140 = !{i32 2, !"Debug Info Version", i32 3}
!141 = !{i32 2, !"wchar_size", i32 4}
!142 = !{i32 4, !"PIC Level", i32 2}
!143 = !{i32 1, !"uwtable", i32 1}
!144 = !{i32 2, !"frame-pointer", i32 1}
!145 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !146, splitDebugInlining: false)
!146 = !{!0, !20, !43, !73, !90, !111}
!147 = distinct !DISubprogram(name: "apply", linkageName: "std.math.matrix.Matrix2x2$float$.apply", scope: !2, file: !2, line: 76, type: !148, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !145, retainedNodes: !154)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !153, !150}
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 32, flags: DIFlagVector, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 2, lowerBound: 0)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !{}
!155 = !DILocation(line: 77, column: 1, scope: !147)
!156 = !DILocalVariable(name: "self", arg: 1, scope: !147, file: !2, line: 76, type: !153)
!157 = !DILocation(line: 76, column: 30, scope: !147)
!158 = !DILocalVariable(name: "vec", arg: 2, scope: !147, file: !2, line: 76, type: !150)
!159 = !DILocation(line: 76, column: 47, scope: !147)
!160 = !DILocation(line: 79, column: 3, scope: !147)
!161 = !DILocation(line: 79, column: 14, scope: !147)
!162 = !DILocation(line: 79, column: 18, scope: !147)
!163 = !DILocation(line: 79, column: 23, scope: !147)
!164 = !DILocation(line: 79, column: 34, scope: !147)
!165 = !DILocation(line: 79, column: 38, scope: !147)
!166 = !DILocation(line: 80, column: 3, scope: !147)
!167 = !DILocation(line: 80, column: 14, scope: !147)
!168 = !DILocation(line: 80, column: 18, scope: !147)
!169 = !DILocation(line: 80, column: 23, scope: !147)
!170 = !DILocation(line: 80, column: 34, scope: !147)
!171 = !DILocation(line: 80, column: 38, scope: !147)
!172 = distinct !DISubprogram(name: "apply", linkageName: "std.math.matrix.Matrix3x3$float$.apply", scope: !2, file: !2, line: 84, type: !173, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !145, retainedNodes: !154)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !178, !175}
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, align: 32, flags: DIFlagVector, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 3, lowerBound: 0)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DILocation(line: 85, column: 1, scope: !172)
!180 = !DILocalVariable(name: "self", arg: 1, scope: !172, file: !2, line: 84, type: !178)
!181 = !DILocation(line: 84, column: 30, scope: !172)
!182 = !DILocalVariable(name: "vec", arg: 2, scope: !172, file: !2, line: 84, type: !175)
!183 = !DILocation(line: 84, column: 47, scope: !172)
!184 = !DILocation(line: 87, column: 3, scope: !172)
!185 = !DILocation(line: 87, column: 14, scope: !172)
!186 = !DILocation(line: 87, column: 18, scope: !172)
!187 = !DILocation(line: 87, column: 23, scope: !172)
!188 = !DILocation(line: 87, column: 34, scope: !172)
!189 = !DILocation(line: 87, column: 38, scope: !172)
!190 = !DILocation(line: 87, column: 43, scope: !172)
!191 = !DILocation(line: 87, column: 54, scope: !172)
!192 = !DILocation(line: 87, column: 58, scope: !172)
!193 = !DILocation(line: 88, column: 3, scope: !172)
!194 = !DILocation(line: 88, column: 14, scope: !172)
!195 = !DILocation(line: 88, column: 18, scope: !172)
