; ModuleID = 'std::hash::md5'
source_filename = "std::hash::md5"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Md5 = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }

@"$ct.std.hash.md5.Md5" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 152, i64 0, i64 8, [0 x i64] zeroinitializer }, align 8
@std.hash.md5.BLOCK_BYTES = weak local_unnamed_addr constant i32 64, align 4, !dbg !0
@std.hash.md5.HASH_BYTES = weak local_unnamed_addr constant i32 16, align 4, !dbg !4
@.panic_msg = internal constant [63 x i8] c"Reference parameter 'self' was passed a null pointer argument.\00", align 1
@.file = internal constant [7 x i8] c"md5.c3\00", align 1
@.func = internal constant [5 x i8] c"init\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@.panic_msg.2 = internal constant [62 x i8] c"Reference parameter 'ctx' was passed a null pointer argument.\00", align 1
@.func.3 = internal constant [7 x i8] c"update\00", align 1
@"$ct.ulong" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 8, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@.panic_msg.4 = internal constant [62 x i8] c"Index exceeds array length (array had size %d, index was %d).\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BLOCK_BYTES", linkageName: "std.hash.md5.BLOCK_BYTES", scope: !2, file: !2, line: 5, type: !3, isLocal: false, isDefinition: true, align: 32)
!2 = !DIFile(filename: "md5.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/hash")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "HASH_BYTES", linkageName: "std.hash.md5.HASH_BYTES", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true, align: 32)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "MD5_T", linkageName: "std.hash.md5.MD5_T", scope: !2, file: !2, line: 102, type: !8, isLocal: true, isDefinition: true, align: 32)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, align: 32, elements: !10)
!9 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!10 = !{!11}
!11 = !DISubrange(count: 64, lowerBound: 0)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "MD5_S", linkageName: "std.hash.md5.MD5_S", scope: !2, file: !2, line: 121, type: !14, isLocal: true, isDefinition: true, align: 32)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 512, align: 32, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 16, lowerBound: 0)
!17 = !{i32 2, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{i32 2, !"wchar_size", i32 4}
!20 = !{i32 4, !"PIC Level", i32 2}
!21 = !{i32 1, !"uwtable", i32 1}
!22 = !{i32 2, !"frame-pointer", i32 1}
!23 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !24, splitDebugInlining: false)
!24 = !{!0, !4, !6, !12}
!25 = distinct !DISubprogram(name: "init", linkageName: "std.hash.md5.Md5.init", scope: !2, file: !2, line: 28, type: !26, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !23, retainedNodes: !42)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64, dwarfAddressSpace: 0)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Md5", scope: !2, file: !2, line: 8, size: 1216, align: 32, elements: !30, identifier: "std.hash.md5.Md5")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !40}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !29, file: !2, line: 10, baseType: !9, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !29, file: !2, line: 10, baseType: !9, size: 32, align: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !29, file: !2, line: 11, baseType: !9, size: 32, align: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !29, file: !2, line: 11, baseType: !9, size: 32, align: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !29, file: !2, line: 11, baseType: !9, size: 32, align: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !29, file: !2, line: 11, baseType: !9, size: 32, align: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !29, file: !2, line: 12, baseType: !38, size: 512, align: 8, offset: 192)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 512, align: 8, elements: !10)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !29, file: !2, line: 13, baseType: !41, size: 512, align: 32, offset: 704)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 512, align: 32, elements: !15)
!42 = !{}
!43 = !DILocation(line: 29, column: 1, scope: !25)
!44 = !DILocalVariable(name: "self", arg: 1, scope: !25, file: !2, line: 28, type: !28)
!45 = !DILocation(line: 28, column: 18, scope: !25)
!46 = !DILocation(line: 30, column: 2, scope: !25)
!47 = !DILocation(line: 31, column: 2, scope: !25)
!48 = !DILocation(line: 32, column: 2, scope: !25)
!49 = !DILocation(line: 33, column: 2, scope: !25)
!50 = !DILocation(line: 35, column: 2, scope: !25)
!51 = !DILocation(line: 36, column: 2, scope: !25)
!52 = distinct !DISubprogram(name: "update", linkageName: "std.hash.md5.Md5.update", scope: !2, file: !2, line: 40, type: !53, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !23, retainedNodes: !42)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !28, !55}
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !56, identifier: "char[]")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !55, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !61)
!61 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!62 = !DILocation(line: 41, column: 1, scope: !52)
!63 = !DILocalVariable(name: "ctx", arg: 1, scope: !52, file: !2, line: 40, type: !28)
!64 = !DILocation(line: 40, column: 20, scope: !52)
!65 = !DILocalVariable(name: "data", arg: 2, scope: !52, file: !2, line: 40, type: !55)
!66 = !DILocation(line: 40, column: 33, scope: !52)
!67 = !DILocalVariable(name: "saved_lo", scope: !52, file: !2, line: 42, type: !9, align: 32)
!68 = !DILocation(line: 42, column: 7, scope: !52)
!69 = !DILocation(line: 42, column: 18, scope: !52)
!70 = !DILocation(line: 43, column: 17, scope: !52)
!71 = !DILocation(line: 43, column: 28, scope: !52)
!72 = !DILocation(line: 43, column: 16, scope: !52)
!73 = !DILocation(line: 43, column: 7, scope: !52)
!74 = !DILocation(line: 43, column: 54, scope: !52)
!75 = !DILocation(line: 43, column: 6, scope: !52)
!76 = !DILocation(line: 43, column: 64, scope: !52)
!77 = !DILocation(line: 44, column: 2, scope: !52)
!78 = !DILocation(line: 44, column: 12, scope: !52)
!79 = !DILocalVariable(name: "used", scope: !52, file: !2, line: 46, type: !60, align: 64)
!80 = !DILocation(line: 46, column: 6, scope: !52)
!81 = !DILocation(line: 46, column: 13, scope: !52)
!82 = !DILocation(line: 48, column: 6, scope: !52)
!83 = !DILocalVariable(name: "available", scope: !84, file: !2, line: 50, type: !60, align: 64)
!84 = distinct !DILexicalBlock(scope: !52, file: !2, line: 49, column: 2)
!85 = !DILocation(line: 50, column: 7, scope: !84)
!86 = !DILocation(line: 50, column: 24, scope: !84)
!87 = !DILocation(line: 50, column: 19, scope: !84)
!88 = !DILocation(line: 52, column: 7, scope: !84)
!89 = !DILocation(line: 52, column: 18, scope: !84)
!90 = !DILocation(line: 54, column: 32, scope: !91)
!91 = distinct !DILexicalBlock(scope: !84, file: !2, line: 53, column: 3)
!92 = !DILocation(line: 54, column: 37, scope: !91)
!93 = !DILocation(line: 54, column: 4, scope: !91)
!94 = !DILocation(line: 54, column: 15, scope: !91)
!95 = !DILocation(line: 54, column: 20, scope: !91)
!96 = !DILocation(line: 55, column: 10, scope: !91)
!97 = !DILocation(line: 57, column: 32, scope: !84)
!98 = !DILocation(line: 57, column: 37, scope: !84)
!99 = !DILocation(line: 57, column: 38, scope: !84)
!100 = !DILocation(line: 57, column: 3, scope: !84)
!101 = !DILocation(line: 57, column: 14, scope: !84)
!102 = !DILocation(line: 57, column: 19, scope: !84)
!103 = !DILocation(line: 58, column: 10, scope: !84)
!104 = !DILocation(line: 58, column: 15, scope: !84)
!105 = !DILocation(line: 59, column: 14, scope: !84)
!106 = !DILocation(line: 59, column: 26, scope: !84)
!107 = !DILocation(line: 59, column: 3, scope: !84)
!108 = !DILocation(line: 62, column: 6, scope: !52)
!109 = !DILocation(line: 64, column: 26, scope: !110)
!110 = distinct !DILexicalBlock(scope: !52, file: !2, line: 63, column: 2)
!111 = !DILocation(line: 64, column: 10, scope: !110)
!112 = !DILocation(line: 64, column: 50, scope: !110)
!113 = !DILocation(line: 66, column: 26, scope: !52)
!114 = !DILocation(line: 66, column: 31, scope: !52)
!115 = !DILocation(line: 66, column: 2, scope: !52)
!116 = !DILocation(line: 66, column: 14, scope: !52)
!117 = distinct !DISubprogram(name: "final", linkageName: "std.hash.md5.Md5.final", scope: !2, file: !2, line: 69, type: !118, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !23, retainedNodes: !42)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !28}
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, align: 8, elements: !15)
!121 = !DILocation(line: 70, column: 1, scope: !117)
!122 = !DILocalVariable(name: "ctx", arg: 1, scope: !117, file: !2, line: 69, type: !28)
!123 = !DILocation(line: 69, column: 31, scope: !117)
