; ModuleID = 'std::compression::zip'
source_filename = "std::compression::zip"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%ZipCDH = type <{ i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i16, i16, i16, i32, i32 }>
%"any[]" = type { ptr, i64 }
%Zip64EOCD = type <{ i32, i64, i16, i16, i32, i32, i64, i64, i64, i64 }>
%Zip64Locator = type <{ i32, i32, i64, i32 }>
%ZipEOCD = type <{ i32, i16, i16, i16, i16, i32, i32, i16 }>
%ZipEntry = type { %"char[]", i64, i64, i8, i8, i32, i64, i16, i16, i16 }
%PathImp = type { %"char[]", i32, %any }
%ZipEntryReader = type { i64, i64, i16, ptr, %ArchiveStreamAdapter, ptr }
%ArchiveStreamAdapter = type { ptr, i64, i64, i64 }
%File = type { ptr }
%Crc32 = type { i32 }
%ZipEntryWriter = type { ptr, %ZipEntry, %Crc32, %ZipLFH, i64, %"char[]", i64 }
%ZipLFH = type <{ i32, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16 }>
%ZipArchive = type { ptr, %any, %"List{ZipEntry}", %"char[]", %"char[]", %"char[]" }
%"List{ZipEntry}" = type { i64, i64, %any, ptr }
%ByteReader = type { %"char[]", i64 }

@"$ct.std.compression.zip.ZipEntry" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 56, i64 0, i64 10, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ZIP_LFH_SIG", linkageName: "std.compression.zip.ZIP_LFH_SIG", scope: !2, file: !2, line: 1053, type: !3, isLocal: true, isDefinition: true, align: 32)
!2 = !DIFile(filename: "zip.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/compression")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "ZIP_CDH_SIG", linkageName: "std.compression.zip.ZIP_CDH_SIG", scope: !2, file: !2, line: 1054, type: !3, isLocal: true, isDefinition: true, align: 32)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "ZIP_EOCD_SIG", linkageName: "std.compression.zip.ZIP_EOCD_SIG", scope: !2, file: !2, line: 1055, type: !3, isLocal: true, isDefinition: true, align: 32)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "ZIP64_EOCD_SIG", linkageName: "std.compression.zip.ZIP64_EOCD_SIG", scope: !2, file: !2, line: 1056, type: !3, isLocal: true, isDefinition: true, align: 32)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "ZIP64_LOCATOR_SIG", linkageName: "std.compression.zip.ZIP64_LOCATOR_SIG", scope: !2, file: !2, line: 1057, type: !3, isLocal: true, isDefinition: true, align: 32)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "ZIP64_EXTRA_ID", linkageName: "std.compression.zip.ZIP64_EXTRA_ID", scope: !2, file: !2, line: 1059, type: !14, isLocal: true, isDefinition: true, align: 16)
!14 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!15 = !{i32 2, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 2, !"wchar_size", i32 4}
!18 = !{i32 4, !"PIC Level", i32 2}
!19 = !{i32 1, !"uwtable", i32 1}
!20 = !{i32 2, !"frame-pointer", i32 1}
!21 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, globals: !147, splitDebugInlining: false)
!22 = !{!23, !47, !53, !129, !134}
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ZipMethod", scope: !24, file: !2, line: 55, baseType: !14, size: 16, align: 16, elements: !46)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "ZipEntry", scope: !2, file: !2, line: 27, size: 448, align: 64, elements: !25, identifier: "std.compression.zip.ZipEntry")
!25 = !{!26, !36, !37, !38, !40, !41, !42, !43, !44, !45}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !24, file: !2, line: 29, baseType: !27, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !29, identifier: "char[]")
!29 = !{!30, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !28, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !28, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !35)
!35 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !24, file: !2, line: 30, baseType: !35, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !24, file: !2, line: 31, baseType: !35, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "is_directory", scope: !24, file: !2, line: 32, baseType: !39, size: 8, align: 8, offset: 256)
!39 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "is_encrypted", scope: !24, file: !2, line: 33, baseType: !39, size: 8, align: 8, offset: 264)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !24, file: !2, line: 34, baseType: !3, size: 32, align: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !24, file: !2, line: 35, baseType: !35, size: 64, align: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !24, file: !2, line: 36, baseType: !23, size: 16, align: 16, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "last_mod_time", scope: !24, file: !2, line: 37, baseType: !14, size: 16, align: 16, offset: 400)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "last_mod_date", scope: !24, file: !2, line: 38, baseType: !14, size: 16, align: 16, offset: 416)
!46 = !{}
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SeekOrigin", scope: !2, file: !2, line: 14, baseType: !48, size: 32, align: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52}
!50 = !DIEnumerator(name: "FROM_START", value: 0)
!51 = !DIEnumerator(name: "FROM_CURSOR", value: 1)
!52 = !DIEnumerator(name: "FROM_END", value: 2)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InflaterState", scope: !54, file: !2, line: 498, baseType: !48, size: 32, align: 32, elements: !118)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inflater", scope: !2, file: !2, line: 20, size: 542784, align: 64, elements: !55, identifier: "std.compression.deflate.Inflater")
!55 = !{!56, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !92, !93, !94, !106, !107, !111, !115, !116, !117}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !54, file: !2, line: 22, baseType: !57, size: 576, align: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "StreamBitReader", scope: !54, file: !2, line: 487, size: 576, align: 64, elements: !58, identifier: "std.compression.deflate.StreamBitReader")
!58 = !{!59, !66, !67, !68, !69, !70, !71}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !57, file: !2, line: 489, baseType: !60, size: 128, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !61, identifier: "InStream")
!61 = !{!62, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !60, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !57, file: !2, line: 490, baseType: !28, size: 128, align: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "buf_pos", scope: !57, file: !2, line: 491, baseType: !34, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !57, file: !2, line: 492, baseType: !34, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !57, file: !2, line: 493, baseType: !35, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !57, file: !2, line: 494, baseType: !3, size: 32, align: 32, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "set_cursor_fn", scope: !57, file: !2, line: 495, baseType: !72, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "SetCursorFn", scope: !2, file: !2, line: 6, baseType: !73, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64, dwarfAddressSpace: 0)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !63, !76, !47}
!76 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !54, file: !2, line: 23, baseType: !53, size: 32, align: 32, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "hlit", scope: !54, file: !2, line: 24, baseType: !3, size: 32, align: 32, offset: 608)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "hdist", scope: !54, file: !2, line: 24, baseType: !3, size: 32, align: 32, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "hclen", scope: !54, file: !2, line: 24, baseType: !3, size: 32, align: 32, offset: 672)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_i", scope: !54, file: !2, line: 25, baseType: !3, size: 32, align: 32, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_num_lengths", scope: !54, file: !2, line: 26, baseType: !3, size: 32, align: 32, offset: 736)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stored_len", scope: !54, file: !2, line: 27, baseType: !3, size: 32, align: 32, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "match_len", scope: !54, file: !2, line: 28, baseType: !3, size: 32, align: 32, offset: 800)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "match_dist", scope: !54, file: !2, line: 29, baseType: !3, size: 32, align: 32, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !54, file: !2, line: 30, baseType: !39, size: 8, align: 8, offset: 864)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !54, file: !2, line: 31, baseType: !39, size: 8, align: 8, offset: 872)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !54, file: !2, line: 33, baseType: !89, size: 524288, align: 8, offset: 880)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 524288, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 65536, lowerBound: 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !54, file: !2, line: 34, baseType: !35, size: 64, align: 64, offset: 525184)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !54, file: !2, line: 35, baseType: !35, size: 64, align: 64, offset: 525248)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "lit_ptr", scope: !54, file: !2, line: 37, baseType: !95, size: 64, align: 64, offset: 525312)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64, dwarfAddressSpace: 0)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Huffman", scope: !2, file: !2, line: 627, size: 4864, align: 16, elements: !97, identifier: "std.compression.deflate.Huffman")
!97 = !{!98, !102}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !96, file: !2, line: 629, baseType: !99, size: 256, align: 16)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, align: 16, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 16, lowerBound: 0)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !96, file: !2, line: 630, baseType: !103, size: 4608, align: 16, offset: 256)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 4608, align: 16, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 288, lowerBound: 0)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dist_ptr", scope: !54, file: !2, line: 38, baseType: !95, size: 64, align: 64, offset: 525376)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "code_lengths", scope: !54, file: !2, line: 40, baseType: !108, size: 152, align: 8, offset: 525440)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 152, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 19, lowerBound: 0)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "lit_dist_lengths", scope: !54, file: !2, line: 41, baseType: !112, size: 2560, align: 8, offset: 525592)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2560, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 320, lowerBound: 0)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_lit", scope: !54, file: !2, line: 43, baseType: !96, size: 4864, align: 16, offset: 528160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_dist", scope: !54, file: !2, line: 44, baseType: !96, size: 4864, align: 16, offset: 533024)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_code_huff", scope: !54, file: !2, line: 45, baseType: !96, size: 4864, align: 16, offset: 537888)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!119 = !DIEnumerator(name: "START_BLOCK", value: 0)
!120 = !DIEnumerator(name: "READ_STORED_LEN", value: 1)
!121 = !DIEnumerator(name: "COPY_STORED", value: 2)
!122 = !DIEnumerator(name: "READ_DYN_COUNTS", value: 3)
!123 = !DIEnumerator(name: "READ_DYN_CODELENS", value: 4)
!124 = !DIEnumerator(name: "READ_DYN_TREES", value: 5)
!125 = !DIEnumerator(name: "DECODE_SYMBOL", value: 6)
!126 = !DIEnumerator(name: "READ_DIST_SYM", value: 7)
!127 = !DIEnumerator(name: "COPY_MATCH", value: 8)
!128 = !DIEnumerator(name: "DONE", value: 9)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !2, file: !2, line: 7, baseType: !48, size: 32, align: 32, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIEnumerator(name: "SET", value: 0)
!132 = !DIEnumerator(name: "CURSOR", value: 1)
!133 = !DIEnumerator(name: "END", value: 2)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !135, file: !2, line: 23, baseType: !48, size: 32, align: 32, elements: !144)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !2, file: !2, line: 16, size: 320, align: 64, elements: !136, identifier: "std.io.path.PathImp")
!136 = !{!137, !138, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !135, file: !2, line: 18, baseType: !27, size: 128, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !135, file: !2, line: 19, baseType: !134, size: 32, align: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !135, file: !2, line: 20, baseType: !140, size: 128, align: 64, offset: 192)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !141, identifier: "Allocator")
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !140, baseType: !63, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !140, baseType: !65, size: 64, align: 64, offset: 64)
!144 = !{!145, !146}
!145 = !DIEnumerator(name: "WIN32", value: 0)
!146 = !DIEnumerator(name: "POSIX", value: 1)
!147 = !{!0, !4, !6, !8, !10, !12}
!148 = distinct !DISubprogram(name: "time", linkageName: "std.compression.zip.ZipEntry.time", scope: !2, file: !2, line: 41, type: !149, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !21, retainedNodes: !46)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", scope: !2, file: !2, line: 4, baseType: !76, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DILocation(line: 41, column: 33, scope: !148)
!154 = !DILocalVariable(name: "self", arg: 1, scope: !148, file: !2, line: 41, type: !152)
!155 = !DILocation(line: 41, column: 23, scope: !148)
!156 = !DILocation(line: 41, column: 55, scope: !148)
!157 = !DILocation(line: 41, column: 75, scope: !148)
!158 = distinct !DISubprogram(name: "close", linkageName: "std.compression.zip.ZipArchive.close", scope: !2, file: !2, line: 364, type: !159, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !21, retainedNodes: !46)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64, dwarfAddressSpace: 0)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "ZipArchive", scope: !2, file: !2, line: 45, size: 896, align: 64, elements: !163, identifier: "std.compression.zip.ZipArchive")
!163 = !{!164, !170, !171, !179, !180, !181}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !162, file: !2, line: 47, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64, dwarfAddressSpace: 0)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !167, identifier: "std.io.File")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !166, file: !2, line: 6, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 362, baseType: !63, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !162, file: !2, line: 48, baseType: !140, size: 128, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !162, file: !2, line: 49, baseType: !172, size: 320, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZipEntryList", scope: !2, file: !2, line: 43, baseType: !173, align: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{ZipEntry}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !174, identifier: "std.collections.list.List$std.compression.zip.ZipEntry$")
!174 = !{!175, !176, !177, !178}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !173, file: !2, line: 20, baseType: !34, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !173, file: !2, line: 21, baseType: !34, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !173, file: !2, line: 22, baseType: !140, size: 128, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !173, file: !2, line: 23, baseType: !152, size: 64, align: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !162, file: !2, line: 50, baseType: !27, size: 128, align: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !162, file: !2, line: 51, baseType: !27, size: 128, align: 64, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !162, file: !2, line: 52, baseType: !27, size: 128, align: 64, offset: 768)
!182 = !DILocation(line: 365, column: 1, scope: !158)
!183 = !DILocalVariable(name: "self", arg: 1, scope: !158, file: !2, line: 364, type: !161)
!184 = !DILocation(line: 364, column: 27, scope: !158)
!185 = !DILocation(line: 380, column: 6, scope: !158)
!186 = !DILocation(line: 380, column: 28, scope: !158)
!187 = !DILocation(line: 382, column: 3, scope: !188)
!188 = distinct !DILexicalBlock(scope: !158, file: !2, line: 381, column: 2)
!189 = !DILocation(line: 247, column: 11, scope: !188)
!190 = !DILocation(line: 367, column: 9, scope: !191)
!191 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!192 = !DILocation(line: 367, column: 3, scope: !191)
!193 = !DILocation(line: 369, column: 21, scope: !194)
!194 = distinct !DILexicalBlock(scope: !191, file: !2, line: 369, column: 3)
!195 = !DILocalVariable(name: ".temp", scope: !194, file: !2, line: 369, type: !34, align: 64)
!196 = !DILocalVariable(name: "entry", scope: !197, file: !2, line: 369, type: !152, align: 64)
!197 = distinct !DILexicalBlock(scope: !194, file: !2, line: 370, column: 3)
!198 = !DILocation(line: 369, column: 13, scope: !197)
!199 = !DILocation(line: 369, column: 21, scope: !197)
!200 = !DILocation(line: 399, column: 19, scope: !197)
!201 = !DILocation(line: 371, column: 20, scope: !202)
!202 = distinct !DILexicalBlock(scope: !197, file: !2, line: 370, column: 3)
!203 = !DILocation(line: 371, column: 36, scope: !202)
!204 = !DILocation(line: 119, column: 6, scope: !205, inlinedAt: !207)
!205 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!206 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!207 = !DILocation(line: 371, column: 4, scope: !202)
!208 = !DILocation(line: 119, column: 18, scope: !205, inlinedAt: !207)
!209 = !DILocation(line: 123, column: 20, scope: !205, inlinedAt: !207)
!210 = !DILocation(line: 123, column: 2, scope: !205, inlinedAt: !207)
!211 = !DILocation(line: 373, column: 3, scope: !191)
!212 = !DILocation(line: 374, column: 19, scope: !191)
!213 = !DILocation(line: 374, column: 35, scope: !191)
!214 = !DILocation(line: 119, column: 6, scope: !215, inlinedAt: !216)
!215 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!216 = !DILocation(line: 374, column: 3, scope: !191)
!217 = !DILocation(line: 119, column: 18, scope: !215, inlinedAt: !216)
!218 = !DILocation(line: 123, column: 20, scope: !215, inlinedAt: !216)
!219 = !DILocation(line: 123, column: 2, scope: !215, inlinedAt: !216)
!220 = !DILocation(line: 375, column: 19, scope: !191)
!221 = !DILocation(line: 375, column: 35, scope: !191)
!222 = !DILocation(line: 119, column: 6, scope: !223, inlinedAt: !224)
!223 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!224 = !DILocation(line: 375, column: 3, scope: !191)
!225 = !DILocation(line: 119, column: 18, scope: !223, inlinedAt: !224)
!226 = !DILocation(line: 123, column: 20, scope: !223, inlinedAt: !224)
!227 = !DILocation(line: 123, column: 2, scope: !223, inlinedAt: !224)
!228 = !DILocation(line: 376, column: 7, scope: !191)
!229 = !DILocation(line: 376, column: 45, scope: !191)
!230 = !DILocation(line: 376, column: 61, scope: !191)
!231 = !DILocation(line: 119, column: 6, scope: !232, inlinedAt: !233)
!232 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!233 = !DILocation(line: 376, column: 29, scope: !191)
!234 = !DILocation(line: 119, column: 18, scope: !232, inlinedAt: !233)
!235 = !DILocation(line: 123, column: 20, scope: !232, inlinedAt: !233)
!236 = !DILocation(line: 123, column: 2, scope: !232, inlinedAt: !233)
!237 = !DILocation(line: 377, column: 7, scope: !191)
!238 = !DILocation(line: 377, column: 34, scope: !191)
!239 = !DILocation(line: 377, column: 50, scope: !191)
!240 = !DILocation(line: 119, column: 6, scope: !241, inlinedAt: !242)
!241 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!242 = !DILocation(line: 377, column: 18, scope: !191)
!243 = !DILocation(line: 119, column: 18, scope: !241, inlinedAt: !242)
!244 = !DILocation(line: 123, column: 20, scope: !241, inlinedAt: !242)
!245 = !DILocation(line: 123, column: 2, scope: !241, inlinedAt: !242)
!246 = !DILocalVariable(name: "cd_offset", scope: !188, file: !2, line: 383, type: !35, align: 64)
!247 = !DILocation(line: 383, column: 9, scope: !188)
!248 = !DILocation(line: 383, column: 21, scope: !188)
!249 = !DILocation(line: 84, column: 11, scope: !188)
!250 = !DILocation(line: 367, column: 9, scope: !251)
!251 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!252 = !DILocation(line: 367, column: 3, scope: !251)
!253 = !DILocation(line: 369, column: 21, scope: !254)
!254 = distinct !DILexicalBlock(scope: !251, file: !2, line: 369, column: 3)
!255 = !DILocalVariable(name: ".temp", scope: !254, file: !2, line: 369, type: !34, align: 64)
!256 = !DILocalVariable(name: "entry", scope: !257, file: !2, line: 369, type: !152, align: 64)
!257 = distinct !DILexicalBlock(scope: !254, file: !2, line: 370, column: 3)
!258 = !DILocation(line: 369, column: 13, scope: !257)
!259 = !DILocation(line: 369, column: 21, scope: !257)
!260 = !DILocation(line: 399, column: 19, scope: !257)
!261 = !DILocation(line: 371, column: 20, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !2, line: 370, column: 3)
!263 = !DILocation(line: 371, column: 36, scope: !262)
!264 = !DILocation(line: 119, column: 6, scope: !265, inlinedAt: !266)
!265 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!266 = !DILocation(line: 371, column: 4, scope: !262)
!267 = !DILocation(line: 119, column: 18, scope: !265, inlinedAt: !266)
!268 = !DILocation(line: 123, column: 20, scope: !265, inlinedAt: !266)
!269 = !DILocation(line: 123, column: 2, scope: !265, inlinedAt: !266)
!270 = !DILocation(line: 373, column: 3, scope: !251)
!271 = !DILocation(line: 374, column: 19, scope: !251)
!272 = !DILocation(line: 374, column: 35, scope: !251)
!273 = !DILocation(line: 119, column: 6, scope: !274, inlinedAt: !275)
!274 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!275 = !DILocation(line: 374, column: 3, scope: !251)
!276 = !DILocation(line: 119, column: 18, scope: !274, inlinedAt: !275)
!277 = !DILocation(line: 123, column: 20, scope: !274, inlinedAt: !275)
!278 = !DILocation(line: 123, column: 2, scope: !274, inlinedAt: !275)
!279 = !DILocation(line: 375, column: 19, scope: !251)
!280 = !DILocation(line: 375, column: 35, scope: !251)
!281 = !DILocation(line: 119, column: 6, scope: !282, inlinedAt: !283)
!282 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!283 = !DILocation(line: 375, column: 3, scope: !251)
!284 = !DILocation(line: 119, column: 18, scope: !282, inlinedAt: !283)
!285 = !DILocation(line: 123, column: 20, scope: !282, inlinedAt: !283)
!286 = !DILocation(line: 123, column: 2, scope: !282, inlinedAt: !283)
!287 = !DILocation(line: 376, column: 7, scope: !251)
!288 = !DILocation(line: 376, column: 45, scope: !251)
!289 = !DILocation(line: 376, column: 61, scope: !251)
!290 = !DILocation(line: 119, column: 6, scope: !291, inlinedAt: !292)
!291 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!292 = !DILocation(line: 376, column: 29, scope: !251)
!293 = !DILocation(line: 119, column: 18, scope: !291, inlinedAt: !292)
!294 = !DILocation(line: 123, column: 20, scope: !291, inlinedAt: !292)
!295 = !DILocation(line: 123, column: 2, scope: !291, inlinedAt: !292)
!296 = !DILocation(line: 377, column: 7, scope: !251)
!297 = !DILocation(line: 377, column: 34, scope: !251)
!298 = !DILocation(line: 377, column: 50, scope: !251)
!299 = !DILocation(line: 119, column: 6, scope: !300, inlinedAt: !301)
!300 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!301 = !DILocation(line: 377, column: 18, scope: !251)
!302 = !DILocation(line: 119, column: 18, scope: !300, inlinedAt: !301)
!303 = !DILocation(line: 123, column: 20, scope: !300, inlinedAt: !301)
!304 = !DILocation(line: 123, column: 2, scope: !300, inlinedAt: !301)
!305 = !DILocalVariable(name: "cd_size", scope: !188, file: !2, line: 384, type: !35, align: 64)
!306 = !DILocation(line: 384, column: 9, scope: !188)
!307 = !DILocation(line: 384, column: 19, scope: !188)
!308 = !DILocalVariable(name: "i", scope: !309, file: !2, line: 386, type: !34, align: 64)
!309 = distinct !DILexicalBlock(scope: !188, file: !2, line: 386, column: 3)
!310 = !DILocation(line: 386, column: 12, scope: !309)
!311 = !DILocation(line: 386, column: 16, scope: !309)
!312 = !DILocation(line: 386, column: 19, scope: !309)
!313 = !DILocation(line: 386, column: 23, scope: !309)
!314 = !DILocalVariable(name: "entry", scope: !315, file: !2, line: 388, type: !152, align: 64)
!315 = distinct !DILexicalBlock(scope: !309, file: !2, line: 387, column: 3)
!316 = !DILocation(line: 388, column: 14, scope: !315)
!317 = !DILocation(line: 388, column: 22, scope: !315)
!318 = !DILocation(line: 388, column: 43, scope: !315)
!319 = !DILocation(line: 399, column: 19, scope: !315)
!320 = !DILocalVariable(name: "cdh", scope: !315, file: !2, line: 389, type: !321, align: 8)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "ZipCDH", scope: !2, file: !2, line: 1020, size: 368, align: 8, elements: !322, identifier: "std.compression.zip.ZipCDH")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !321, file: !2, line: 1022, baseType: !48, size: 32, align: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "version_made_by", scope: !321, file: !2, line: 1023, baseType: !14, size: 16, align: 16, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "version_needed", scope: !321, file: !2, line: 1024, baseType: !14, size: 16, align: 16, offset: 48)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !321, file: !2, line: 1025, baseType: !14, size: 16, align: 16, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !321, file: !2, line: 1026, baseType: !23, size: 16, align: 16, offset: 80)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "last_mod_time", scope: !321, file: !2, line: 1027, baseType: !14, size: 16, align: 16, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "last_mod_date", scope: !321, file: !2, line: 1028, baseType: !14, size: 16, align: 16, offset: 112)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !321, file: !2, line: 1029, baseType: !48, size: 32, align: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !321, file: !2, line: 1030, baseType: !48, size: 32, align: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !321, file: !2, line: 1031, baseType: !48, size: 32, align: 32, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "filename_len", scope: !321, file: !2, line: 1032, baseType: !14, size: 16, align: 16, offset: 224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "extra_field_len", scope: !321, file: !2, line: 1033, baseType: !14, size: 16, align: 16, offset: 240)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "comment_len", scope: !321, file: !2, line: 1034, baseType: !14, size: 16, align: 16, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "disk_number_start", scope: !321, file: !2, line: 1035, baseType: !14, size: 16, align: 16, offset: 272)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "internal_attr", scope: !321, file: !2, line: 1036, baseType: !14, size: 16, align: 16, offset: 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "external_attr", scope: !321, file: !2, line: 1037, baseType: !48, size: 32, align: 32, offset: 304)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "relative_offset", scope: !321, file: !2, line: 1038, baseType: !48, size: 32, align: 32, offset: 336)
!340 = !DILocation(line: 389, column: 11, scope: !315)
!341 = !DILocation(line: 390, column: 22, scope: !315)
!342 = !DILocation(line: 391, column: 28, scope: !315)
!343 = !DILocation(line: 392, column: 27, scope: !315)
!344 = !DILocation(line: 393, column: 15, scope: !315)
!345 = !DILocation(line: 394, column: 26, scope: !315)
!346 = !DILocation(line: 395, column: 26, scope: !315)
!347 = !DILocation(line: 396, column: 18, scope: !315)
!348 = !DILocation(line: 397, column: 33, scope: !315)
!349 = !DILocalVariable(name: "is_zip64", scope: !315, file: !2, line: 400, type: !39, align: 8)
!350 = !DILocation(line: 400, column: 9, scope: !315)
!351 = !DILocation(line: 400, column: 20, scope: !315)
!352 = !DILocation(line: 400, column: 61, scope: !315)
!353 = !DILocation(line: 400, column: 100, scope: !315)
!354 = !DILocalVariable(name: "extra_data", scope: !315, file: !2, line: 402, type: !28, align: 64)
!355 = !DILocation(line: 402, column: 11, scope: !315)
!356 = !DILocation(line: 403, column: 8, scope: !315)
!357 = !DILocation(line: 405, column: 5, scope: !358)
!358 = distinct !DILexicalBlock(scope: !315, file: !2, line: 404, column: 4)
!359 = !DILocation(line: 405, column: 31, scope: !358)
!360 = !DILocation(line: 406, column: 5, scope: !358)
!361 = !DILocation(line: 406, column: 33, scope: !358)
!362 = !DILocation(line: 407, column: 5, scope: !358)
!363 = !DILocation(line: 407, column: 31, scope: !358)
!364 = !DILocalVariable(name: "extra_size", scope: !358, file: !2, line: 410, type: !14, align: 16)
!365 = !DILocation(line: 410, column: 12, scope: !358)
!366 = !DILocation(line: 410, column: 25, scope: !358)
!367 = !DILocation(line: 411, column: 41, scope: !358)
!368 = !DILocation(line: 411, column: 63, scope: !358)
!369 = !DILocation(line: 304, column: 55, scope: !370, inlinedAt: !371)
!370 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !206, file: !206, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!371 = !DILocation(line: 287, column: 9, scope: !372, inlinedAt: !373)
!372 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !206, file: !206, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!373 = !DILocation(line: 411, column: 18, scope: !358)
!374 = !DILocation(line: 304, column: 40, scope: !370, inlinedAt: !371)
!375 = !DILocation(line: 80, column: 6, scope: !376, inlinedAt: !377)
!376 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !206, file: !206, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!377 = !DILocation(line: 304, column: 18, scope: !370, inlinedAt: !371)
!378 = !DILocation(line: 80, column: 20, scope: !376, inlinedAt: !377)
!379 = !DILocation(line: 86, column: 28, scope: !376, inlinedAt: !377)
!380 = !DILocation(line: 38, column: 12, scope: !376, inlinedAt: !377)
!381 = !DILocation(line: 1039, column: 9, scope: !382, inlinedAt: !384)
!382 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !383, file: !383, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!383 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!384 = !DILocation(line: 38, column: 26, scope: !376, inlinedAt: !377)
!385 = !DILocation(line: 1039, column: 20, scope: !382, inlinedAt: !384)
!386 = !DILocation(line: 1039, column: 25, scope: !382, inlinedAt: !384)
!387 = !DILocation(line: 1039, column: 19, scope: !382, inlinedAt: !384)
!388 = !DILocation(line: 86, column: 10, scope: !376, inlinedAt: !377)
!389 = !DILocation(line: 304, column: 67, scope: !370, inlinedAt: !371)
!390 = !DILocation(line: 304, column: 9, scope: !370, inlinedAt: !371)
!391 = !DILocation(line: 412, column: 37, scope: !358)
!392 = !DILocalVariable(name: "ptr", scope: !393, file: !2, line: 164, type: !31, align: 64)
!393 = distinct !DISubprogram(name: "write", linkageName: "write", scope: !394, file: !394, line: 162, scopeLine: 162, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21, retainedNodes: !46)
!394 = !DIFile(filename: "bitorder.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!395 = !DILocation(line: 164, column: 8, scope: !393, inlinedAt: !396)
!396 = !DILocation(line: 412, column: 5, scope: !358)
!397 = !DILocation(line: 169, column: 10, scope: !393, inlinedAt: !396)
!398 = !DILocation(line: 169, column: 16, scope: !393, inlinedAt: !396)
!399 = !DILocation(line: 171, column: 26, scope: !393, inlinedAt: !396)
!400 = !DILocation(line: 335, column: 20, scope: !401, inlinedAt: !403)
!401 = distinct !DISubprogram(name: "bitcast", linkageName: "bitcast", scope: !402, file: !402, line: 332, scopeLine: 332, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!402 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!403 = !DILocation(line: 171, column: 31, scope: !393, inlinedAt: !396)
!404 = !DILocation(line: 335, column: 11, scope: !401, inlinedAt: !403)
!405 = !DILocation(line: 273, column: 27, scope: !406, inlinedAt: !408)
!406 = distinct !DISubprogram(name: "store", linkageName: "store", scope: !407, file: !407, line: 271, scopeLine: 271, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!407 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!408 = !DILocation(line: 171, column: 2, scope: !393, inlinedAt: !396)
!409 = !DILocation(line: 273, column: 32, scope: !406, inlinedAt: !408)
!410 = !DILocation(line: 413, column: 30, scope: !358)
!411 = !DILocation(line: 413, column: 21, scope: !358)
!412 = !DILocation(line: 413, column: 47, scope: !358)
!413 = !DILocalVariable(name: "ptr", scope: !414, file: !2, line: 164, type: !31, align: 64)
!414 = distinct !DISubprogram(name: "write", linkageName: "write", scope: !394, file: !394, line: 162, scopeLine: 162, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21, retainedNodes: !46)
!415 = !DILocation(line: 164, column: 8, scope: !414, inlinedAt: !416)
!416 = !DILocation(line: 413, column: 5, scope: !358)
!417 = !DILocation(line: 169, column: 10, scope: !414, inlinedAt: !416)
!418 = !DILocation(line: 169, column: 16, scope: !414, inlinedAt: !416)
!419 = !DILocation(line: 171, column: 26, scope: !414, inlinedAt: !416)
!420 = !DILocation(line: 335, column: 20, scope: !421, inlinedAt: !422)
!421 = distinct !DISubprogram(name: "bitcast", linkageName: "bitcast", scope: !402, file: !402, line: 332, scopeLine: 332, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!422 = !DILocation(line: 171, column: 31, scope: !414, inlinedAt: !416)
!423 = !DILocation(line: 335, column: 11, scope: !421, inlinedAt: !422)
!424 = !DILocation(line: 273, column: 27, scope: !425, inlinedAt: !426)
!425 = distinct !DISubprogram(name: "store", linkageName: "store", scope: !407, file: !407, line: 271, scopeLine: 271, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!426 = !DILocation(line: 171, column: 2, scope: !414, inlinedAt: !416)
!427 = !DILocation(line: 273, column: 32, scope: !425, inlinedAt: !426)
!428 = !DILocation(line: 414, column: 21, scope: !358)
!429 = !DILocation(line: 414, column: 46, scope: !358)
!430 = !DILocalVariable(name: "ptr", scope: !431, file: !2, line: 164, type: !31, align: 64)
!431 = distinct !DISubprogram(name: "write", linkageName: "write", scope: !394, file: !394, line: 162, scopeLine: 162, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21, retainedNodes: !46)
!432 = !DILocation(line: 164, column: 8, scope: !431, inlinedAt: !433)
!433 = !DILocation(line: 414, column: 5, scope: !358)
!434 = !DILocation(line: 169, column: 10, scope: !431, inlinedAt: !433)
!435 = !DILocation(line: 169, column: 16, scope: !431, inlinedAt: !433)
!436 = !DILocation(line: 171, column: 26, scope: !431, inlinedAt: !433)
!437 = !DILocation(line: 335, column: 20, scope: !438, inlinedAt: !439)
!438 = distinct !DISubprogram(name: "bitcast", linkageName: "bitcast", scope: !402, file: !402, line: 332, scopeLine: 332, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!439 = !DILocation(line: 171, column: 31, scope: !431, inlinedAt: !433)
!440 = !DILocation(line: 335, column: 11, scope: !438, inlinedAt: !439)
!441 = !DILocation(line: 273, column: 27, scope: !442, inlinedAt: !443)
!442 = distinct !DISubprogram(name: "store", linkageName: "store", scope: !407, file: !407, line: 271, scopeLine: 271, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!443 = !DILocation(line: 171, column: 2, scope: !431, inlinedAt: !433)
!444 = !DILocation(line: 273, column: 32, scope: !442, inlinedAt: !443)
!445 = !DILocation(line: 415, column: 21, scope: !358)
!446 = !DILocation(line: 415, column: 44, scope: !358)
!447 = !DILocalVariable(name: "ptr", scope: !448, file: !2, line: 164, type: !31, align: 64)
!448 = distinct !DISubprogram(name: "write", linkageName: "write", scope: !394, file: !394, line: 162, scopeLine: 162, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21, retainedNodes: !46)
!449 = !DILocation(line: 164, column: 8, scope: !448, inlinedAt: !450)
!450 = !DILocation(line: 415, column: 5, scope: !358)
!451 = !DILocation(line: 169, column: 10, scope: !448, inlinedAt: !450)
!452 = !DILocation(line: 169, column: 16, scope: !448, inlinedAt: !450)
!453 = !DILocation(line: 171, column: 26, scope: !448, inlinedAt: !450)
!454 = !DILocation(line: 335, column: 20, scope: !455, inlinedAt: !456)
!455 = distinct !DISubprogram(name: "bitcast", linkageName: "bitcast", scope: !402, file: !402, line: 332, scopeLine: 332, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!456 = !DILocation(line: 171, column: 31, scope: !448, inlinedAt: !450)
!457 = !DILocation(line: 335, column: 11, scope: !455, inlinedAt: !456)
!458 = !DILocation(line: 273, column: 27, scope: !459, inlinedAt: !460)
!459 = distinct !DISubprogram(name: "store", linkageName: "store", scope: !407, file: !407, line: 271, scopeLine: 271, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!460 = !DILocation(line: 171, column: 2, scope: !448, inlinedAt: !450)
!461 = !DILocation(line: 273, column: 32, scope: !459, inlinedAt: !460)
!462 = !DILocation(line: 416, column: 21, scope: !358)
!463 = !DILocation(line: 416, column: 35, scope: !358)
!464 = !DILocalVariable(name: "ptr", scope: !465, file: !2, line: 164, type: !31, align: 64)
!465 = distinct !DISubprogram(name: "write", linkageName: "write", scope: !394, file: !394, line: 162, scopeLine: 162, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21, retainedNodes: !46)
!466 = !DILocation(line: 164, column: 8, scope: !465, inlinedAt: !467)
!467 = !DILocation(line: 416, column: 5, scope: !358)
!468 = !DILocation(line: 169, column: 10, scope: !465, inlinedAt: !467)
!469 = !DILocation(line: 169, column: 16, scope: !465, inlinedAt: !467)
!470 = !DILocation(line: 171, column: 26, scope: !465, inlinedAt: !467)
!471 = !DILocation(line: 335, column: 20, scope: !472, inlinedAt: !473)
!472 = distinct !DISubprogram(name: "bitcast", linkageName: "bitcast", scope: !402, file: !402, line: 332, scopeLine: 332, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!473 = !DILocation(line: 171, column: 31, scope: !465, inlinedAt: !467)
!474 = !DILocation(line: 335, column: 11, scope: !472, inlinedAt: !473)
!475 = !DILocation(line: 273, column: 27, scope: !476, inlinedAt: !477)
!476 = distinct !DISubprogram(name: "store", linkageName: "store", scope: !407, file: !407, line: 271, scopeLine: 271, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!477 = !DILocation(line: 171, column: 2, scope: !465, inlinedAt: !467)
!478 = !DILocation(line: 273, column: 32, scope: !476, inlinedAt: !477)
!479 = !DILocation(line: 418, column: 5, scope: !358)
!480 = !DILocation(line: 418, column: 31, scope: !358)
!481 = !DILocation(line: 422, column: 5, scope: !482)
!482 = distinct !DILexicalBlock(scope: !315, file: !2, line: 421, column: 4)
!483 = !DILocation(line: 422, column: 37, scope: !482)
!484 = !DILocation(line: 423, column: 5, scope: !482)
!485 = !DILocation(line: 423, column: 39, scope: !482)
!486 = !DILocation(line: 424, column: 5, scope: !482)
!487 = !DILocation(line: 424, column: 37, scope: !482)
!488 = !DILocation(line: 429, column: 4, scope: !315)
!489 = !DILocation(line: 429, column: 35, scope: !315)
!490 = !DILocation(line: 429, column: 63, scope: !315)
!491 = !DILocation(line: 431, column: 18, scope: !315)
!492 = !DILocation(line: 431, column: 29, scope: !315)
!493 = !DILocation(line: 90, column: 34, scope: !494, inlinedAt: !497)
!494 = distinct !DILexicalBlock(scope: !496, file: !495, line: 91, column: 1)
!495 = !DIFile(filename: "stream.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io")
!496 = distinct !DISubprogram(name: "write_any", linkageName: "write_any", scope: !495, file: !495, line: 90, scopeLine: 90, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!497 = !DILocation(line: 431, column: 4, scope: !315)
!498 = !DILocation(line: 92, column: 28, scope: !496, inlinedAt: !497)
!499 = !DILocation(line: 92, column: 41, scope: !496, inlinedAt: !497)
!500 = !DILocation(line: 92, column: 27, scope: !496, inlinedAt: !497)
!501 = !DILocation(line: 137, column: 6, scope: !502, inlinedAt: !503)
!502 = distinct !DISubprogram(name: "write_all", linkageName: "write_all", scope: !495, file: !495, line: 135, scopeLine: 135, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21, retainedNodes: !46)
!503 = !DILocation(line: 92, column: 9, scope: !496, inlinedAt: !497)
!504 = !DILocation(line: 137, column: 30, scope: !502, inlinedAt: !503)
!505 = !DILocalVariable(name: "n", scope: !502, file: !2, line: 138, type: !34, align: 64)
!506 = !DILocation(line: 138, column: 6, scope: !502, inlinedAt: !503)
!507 = !DILocation(line: 138, column: 10, scope: !502, inlinedAt: !503)
!508 = !DILocation(line: 138, column: 23, scope: !502, inlinedAt: !503)
!509 = !DILocation(line: 167, column: 11, scope: !502, inlinedAt: !503)
!510 = !DILocation(line: 139, column: 6, scope: !502, inlinedAt: !503)
!511 = !DILocation(line: 139, column: 11, scope: !502, inlinedAt: !503)
!512 = !DILocation(line: 139, column: 30, scope: !502, inlinedAt: !503)
!513 = !DILocation(line: 140, column: 9, scope: !502, inlinedAt: !503)
!514 = !DILocation(line: 367, column: 9, scope: !515)
!515 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!516 = !DILocation(line: 367, column: 3, scope: !515)
!517 = !DILocation(line: 369, column: 21, scope: !518)
!518 = distinct !DILexicalBlock(scope: !515, file: !2, line: 369, column: 3)
!519 = !DILocalVariable(name: ".temp", scope: !518, file: !2, line: 369, type: !34, align: 64)
!520 = !DILocalVariable(name: "entry", scope: !521, file: !2, line: 369, type: !152, align: 64)
!521 = distinct !DILexicalBlock(scope: !518, file: !2, line: 370, column: 3)
!522 = !DILocation(line: 369, column: 13, scope: !521)
!523 = !DILocation(line: 369, column: 21, scope: !521)
!524 = !DILocation(line: 399, column: 19, scope: !521)
!525 = !DILocation(line: 371, column: 20, scope: !526)
!526 = distinct !DILexicalBlock(scope: !521, file: !2, line: 370, column: 3)
!527 = !DILocation(line: 371, column: 36, scope: !526)
!528 = !DILocation(line: 119, column: 6, scope: !529, inlinedAt: !530)
!529 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!530 = !DILocation(line: 371, column: 4, scope: !526)
!531 = !DILocation(line: 119, column: 18, scope: !529, inlinedAt: !530)
!532 = !DILocation(line: 123, column: 20, scope: !529, inlinedAt: !530)
!533 = !DILocation(line: 123, column: 2, scope: !529, inlinedAt: !530)
!534 = !DILocation(line: 373, column: 3, scope: !515)
!535 = !DILocation(line: 374, column: 19, scope: !515)
!536 = !DILocation(line: 374, column: 35, scope: !515)
!537 = !DILocation(line: 119, column: 6, scope: !538, inlinedAt: !539)
!538 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!539 = !DILocation(line: 374, column: 3, scope: !515)
!540 = !DILocation(line: 119, column: 18, scope: !538, inlinedAt: !539)
!541 = !DILocation(line: 123, column: 20, scope: !538, inlinedAt: !539)
!542 = !DILocation(line: 123, column: 2, scope: !538, inlinedAt: !539)
!543 = !DILocation(line: 375, column: 19, scope: !515)
!544 = !DILocation(line: 375, column: 35, scope: !515)
!545 = !DILocation(line: 119, column: 6, scope: !546, inlinedAt: !547)
!546 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!547 = !DILocation(line: 375, column: 3, scope: !515)
!548 = !DILocation(line: 119, column: 18, scope: !546, inlinedAt: !547)
!549 = !DILocation(line: 123, column: 20, scope: !546, inlinedAt: !547)
!550 = !DILocation(line: 123, column: 2, scope: !546, inlinedAt: !547)
!551 = !DILocation(line: 376, column: 7, scope: !515)
!552 = !DILocation(line: 376, column: 45, scope: !515)
!553 = !DILocation(line: 376, column: 61, scope: !515)
!554 = !DILocation(line: 119, column: 6, scope: !555, inlinedAt: !556)
!555 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!556 = !DILocation(line: 376, column: 29, scope: !515)
!557 = !DILocation(line: 119, column: 18, scope: !555, inlinedAt: !556)
!558 = !DILocation(line: 123, column: 20, scope: !555, inlinedAt: !556)
!559 = !DILocation(line: 123, column: 2, scope: !555, inlinedAt: !556)
!560 = !DILocation(line: 377, column: 7, scope: !515)
!561 = !DILocation(line: 377, column: 34, scope: !515)
!562 = !DILocation(line: 377, column: 50, scope: !515)
!563 = !DILocation(line: 119, column: 6, scope: !564, inlinedAt: !565)
!564 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!565 = !DILocation(line: 377, column: 18, scope: !515)
!566 = !DILocation(line: 119, column: 18, scope: !564, inlinedAt: !565)
!567 = !DILocation(line: 123, column: 20, scope: !564, inlinedAt: !565)
!568 = !DILocation(line: 123, column: 2, scope: !564, inlinedAt: !565)
!569 = !DILocation(line: 432, column: 4, scope: !315)
!570 = !DILocation(line: 432, column: 20, scope: !315)
!571 = !DILocation(line: 167, column: 11, scope: !315)
!572 = !DILocation(line: 367, column: 9, scope: !573)
!573 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!574 = !DILocation(line: 367, column: 3, scope: !573)
!575 = !DILocation(line: 369, column: 21, scope: !576)
!576 = distinct !DILexicalBlock(scope: !573, file: !2, line: 369, column: 3)
!577 = !DILocalVariable(name: ".temp", scope: !576, file: !2, line: 369, type: !34, align: 64)
!578 = !DILocalVariable(name: "entry", scope: !579, file: !2, line: 369, type: !152, align: 64)
!579 = distinct !DILexicalBlock(scope: !576, file: !2, line: 370, column: 3)
!580 = !DILocation(line: 369, column: 13, scope: !579)
!581 = !DILocation(line: 369, column: 21, scope: !579)
!582 = !DILocation(line: 399, column: 19, scope: !579)
!583 = !DILocation(line: 371, column: 20, scope: !584)
!584 = distinct !DILexicalBlock(scope: !579, file: !2, line: 370, column: 3)
!585 = !DILocation(line: 371, column: 36, scope: !584)
!586 = !DILocation(line: 119, column: 6, scope: !587, inlinedAt: !588)
!587 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!588 = !DILocation(line: 371, column: 4, scope: !584)
!589 = !DILocation(line: 119, column: 18, scope: !587, inlinedAt: !588)
!590 = !DILocation(line: 123, column: 20, scope: !587, inlinedAt: !588)
!591 = !DILocation(line: 123, column: 2, scope: !587, inlinedAt: !588)
!592 = !DILocation(line: 373, column: 3, scope: !573)
!593 = !DILocation(line: 374, column: 19, scope: !573)
!594 = !DILocation(line: 374, column: 35, scope: !573)
!595 = !DILocation(line: 119, column: 6, scope: !596, inlinedAt: !597)
!596 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!597 = !DILocation(line: 374, column: 3, scope: !573)
!598 = !DILocation(line: 119, column: 18, scope: !596, inlinedAt: !597)
!599 = !DILocation(line: 123, column: 20, scope: !596, inlinedAt: !597)
!600 = !DILocation(line: 123, column: 2, scope: !596, inlinedAt: !597)
!601 = !DILocation(line: 375, column: 19, scope: !573)
!602 = !DILocation(line: 375, column: 35, scope: !573)
!603 = !DILocation(line: 119, column: 6, scope: !604, inlinedAt: !605)
!604 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!605 = !DILocation(line: 375, column: 3, scope: !573)
!606 = !DILocation(line: 119, column: 18, scope: !604, inlinedAt: !605)
!607 = !DILocation(line: 123, column: 20, scope: !604, inlinedAt: !605)
!608 = !DILocation(line: 123, column: 2, scope: !604, inlinedAt: !605)
!609 = !DILocation(line: 376, column: 7, scope: !573)
!610 = !DILocation(line: 376, column: 45, scope: !573)
!611 = !DILocation(line: 376, column: 61, scope: !573)
!612 = !DILocation(line: 119, column: 6, scope: !613, inlinedAt: !614)
!613 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!614 = !DILocation(line: 376, column: 29, scope: !573)
!615 = !DILocation(line: 119, column: 18, scope: !613, inlinedAt: !614)
!616 = !DILocation(line: 123, column: 20, scope: !613, inlinedAt: !614)
!617 = !DILocation(line: 123, column: 2, scope: !613, inlinedAt: !614)
!618 = !DILocation(line: 377, column: 7, scope: !573)
!619 = !DILocation(line: 377, column: 34, scope: !573)
!620 = !DILocation(line: 377, column: 50, scope: !573)
!621 = !DILocation(line: 119, column: 6, scope: !622, inlinedAt: !623)
!622 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!623 = !DILocation(line: 377, column: 18, scope: !573)
!624 = !DILocation(line: 119, column: 18, scope: !622, inlinedAt: !623)
!625 = !DILocation(line: 123, column: 20, scope: !622, inlinedAt: !623)
!626 = !DILocation(line: 123, column: 2, scope: !622, inlinedAt: !623)
!627 = !DILocation(line: 433, column: 8, scope: !315)
!628 = !DILocation(line: 435, column: 5, scope: !629)
!629 = distinct !DILexicalBlock(scope: !315, file: !2, line: 434, column: 4)
!630 = !DILocation(line: 435, column: 21, scope: !629)
!631 = !DILocation(line: 167, column: 11, scope: !629)
!632 = !DILocation(line: 367, column: 9, scope: !633)
!633 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!634 = !DILocation(line: 367, column: 3, scope: !633)
!635 = !DILocation(line: 369, column: 21, scope: !636)
!636 = distinct !DILexicalBlock(scope: !633, file: !2, line: 369, column: 3)
!637 = !DILocalVariable(name: ".temp", scope: !636, file: !2, line: 369, type: !34, align: 64)
!638 = !DILocalVariable(name: "entry", scope: !639, file: !2, line: 369, type: !152, align: 64)
!639 = distinct !DILexicalBlock(scope: !636, file: !2, line: 370, column: 3)
!640 = !DILocation(line: 369, column: 13, scope: !639)
!641 = !DILocation(line: 369, column: 21, scope: !639)
!642 = !DILocation(line: 399, column: 19, scope: !639)
!643 = !DILocation(line: 371, column: 20, scope: !644)
!644 = distinct !DILexicalBlock(scope: !639, file: !2, line: 370, column: 3)
!645 = !DILocation(line: 371, column: 36, scope: !644)
!646 = !DILocation(line: 119, column: 6, scope: !647, inlinedAt: !648)
!647 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!648 = !DILocation(line: 371, column: 4, scope: !644)
!649 = !DILocation(line: 119, column: 18, scope: !647, inlinedAt: !648)
!650 = !DILocation(line: 123, column: 20, scope: !647, inlinedAt: !648)
!651 = !DILocation(line: 123, column: 2, scope: !647, inlinedAt: !648)
!652 = !DILocation(line: 373, column: 3, scope: !633)
!653 = !DILocation(line: 374, column: 19, scope: !633)
!654 = !DILocation(line: 374, column: 35, scope: !633)
!655 = !DILocation(line: 119, column: 6, scope: !656, inlinedAt: !657)
!656 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!657 = !DILocation(line: 374, column: 3, scope: !633)
!658 = !DILocation(line: 119, column: 18, scope: !656, inlinedAt: !657)
!659 = !DILocation(line: 123, column: 20, scope: !656, inlinedAt: !657)
!660 = !DILocation(line: 123, column: 2, scope: !656, inlinedAt: !657)
!661 = !DILocation(line: 375, column: 19, scope: !633)
!662 = !DILocation(line: 375, column: 35, scope: !633)
!663 = !DILocation(line: 119, column: 6, scope: !664, inlinedAt: !665)
!664 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!665 = !DILocation(line: 375, column: 3, scope: !633)
!666 = !DILocation(line: 119, column: 18, scope: !664, inlinedAt: !665)
!667 = !DILocation(line: 123, column: 20, scope: !664, inlinedAt: !665)
!668 = !DILocation(line: 123, column: 2, scope: !664, inlinedAt: !665)
!669 = !DILocation(line: 376, column: 7, scope: !633)
!670 = !DILocation(line: 376, column: 45, scope: !633)
!671 = !DILocation(line: 376, column: 61, scope: !633)
!672 = !DILocation(line: 119, column: 6, scope: !673, inlinedAt: !674)
!673 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!674 = !DILocation(line: 376, column: 29, scope: !633)
!675 = !DILocation(line: 119, column: 18, scope: !673, inlinedAt: !674)
!676 = !DILocation(line: 123, column: 20, scope: !673, inlinedAt: !674)
!677 = !DILocation(line: 123, column: 2, scope: !673, inlinedAt: !674)
!678 = !DILocation(line: 377, column: 7, scope: !633)
!679 = !DILocation(line: 377, column: 34, scope: !633)
!680 = !DILocation(line: 377, column: 50, scope: !633)
!681 = !DILocation(line: 119, column: 6, scope: !682, inlinedAt: !683)
!682 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!683 = !DILocation(line: 377, column: 18, scope: !633)
!684 = !DILocation(line: 119, column: 18, scope: !682, inlinedAt: !683)
!685 = !DILocation(line: 123, column: 20, scope: !682, inlinedAt: !683)
!686 = !DILocation(line: 123, column: 2, scope: !682, inlinedAt: !683)
!687 = !DILocation(line: 436, column: 21, scope: !629)
!688 = !DILocation(line: 119, column: 6, scope: !689, inlinedAt: !690)
!689 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!690 = !DILocation(line: 436, column: 5, scope: !629)
!691 = !DILocation(line: 119, column: 18, scope: !689, inlinedAt: !690)
!692 = !DILocation(line: 123, column: 20, scope: !689, inlinedAt: !690)
!693 = !DILocation(line: 123, column: 2, scope: !689, inlinedAt: !690)
!694 = !DILocalVariable(name: "entry_record_size", scope: !315, file: !2, line: 439, type: !35, align: 64)
!695 = !DILocation(line: 439, column: 10, scope: !315)
!696 = !DILocation(line: 439, column: 54, scope: !315)
!697 = !DILocation(line: 439, column: 38, scope: !315)
!698 = !DILocation(line: 439, column: 71, scope: !315)
!699 = !DILocation(line: 439, column: 30, scope: !315)
!700 = !DILocation(line: 440, column: 8, scope: !315)
!701 = !DILocation(line: 440, column: 31, scope: !315)
!702 = !DILocation(line: 440, column: 19, scope: !315)
!703 = !DILocation(line: 367, column: 9, scope: !704)
!704 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!705 = !DILocation(line: 367, column: 3, scope: !704)
!706 = !DILocation(line: 369, column: 21, scope: !707)
!707 = distinct !DILexicalBlock(scope: !704, file: !2, line: 369, column: 3)
!708 = !DILocalVariable(name: ".temp", scope: !707, file: !2, line: 369, type: !34, align: 64)
!709 = !DILocalVariable(name: "entry", scope: !710, file: !2, line: 369, type: !152, align: 64)
!710 = distinct !DILexicalBlock(scope: !707, file: !2, line: 370, column: 3)
!711 = !DILocation(line: 369, column: 13, scope: !710)
!712 = !DILocation(line: 369, column: 21, scope: !710)
!713 = !DILocation(line: 399, column: 19, scope: !710)
!714 = !DILocation(line: 371, column: 20, scope: !715)
!715 = distinct !DILexicalBlock(scope: !710, file: !2, line: 370, column: 3)
!716 = !DILocation(line: 371, column: 36, scope: !715)
!717 = !DILocation(line: 119, column: 6, scope: !718, inlinedAt: !719)
!718 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!719 = !DILocation(line: 371, column: 4, scope: !715)
!720 = !DILocation(line: 119, column: 18, scope: !718, inlinedAt: !719)
!721 = !DILocation(line: 123, column: 20, scope: !718, inlinedAt: !719)
!722 = !DILocation(line: 123, column: 2, scope: !718, inlinedAt: !719)
!723 = !DILocation(line: 373, column: 3, scope: !704)
!724 = !DILocation(line: 374, column: 19, scope: !704)
!725 = !DILocation(line: 374, column: 35, scope: !704)
!726 = !DILocation(line: 119, column: 6, scope: !727, inlinedAt: !728)
!727 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!728 = !DILocation(line: 374, column: 3, scope: !704)
!729 = !DILocation(line: 119, column: 18, scope: !727, inlinedAt: !728)
!730 = !DILocation(line: 123, column: 20, scope: !727, inlinedAt: !728)
!731 = !DILocation(line: 123, column: 2, scope: !727, inlinedAt: !728)
!732 = !DILocation(line: 375, column: 19, scope: !704)
!733 = !DILocation(line: 375, column: 35, scope: !704)
!734 = !DILocation(line: 119, column: 6, scope: !735, inlinedAt: !736)
!735 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!736 = !DILocation(line: 375, column: 3, scope: !704)
!737 = !DILocation(line: 119, column: 18, scope: !735, inlinedAt: !736)
!738 = !DILocation(line: 123, column: 20, scope: !735, inlinedAt: !736)
!739 = !DILocation(line: 123, column: 2, scope: !735, inlinedAt: !736)
!740 = !DILocation(line: 376, column: 7, scope: !704)
!741 = !DILocation(line: 376, column: 45, scope: !704)
!742 = !DILocation(line: 376, column: 61, scope: !704)
!743 = !DILocation(line: 119, column: 6, scope: !744, inlinedAt: !745)
!744 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!745 = !DILocation(line: 376, column: 29, scope: !704)
!746 = !DILocation(line: 119, column: 18, scope: !744, inlinedAt: !745)
!747 = !DILocation(line: 123, column: 20, scope: !744, inlinedAt: !745)
!748 = !DILocation(line: 123, column: 2, scope: !744, inlinedAt: !745)
!749 = !DILocation(line: 377, column: 7, scope: !704)
!750 = !DILocation(line: 377, column: 34, scope: !704)
!751 = !DILocation(line: 377, column: 50, scope: !704)
!752 = !DILocation(line: 119, column: 6, scope: !753, inlinedAt: !754)
!753 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!754 = !DILocation(line: 377, column: 18, scope: !704)
!755 = !DILocation(line: 119, column: 18, scope: !753, inlinedAt: !754)
!756 = !DILocation(line: 123, column: 20, scope: !753, inlinedAt: !754)
!757 = !DILocation(line: 123, column: 2, scope: !753, inlinedAt: !754)
!758 = !DILocation(line: 441, column: 4, scope: !315)
!759 = !DILocation(line: 441, column: 15, scope: !315)
!760 = !DILocation(line: 386, column: 43, scope: !309)
!761 = !DILocalVariable(name: "cd_zip64", scope: !188, file: !2, line: 444, type: !39, align: 8)
!762 = !DILocation(line: 444, column: 8, scope: !188)
!763 = !DILocation(line: 444, column: 19, scope: !188)
!764 = !DILocation(line: 444, column: 51, scope: !188)
!765 = !DILocation(line: 444, column: 76, scope: !188)
!766 = !DILocation(line: 446, column: 7, scope: !188)
!767 = !DILocalVariable(name: "eocd64_offset", scope: !768, file: !2, line: 448, type: !35, align: 64)
!768 = distinct !DILexicalBlock(scope: !188, file: !2, line: 447, column: 3)
!769 = !DILocation(line: 448, column: 10, scope: !768)
!770 = !DILocation(line: 448, column: 26, scope: !768)
!771 = !DILocation(line: 84, column: 11, scope: !768)
!772 = !DILocation(line: 367, column: 9, scope: !773)
!773 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!774 = !DILocation(line: 367, column: 3, scope: !773)
!775 = !DILocation(line: 369, column: 21, scope: !776)
!776 = distinct !DILexicalBlock(scope: !773, file: !2, line: 369, column: 3)
!777 = !DILocalVariable(name: ".temp", scope: !776, file: !2, line: 369, type: !34, align: 64)
!778 = !DILocalVariable(name: "entry", scope: !779, file: !2, line: 369, type: !152, align: 64)
!779 = distinct !DILexicalBlock(scope: !776, file: !2, line: 370, column: 3)
!780 = !DILocation(line: 369, column: 13, scope: !779)
!781 = !DILocation(line: 369, column: 21, scope: !779)
!782 = !DILocation(line: 399, column: 19, scope: !779)
!783 = !DILocation(line: 371, column: 20, scope: !784)
!784 = distinct !DILexicalBlock(scope: !779, file: !2, line: 370, column: 3)
!785 = !DILocation(line: 371, column: 36, scope: !784)
!786 = !DILocation(line: 119, column: 6, scope: !787, inlinedAt: !788)
!787 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!788 = !DILocation(line: 371, column: 4, scope: !784)
!789 = !DILocation(line: 119, column: 18, scope: !787, inlinedAt: !788)
!790 = !DILocation(line: 123, column: 20, scope: !787, inlinedAt: !788)
!791 = !DILocation(line: 123, column: 2, scope: !787, inlinedAt: !788)
!792 = !DILocation(line: 373, column: 3, scope: !773)
!793 = !DILocation(line: 374, column: 19, scope: !773)
!794 = !DILocation(line: 374, column: 35, scope: !773)
!795 = !DILocation(line: 119, column: 6, scope: !796, inlinedAt: !797)
!796 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!797 = !DILocation(line: 374, column: 3, scope: !773)
!798 = !DILocation(line: 119, column: 18, scope: !796, inlinedAt: !797)
!799 = !DILocation(line: 123, column: 20, scope: !796, inlinedAt: !797)
!800 = !DILocation(line: 123, column: 2, scope: !796, inlinedAt: !797)
!801 = !DILocation(line: 375, column: 19, scope: !773)
!802 = !DILocation(line: 375, column: 35, scope: !773)
!803 = !DILocation(line: 119, column: 6, scope: !804, inlinedAt: !805)
!804 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!805 = !DILocation(line: 375, column: 3, scope: !773)
!806 = !DILocation(line: 119, column: 18, scope: !804, inlinedAt: !805)
!807 = !DILocation(line: 123, column: 20, scope: !804, inlinedAt: !805)
!808 = !DILocation(line: 123, column: 2, scope: !804, inlinedAt: !805)
!809 = !DILocation(line: 376, column: 7, scope: !773)
!810 = !DILocation(line: 376, column: 45, scope: !773)
!811 = !DILocation(line: 376, column: 61, scope: !773)
!812 = !DILocation(line: 119, column: 6, scope: !813, inlinedAt: !814)
!813 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!814 = !DILocation(line: 376, column: 29, scope: !773)
!815 = !DILocation(line: 119, column: 18, scope: !813, inlinedAt: !814)
!816 = !DILocation(line: 123, column: 20, scope: !813, inlinedAt: !814)
!817 = !DILocation(line: 123, column: 2, scope: !813, inlinedAt: !814)
!818 = !DILocation(line: 377, column: 7, scope: !773)
!819 = !DILocation(line: 377, column: 34, scope: !773)
!820 = !DILocation(line: 377, column: 50, scope: !773)
!821 = !DILocation(line: 119, column: 6, scope: !822, inlinedAt: !823)
!822 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!823 = !DILocation(line: 377, column: 18, scope: !773)
!824 = !DILocation(line: 119, column: 18, scope: !822, inlinedAt: !823)
!825 = !DILocation(line: 123, column: 20, scope: !822, inlinedAt: !823)
!826 = !DILocation(line: 123, column: 2, scope: !822, inlinedAt: !823)
!827 = !DILocalVariable(name: "eocd64", scope: !768, file: !2, line: 450, type: !828, align: 8)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip64EOCD", scope: !2, file: !2, line: 1061, size: 448, align: 8, elements: !829, identifier: "std.compression.zip.Zip64EOCD")
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837, !838, !839}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !828, file: !2, line: 1063, baseType: !48, size: 32, align: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !828, file: !2, line: 1064, baseType: !35, size: 64, align: 64, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "version_made", scope: !828, file: !2, line: 1065, baseType: !14, size: 16, align: 16, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "version_needed", scope: !828, file: !2, line: 1066, baseType: !14, size: 16, align: 16, offset: 112)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "disk_num", scope: !828, file: !2, line: 1067, baseType: !48, size: 32, align: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "disk_start", scope: !828, file: !2, line: 1068, baseType: !48, size: 32, align: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "count_this_disk", scope: !828, file: !2, line: 1069, baseType: !35, size: 64, align: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "count_total", scope: !828, file: !2, line: 1070, baseType: !35, size: 64, align: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "size_cd", scope: !828, file: !2, line: 1071, baseType: !35, size: 64, align: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "offset_cd", scope: !828, file: !2, line: 1072, baseType: !35, size: 64, align: 64, offset: 384)
!840 = !DILocation(line: 450, column: 14, scope: !768)
!841 = !DILocation(line: 451, column: 22, scope: !768)
!842 = !DILocation(line: 452, column: 17, scope: !768)
!843 = !DILocation(line: 453, column: 25, scope: !768)
!844 = !DILocation(line: 454, column: 27, scope: !768)
!845 = !DILocation(line: 455, column: 35, scope: !768)
!846 = !DILocation(line: 455, column: 28, scope: !768)
!847 = !DILocation(line: 456, column: 31, scope: !768)
!848 = !DILocation(line: 456, column: 24, scope: !768)
!849 = !DILocation(line: 457, column: 20, scope: !768)
!850 = !DILocation(line: 458, column: 22, scope: !768)
!851 = !DILocation(line: 461, column: 18, scope: !768)
!852 = !DILocation(line: 461, column: 29, scope: !768)
!853 = !DILocation(line: 90, column: 34, scope: !854, inlinedAt: !856)
!854 = distinct !DILexicalBlock(scope: !855, file: !495, line: 91, column: 1)
!855 = distinct !DISubprogram(name: "write_any", linkageName: "write_any", scope: !495, file: !495, line: 90, scopeLine: 90, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!856 = !DILocation(line: 461, column: 4, scope: !768)
!857 = !DILocation(line: 92, column: 28, scope: !855, inlinedAt: !856)
!858 = !DILocation(line: 92, column: 41, scope: !855, inlinedAt: !856)
!859 = !DILocation(line: 92, column: 27, scope: !855, inlinedAt: !856)
!860 = !DILocation(line: 137, column: 6, scope: !861, inlinedAt: !862)
!861 = distinct !DISubprogram(name: "write_all", linkageName: "write_all", scope: !495, file: !495, line: 135, scopeLine: 135, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21, retainedNodes: !46)
!862 = !DILocation(line: 92, column: 9, scope: !855, inlinedAt: !856)
!863 = !DILocation(line: 137, column: 30, scope: !861, inlinedAt: !862)
!864 = !DILocalVariable(name: "n", scope: !861, file: !2, line: 138, type: !34, align: 64)
!865 = !DILocation(line: 138, column: 6, scope: !861, inlinedAt: !862)
!866 = !DILocation(line: 138, column: 10, scope: !861, inlinedAt: !862)
!867 = !DILocation(line: 138, column: 23, scope: !861, inlinedAt: !862)
!868 = !DILocation(line: 167, column: 11, scope: !861, inlinedAt: !862)
!869 = !DILocation(line: 139, column: 6, scope: !861, inlinedAt: !862)
!870 = !DILocation(line: 139, column: 11, scope: !861, inlinedAt: !862)
!871 = !DILocation(line: 139, column: 30, scope: !861, inlinedAt: !862)
!872 = !DILocation(line: 140, column: 9, scope: !861, inlinedAt: !862)
!873 = !DILocation(line: 367, column: 9, scope: !874)
!874 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!875 = !DILocation(line: 367, column: 3, scope: !874)
!876 = !DILocation(line: 369, column: 21, scope: !877)
!877 = distinct !DILexicalBlock(scope: !874, file: !2, line: 369, column: 3)
!878 = !DILocalVariable(name: ".temp", scope: !877, file: !2, line: 369, type: !34, align: 64)
!879 = !DILocalVariable(name: "entry", scope: !880, file: !2, line: 369, type: !152, align: 64)
!880 = distinct !DILexicalBlock(scope: !877, file: !2, line: 370, column: 3)
!881 = !DILocation(line: 369, column: 13, scope: !880)
!882 = !DILocation(line: 369, column: 21, scope: !880)
!883 = !DILocation(line: 399, column: 19, scope: !880)
!884 = !DILocation(line: 371, column: 20, scope: !885)
!885 = distinct !DILexicalBlock(scope: !880, file: !2, line: 370, column: 3)
!886 = !DILocation(line: 371, column: 36, scope: !885)
!887 = !DILocation(line: 119, column: 6, scope: !888, inlinedAt: !889)
!888 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!889 = !DILocation(line: 371, column: 4, scope: !885)
!890 = !DILocation(line: 119, column: 18, scope: !888, inlinedAt: !889)
!891 = !DILocation(line: 123, column: 20, scope: !888, inlinedAt: !889)
!892 = !DILocation(line: 123, column: 2, scope: !888, inlinedAt: !889)
!893 = !DILocation(line: 373, column: 3, scope: !874)
!894 = !DILocation(line: 374, column: 19, scope: !874)
!895 = !DILocation(line: 374, column: 35, scope: !874)
!896 = !DILocation(line: 119, column: 6, scope: !897, inlinedAt: !898)
!897 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!898 = !DILocation(line: 374, column: 3, scope: !874)
!899 = !DILocation(line: 119, column: 18, scope: !897, inlinedAt: !898)
!900 = !DILocation(line: 123, column: 20, scope: !897, inlinedAt: !898)
!901 = !DILocation(line: 123, column: 2, scope: !897, inlinedAt: !898)
!902 = !DILocation(line: 375, column: 19, scope: !874)
!903 = !DILocation(line: 375, column: 35, scope: !874)
!904 = !DILocation(line: 119, column: 6, scope: !905, inlinedAt: !906)
!905 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!906 = !DILocation(line: 375, column: 3, scope: !874)
!907 = !DILocation(line: 119, column: 18, scope: !905, inlinedAt: !906)
!908 = !DILocation(line: 123, column: 20, scope: !905, inlinedAt: !906)
!909 = !DILocation(line: 123, column: 2, scope: !905, inlinedAt: !906)
!910 = !DILocation(line: 376, column: 7, scope: !874)
!911 = !DILocation(line: 376, column: 45, scope: !874)
!912 = !DILocation(line: 376, column: 61, scope: !874)
!913 = !DILocation(line: 119, column: 6, scope: !914, inlinedAt: !915)
!914 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!915 = !DILocation(line: 376, column: 29, scope: !874)
!916 = !DILocation(line: 119, column: 18, scope: !914, inlinedAt: !915)
!917 = !DILocation(line: 123, column: 20, scope: !914, inlinedAt: !915)
!918 = !DILocation(line: 123, column: 2, scope: !914, inlinedAt: !915)
!919 = !DILocation(line: 377, column: 7, scope: !874)
!920 = !DILocation(line: 377, column: 34, scope: !874)
!921 = !DILocation(line: 377, column: 50, scope: !874)
!922 = !DILocation(line: 119, column: 6, scope: !923, inlinedAt: !924)
!923 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!924 = !DILocation(line: 377, column: 18, scope: !874)
!925 = !DILocation(line: 119, column: 18, scope: !923, inlinedAt: !924)
!926 = !DILocation(line: 123, column: 20, scope: !923, inlinedAt: !924)
!927 = !DILocation(line: 123, column: 2, scope: !923, inlinedAt: !924)
!928 = !DILocalVariable(name: "locator", scope: !768, file: !2, line: 463, type: !929, align: 8)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip64Locator", scope: !2, file: !2, line: 1076, size: 160, align: 8, elements: !930, identifier: "std.compression.zip.Zip64Locator")
!930 = !{!931, !932, !933, !934}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !929, file: !2, line: 1078, baseType: !48, size: 32, align: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "disk_start", scope: !929, file: !2, line: 1079, baseType: !48, size: 32, align: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "offset_eocd", scope: !929, file: !2, line: 1080, baseType: !35, size: 64, align: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "total_disks", scope: !929, file: !2, line: 1081, baseType: !48, size: 32, align: 32, offset: 128)
!935 = !DILocation(line: 463, column: 17, scope: !768)
!936 = !DILocation(line: 464, column: 22, scope: !768)
!937 = !DILocation(line: 465, column: 23, scope: !768)
!938 = !DILocation(line: 466, column: 24, scope: !768)
!939 = !DILocation(line: 467, column: 24, scope: !768)
!940 = !DILocation(line: 470, column: 18, scope: !768)
!941 = !DILocation(line: 470, column: 29, scope: !768)
!942 = !DILocation(line: 90, column: 34, scope: !943, inlinedAt: !945)
!943 = distinct !DILexicalBlock(scope: !944, file: !495, line: 91, column: 1)
!944 = distinct !DISubprogram(name: "write_any", linkageName: "write_any", scope: !495, file: !495, line: 90, scopeLine: 90, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!945 = !DILocation(line: 470, column: 4, scope: !768)
!946 = !DILocation(line: 92, column: 28, scope: !944, inlinedAt: !945)
!947 = !DILocation(line: 92, column: 41, scope: !944, inlinedAt: !945)
!948 = !DILocation(line: 92, column: 27, scope: !944, inlinedAt: !945)
!949 = !DILocation(line: 137, column: 6, scope: !950, inlinedAt: !951)
!950 = distinct !DISubprogram(name: "write_all", linkageName: "write_all", scope: !495, file: !495, line: 135, scopeLine: 135, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21, retainedNodes: !46)
!951 = !DILocation(line: 92, column: 9, scope: !944, inlinedAt: !945)
!952 = !DILocation(line: 137, column: 30, scope: !950, inlinedAt: !951)
!953 = !DILocalVariable(name: "n", scope: !950, file: !2, line: 138, type: !34, align: 64)
!954 = !DILocation(line: 138, column: 6, scope: !950, inlinedAt: !951)
!955 = !DILocation(line: 138, column: 10, scope: !950, inlinedAt: !951)
!956 = !DILocation(line: 138, column: 23, scope: !950, inlinedAt: !951)
!957 = !DILocation(line: 167, column: 11, scope: !950, inlinedAt: !951)
!958 = !DILocation(line: 139, column: 6, scope: !950, inlinedAt: !951)
!959 = !DILocation(line: 139, column: 11, scope: !950, inlinedAt: !951)
!960 = !DILocation(line: 139, column: 30, scope: !950, inlinedAt: !951)
!961 = !DILocation(line: 140, column: 9, scope: !950, inlinedAt: !951)
!962 = !DILocation(line: 367, column: 9, scope: !963)
!963 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!964 = !DILocation(line: 367, column: 3, scope: !963)
!965 = !DILocation(line: 369, column: 21, scope: !966)
!966 = distinct !DILexicalBlock(scope: !963, file: !2, line: 369, column: 3)
!967 = !DILocalVariable(name: ".temp", scope: !966, file: !2, line: 369, type: !34, align: 64)
!968 = !DILocalVariable(name: "entry", scope: !969, file: !2, line: 369, type: !152, align: 64)
!969 = distinct !DILexicalBlock(scope: !966, file: !2, line: 370, column: 3)
!970 = !DILocation(line: 369, column: 13, scope: !969)
!971 = !DILocation(line: 369, column: 21, scope: !969)
!972 = !DILocation(line: 399, column: 19, scope: !969)
!973 = !DILocation(line: 371, column: 20, scope: !974)
!974 = distinct !DILexicalBlock(scope: !969, file: !2, line: 370, column: 3)
!975 = !DILocation(line: 371, column: 36, scope: !974)
!976 = !DILocation(line: 119, column: 6, scope: !977, inlinedAt: !978)
!977 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!978 = !DILocation(line: 371, column: 4, scope: !974)
!979 = !DILocation(line: 119, column: 18, scope: !977, inlinedAt: !978)
!980 = !DILocation(line: 123, column: 20, scope: !977, inlinedAt: !978)
!981 = !DILocation(line: 123, column: 2, scope: !977, inlinedAt: !978)
!982 = !DILocation(line: 373, column: 3, scope: !963)
!983 = !DILocation(line: 374, column: 19, scope: !963)
!984 = !DILocation(line: 374, column: 35, scope: !963)
!985 = !DILocation(line: 119, column: 6, scope: !986, inlinedAt: !987)
!986 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!987 = !DILocation(line: 374, column: 3, scope: !963)
!988 = !DILocation(line: 119, column: 18, scope: !986, inlinedAt: !987)
!989 = !DILocation(line: 123, column: 20, scope: !986, inlinedAt: !987)
!990 = !DILocation(line: 123, column: 2, scope: !986, inlinedAt: !987)
!991 = !DILocation(line: 375, column: 19, scope: !963)
!992 = !DILocation(line: 375, column: 35, scope: !963)
!993 = !DILocation(line: 119, column: 6, scope: !994, inlinedAt: !995)
!994 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!995 = !DILocation(line: 375, column: 3, scope: !963)
!996 = !DILocation(line: 119, column: 18, scope: !994, inlinedAt: !995)
!997 = !DILocation(line: 123, column: 20, scope: !994, inlinedAt: !995)
!998 = !DILocation(line: 123, column: 2, scope: !994, inlinedAt: !995)
!999 = !DILocation(line: 376, column: 7, scope: !963)
!1000 = !DILocation(line: 376, column: 45, scope: !963)
!1001 = !DILocation(line: 376, column: 61, scope: !963)
!1002 = !DILocation(line: 119, column: 6, scope: !1003, inlinedAt: !1004)
!1003 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1004 = !DILocation(line: 376, column: 29, scope: !963)
!1005 = !DILocation(line: 119, column: 18, scope: !1003, inlinedAt: !1004)
!1006 = !DILocation(line: 123, column: 20, scope: !1003, inlinedAt: !1004)
!1007 = !DILocation(line: 123, column: 2, scope: !1003, inlinedAt: !1004)
!1008 = !DILocation(line: 377, column: 7, scope: !963)
!1009 = !DILocation(line: 377, column: 34, scope: !963)
!1010 = !DILocation(line: 377, column: 50, scope: !963)
!1011 = !DILocation(line: 119, column: 6, scope: !1012, inlinedAt: !1013)
!1012 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1013 = !DILocation(line: 377, column: 18, scope: !963)
!1014 = !DILocation(line: 119, column: 18, scope: !1012, inlinedAt: !1013)
!1015 = !DILocation(line: 123, column: 20, scope: !1012, inlinedAt: !1013)
!1016 = !DILocation(line: 123, column: 2, scope: !1012, inlinedAt: !1013)
!1017 = !DILocalVariable(name: "encoded_comment", scope: !188, file: !2, line: 473, type: !28, align: 64)
!1018 = !DILocation(line: 473, column: 10, scope: !188)
!1019 = !DILocation(line: 474, column: 7, scope: !188)
!1020 = !DILocalVariable(name: "res", scope: !1021, file: !2, line: 476, type: !28, align: 64)
!1021 = distinct !DILexicalBlock(scope: !188, file: !2, line: 475, column: 3)
!1022 = !DILocation(line: 476, column: 12, scope: !1021)
!1023 = !DILocation(line: 476, column: 35, scope: !1021)
!1024 = !DILocation(line: 476, column: 51, scope: !1021)
!1025 = !DILocation(line: 476, column: 18, scope: !1021)
!1026 = !DILocation(line: 477, column: 8, scope: !1021)
!1027 = !DILocation(line: 479, column: 23, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1021, file: !2, line: 478, column: 4)
!1029 = !DILocation(line: 480, column: 9, scope: !1028)
!1030 = !DILocation(line: 482, column: 22, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1028, file: !2, line: 481, column: 5)
!1032 = !DILocation(line: 482, column: 38, scope: !1031)
!1033 = !DILocation(line: 119, column: 6, scope: !1034, inlinedAt: !1035)
!1034 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1035 = !DILocation(line: 482, column: 6, scope: !1031)
!1036 = !DILocation(line: 119, column: 18, scope: !1034, inlinedAt: !1035)
!1037 = !DILocation(line: 123, column: 20, scope: !1034, inlinedAt: !1035)
!1038 = !DILocation(line: 123, column: 2, scope: !1034, inlinedAt: !1035)
!1039 = !DILocation(line: 367, column: 9, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!1041 = !DILocation(line: 367, column: 3, scope: !1040)
!1042 = !DILocation(line: 369, column: 21, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 369, column: 3)
!1044 = !DILocalVariable(name: ".temp", scope: !1043, file: !2, line: 369, type: !34, align: 64)
!1045 = !DILocalVariable(name: "entry", scope: !1046, file: !2, line: 369, type: !152, align: 64)
!1046 = distinct !DILexicalBlock(scope: !1043, file: !2, line: 370, column: 3)
!1047 = !DILocation(line: 369, column: 13, scope: !1046)
!1048 = !DILocation(line: 369, column: 21, scope: !1046)
!1049 = !DILocation(line: 399, column: 19, scope: !1046)
!1050 = !DILocation(line: 371, column: 20, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1046, file: !2, line: 370, column: 3)
!1052 = !DILocation(line: 371, column: 36, scope: !1051)
!1053 = !DILocation(line: 119, column: 6, scope: !1054, inlinedAt: !1055)
!1054 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1055 = !DILocation(line: 371, column: 4, scope: !1051)
!1056 = !DILocation(line: 119, column: 18, scope: !1054, inlinedAt: !1055)
!1057 = !DILocation(line: 123, column: 20, scope: !1054, inlinedAt: !1055)
!1058 = !DILocation(line: 123, column: 2, scope: !1054, inlinedAt: !1055)
!1059 = !DILocation(line: 373, column: 3, scope: !1040)
!1060 = !DILocation(line: 374, column: 19, scope: !1040)
!1061 = !DILocation(line: 374, column: 35, scope: !1040)
!1062 = !DILocation(line: 119, column: 6, scope: !1063, inlinedAt: !1064)
!1063 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1064 = !DILocation(line: 374, column: 3, scope: !1040)
!1065 = !DILocation(line: 119, column: 18, scope: !1063, inlinedAt: !1064)
!1066 = !DILocation(line: 123, column: 20, scope: !1063, inlinedAt: !1064)
!1067 = !DILocation(line: 123, column: 2, scope: !1063, inlinedAt: !1064)
!1068 = !DILocation(line: 375, column: 19, scope: !1040)
!1069 = !DILocation(line: 375, column: 35, scope: !1040)
!1070 = !DILocation(line: 119, column: 6, scope: !1071, inlinedAt: !1072)
!1071 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1072 = !DILocation(line: 375, column: 3, scope: !1040)
!1073 = !DILocation(line: 119, column: 18, scope: !1071, inlinedAt: !1072)
!1074 = !DILocation(line: 123, column: 20, scope: !1071, inlinedAt: !1072)
!1075 = !DILocation(line: 123, column: 2, scope: !1071, inlinedAt: !1072)
!1076 = !DILocation(line: 376, column: 7, scope: !1040)
!1077 = !DILocation(line: 376, column: 45, scope: !1040)
!1078 = !DILocation(line: 376, column: 61, scope: !1040)
!1079 = !DILocation(line: 119, column: 6, scope: !1080, inlinedAt: !1081)
!1080 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1081 = !DILocation(line: 376, column: 29, scope: !1040)
!1082 = !DILocation(line: 119, column: 18, scope: !1080, inlinedAt: !1081)
!1083 = !DILocation(line: 123, column: 20, scope: !1080, inlinedAt: !1081)
!1084 = !DILocation(line: 123, column: 2, scope: !1080, inlinedAt: !1081)
!1085 = !DILocation(line: 377, column: 7, scope: !1040)
!1086 = !DILocation(line: 377, column: 34, scope: !1040)
!1087 = !DILocation(line: 377, column: 50, scope: !1040)
!1088 = !DILocation(line: 119, column: 6, scope: !1089, inlinedAt: !1090)
!1089 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1090 = !DILocation(line: 377, column: 18, scope: !1040)
!1091 = !DILocation(line: 119, column: 18, scope: !1089, inlinedAt: !1090)
!1092 = !DILocation(line: 123, column: 20, scope: !1089, inlinedAt: !1090)
!1093 = !DILocation(line: 123, column: 2, scope: !1089, inlinedAt: !1090)
!1094 = !DILocalVariable(name: "eocd", scope: !188, file: !2, line: 489, type: !1095, align: 8)
!1095 = !DICompositeType(tag: DW_TAG_structure_type, name: "ZipEOCD", scope: !2, file: !2, line: 1041, size: 176, align: 8, elements: !1096, identifier: "std.compression.zip.ZipEOCD")
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1095, file: !2, line: 1043, baseType: !48, size: 32, align: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "disk_number", scope: !1095, file: !2, line: 1044, baseType: !14, size: 16, align: 16, offset: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "cd_disk_number", scope: !1095, file: !2, line: 1045, baseType: !14, size: 16, align: 16, offset: 48)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries_this_disk", scope: !1095, file: !2, line: 1046, baseType: !14, size: 16, align: 16, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !1095, file: !2, line: 1047, baseType: !14, size: 16, align: 16, offset: 80)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "cd_size", scope: !1095, file: !2, line: 1048, baseType: !48, size: 32, align: 32, offset: 96)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "cd_offset", scope: !1095, file: !2, line: 1049, baseType: !48, size: 32, align: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "comment_len", scope: !1095, file: !2, line: 1050, baseType: !14, size: 16, align: 16, offset: 160)
!1105 = !DILocation(line: 489, column: 11, scope: !188)
!1106 = !DILocation(line: 490, column: 21, scope: !188)
!1107 = !DILocation(line: 491, column: 42, scope: !188)
!1108 = !DILocation(line: 491, column: 73, scope: !188)
!1109 = !DILocation(line: 491, column: 90, scope: !188)
!1110 = !DILocation(line: 491, column: 82, scope: !188)
!1111 = !DILocation(line: 492, column: 32, scope: !188)
!1112 = !DILocation(line: 492, column: 63, scope: !188)
!1113 = !DILocation(line: 492, column: 80, scope: !188)
!1114 = !DILocation(line: 492, column: 72, scope: !188)
!1115 = !DILocation(line: 493, column: 26, scope: !188)
!1116 = !DILocation(line: 493, column: 50, scope: !188)
!1117 = !DILocation(line: 493, column: 63, scope: !188)
!1118 = !DILocation(line: 494, column: 28, scope: !188)
!1119 = !DILocation(line: 494, column: 54, scope: !188)
!1120 = !DILocation(line: 494, column: 67, scope: !188)
!1121 = !DILocation(line: 495, column: 23, scope: !188)
!1122 = !DILocation(line: 498, column: 17, scope: !188)
!1123 = !DILocation(line: 498, column: 28, scope: !188)
!1124 = !DILocation(line: 90, column: 34, scope: !1125, inlinedAt: !1127)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !495, line: 91, column: 1)
!1126 = distinct !DISubprogram(name: "write_any", linkageName: "write_any", scope: !495, file: !495, line: 90, scopeLine: 90, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1127 = !DILocation(line: 498, column: 3, scope: !188)
!1128 = !DILocation(line: 92, column: 28, scope: !1126, inlinedAt: !1127)
!1129 = !DILocation(line: 92, column: 41, scope: !1126, inlinedAt: !1127)
!1130 = !DILocation(line: 92, column: 27, scope: !1126, inlinedAt: !1127)
!1131 = !DILocation(line: 137, column: 6, scope: !1132, inlinedAt: !1133)
!1132 = distinct !DISubprogram(name: "write_all", linkageName: "write_all", scope: !495, file: !495, line: 135, scopeLine: 135, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21, retainedNodes: !46)
!1133 = !DILocation(line: 92, column: 9, scope: !1126, inlinedAt: !1127)
!1134 = !DILocation(line: 137, column: 30, scope: !1132, inlinedAt: !1133)
!1135 = !DILocalVariable(name: "n", scope: !1132, file: !2, line: 138, type: !34, align: 64)
!1136 = !DILocation(line: 138, column: 6, scope: !1132, inlinedAt: !1133)
!1137 = !DILocation(line: 138, column: 10, scope: !1132, inlinedAt: !1133)
!1138 = !DILocation(line: 138, column: 23, scope: !1132, inlinedAt: !1133)
!1139 = !DILocation(line: 167, column: 11, scope: !1132, inlinedAt: !1133)
!1140 = !DILocation(line: 139, column: 6, scope: !1132, inlinedAt: !1133)
!1141 = !DILocation(line: 139, column: 11, scope: !1132, inlinedAt: !1133)
!1142 = !DILocation(line: 139, column: 30, scope: !1132, inlinedAt: !1133)
!1143 = !DILocation(line: 140, column: 9, scope: !1132, inlinedAt: !1133)
!1144 = !DILocation(line: 487, column: 13, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !188, file: !2, line: 487, column: 9)
!1146 = !DILocation(line: 487, column: 50, scope: !1145)
!1147 = !DILocation(line: 119, column: 6, scope: !1148, inlinedAt: !1149)
!1148 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1149 = !DILocation(line: 487, column: 34, scope: !1145)
!1150 = !DILocation(line: 119, column: 18, scope: !1148, inlinedAt: !1149)
!1151 = !DILocation(line: 123, column: 20, scope: !1148, inlinedAt: !1149)
!1152 = !DILocation(line: 123, column: 2, scope: !1148, inlinedAt: !1149)
!1153 = !DILocation(line: 367, column: 9, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !158, file: !2, line: 366, column: 8)
!1155 = !DILocation(line: 367, column: 3, scope: !1154)
!1156 = !DILocation(line: 369, column: 21, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 369, column: 3)
!1158 = !DILocalVariable(name: ".temp", scope: !1157, file: !2, line: 369, type: !34, align: 64)
!1159 = !DILocalVariable(name: "entry", scope: !1160, file: !2, line: 369, type: !152, align: 64)
!1160 = distinct !DILexicalBlock(scope: !1157, file: !2, line: 370, column: 3)
!1161 = !DILocation(line: 369, column: 13, scope: !1160)
!1162 = !DILocation(line: 369, column: 21, scope: !1160)
!1163 = !DILocation(line: 399, column: 19, scope: !1160)
!1164 = !DILocation(line: 371, column: 20, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1160, file: !2, line: 370, column: 3)
!1166 = !DILocation(line: 371, column: 36, scope: !1165)
!1167 = !DILocation(line: 119, column: 6, scope: !1168, inlinedAt: !1169)
!1168 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1169 = !DILocation(line: 371, column: 4, scope: !1165)
!1170 = !DILocation(line: 119, column: 18, scope: !1168, inlinedAt: !1169)
!1171 = !DILocation(line: 123, column: 20, scope: !1168, inlinedAt: !1169)
!1172 = !DILocation(line: 123, column: 2, scope: !1168, inlinedAt: !1169)
!1173 = !DILocation(line: 373, column: 3, scope: !1154)
!1174 = !DILocation(line: 374, column: 19, scope: !1154)
!1175 = !DILocation(line: 374, column: 35, scope: !1154)
!1176 = !DILocation(line: 119, column: 6, scope: !1177, inlinedAt: !1178)
!1177 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1178 = !DILocation(line: 374, column: 3, scope: !1154)
!1179 = !DILocation(line: 119, column: 18, scope: !1177, inlinedAt: !1178)
!1180 = !DILocation(line: 123, column: 20, scope: !1177, inlinedAt: !1178)
!1181 = !DILocation(line: 123, column: 2, scope: !1177, inlinedAt: !1178)
!1182 = !DILocation(line: 375, column: 19, scope: !1154)
!1183 = !DILocation(line: 375, column: 35, scope: !1154)
!1184 = !DILocation(line: 119, column: 6, scope: !1185, inlinedAt: !1186)
!1185 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
!1186 = !DILocation(line: 375, column: 3, scope: !1154)
!1187 = !DILocation(line: 119, column: 18, scope: !1185, inlinedAt: !1186)
!1188 = !DILocation(line: 123, column: 20, scope: !1185, inlinedAt: !1186)
!1189 = !DILocation(line: 123, column: 2, scope: !1185, inlinedAt: !1186)
!1190 = !DILocation(line: 376, column: 7, scope: !1154)
!1191 = !DILocation(line: 376, column: 45, scope: !1154)
!1192 = !DILocation(line: 376, column: 61, scope: !1154)
!1193 = !DILocation(line: 119, column: 6, scope: !1194, inlinedAt: !1195)
!1194 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !206, file: !206, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !21)
