; ModuleID = 'std::thread::threadpool'
source_filename = "std::thread::threadpool"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%FixedThreadPool = type { %NativeMutex, %"QueueItem[]", i64, i64, i64, i8, %"NativeThread[]", [6 x i64], [6 x i64] }
%NativeMutex = type { [8 x i64], i8 }
%"QueueItem[]" = type { ptr, i64 }
%"NativeThread[]" = type { ptr, i64 }
%NativeThread = type { ptr, ptr, ptr }
%QueueItem = type { ptr, %"any[]" }

@"$ct.std.thread.threadpool.FixedThreadPool" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 232, i64 0, i64 9, [0 x i64] zeroinitializer }, align 8
@"$ct.std.thread.threadpool.QueueItem" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@.panic_msg = internal constant [33 x i8] c"Called a method on a null value.\00", align 1
@.file = internal constant [10 x i8] c"thread.c3\00", align 1
@.func = internal constant [13 x i8] c"process_work\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@.panic_msg.1 = internal constant [72 x i8] c"@require \22self.is_initialized()\22 violated: 'Mutex was not initialized'.\00", align 1

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "fixed_pool.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/threads")
!8 = distinct !DISubprogram(name: "init", linkageName: "std.thread.threadpool.FixedThreadPool.init", scope: !7, file: !7, line: 40, type: !9, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !83)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !11, !21, !21}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedThreadPool", scope: !7, file: !7, line: 11, size: 1856, align: 64, elements: !13, identifier: "std.thread.threadpool.FixedThreadPool")
!13 = !{!14, !26, !52, !53, !54, !55, !57, !76, !82}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !12, file: !7, line: 13, baseType: !15, size: 576, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mutex", scope: !7, file: !7, line: 11, baseType: !16, align: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeMutex", scope: !7, file: !7, line: 8, size: 576, align: 64, elements: !17, identifier: "std.thread.os.NativeMutex")
!17 = !{!18, !24}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !16, file: !7, line: 10, baseType: !19, size: 512, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_mutex_t", scope: !7, file: !7, line: 96, baseType: !20, align: 64)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, align: 64, elements: !22)
!21 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!22 = !{!23}
!23 = !DISubrange(count: 8, lowerBound: 0)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !16, file: !7, line: 11, baseType: !25, size: 8, align: 8, offset: 512)
!25 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !12, file: !7, line: 14, baseType: !27, size: 128, align: 64, offset: 576)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem[]", size: 128, align: 64, elements: !28, identifier: "QueueItem[]")
!28 = !{!29, !51}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem", scope: !7, file: !7, line: 29, size: 192, align: 64, elements: !32, identifier: "std.thread.threadpool.QueueItem")
!32 = !{!33, !50}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !31, file: !7, line: 31, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadPoolFn", scope: !7, file: !7, line: 9, baseType: !35, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38}
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !39, identifier: "any[]")
!39 = !{!40, !48}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !38, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !43, identifier: "any")
!43 = !{!44, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !38, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !21)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !31, file: !7, line: 32, baseType: !38, size: 128, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !27, baseType: !49, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "qindex", scope: !12, file: !7, line: 15, baseType: !49, size: 64, align: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "qworking", scope: !12, file: !7, line: 16, baseType: !49, size: 64, align: 64, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !12, file: !7, line: 17, baseType: !49, size: 64, align: 64, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, scope: !12, file: !7, line: 18, baseType: !56, size: 8, align: 8, offset: 896)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !12, file: !7, line: 24, baseType: !58, size: 128, align: 64, offset: 960)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread[]", size: 128, align: 64, elements: !59, identifier: "Thread[]")
!59 = !{!60, !75}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !58, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "Thread", scope: !7, file: !7, line: 16, baseType: !63, align: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeThread", scope: !7, file: !7, line: 18, size: 192, align: 64, elements: !64, identifier: "std.thread.os.NativeThread")
!64 = !{!65, !67, !74}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pthread", scope: !63, file: !7, line: 20, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_t", scope: !7, file: !7, line: 10, baseType: !45, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "thread_fn", scope: !63, file: !7, line: 21, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFn", scope: !7, file: !7, line: 20, baseType: !69, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !45}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !7, file: !7, line: 23, baseType: !73, align: 32)
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !63, file: !7, line: 22, baseType: !45, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !58, baseType: !49, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !12, file: !7, line: 25, baseType: !77, size: 384, align: 64, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConditionVariable", scope: !7, file: !7, line: 15, baseType: !78, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_cond_t", scope: !7, file: !7, line: 93, baseType: !79, align: 64)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 384, align: 64, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 6, lowerBound: 0)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "collect", scope: !12, file: !7, line: 26, baseType: !77, size: 384, align: 64, offset: 1472)
!83 = !{}
!84 = !DILocation(line: 41, column: 1, scope: !8)
!85 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 40, type: !11)
!86 = !DILocation(line: 40, column: 31, scope: !8)
!87 = !DILocalVariable(name: "threads", arg: 2, scope: !8, file: !7, line: 40, type: !49)
!88 = !DILocation(line: 40, column: 42, scope: !8)
!89 = !DILocalVariable(name: "queue_size", arg: 3, scope: !8, file: !7, line: 40, type: !49)
!90 = !DILocation(line: 40, column: 55, scope: !8)
!91 = !DILocation(line: 36, column: 12, scope: !92)
!92 = distinct !DILexicalBlock(scope: !8, file: !7, line: 41, column: 1)
!93 = !DILocation(line: 36, column: 11, scope: !92)
!94 = !DILocation(line: 37, column: 11, scope: !92)
!95 = !DILocation(line: 37, column: 26, scope: !92)
!96 = !DILocation(line: 38, column: 11, scope: !92)
!97 = !DILocation(line: 42, column: 6, scope: !8)
!98 = !DILocation(line: 42, column: 36, scope: !8)
!99 = !DILocation(line: 44, column: 9, scope: !8)
!100 = !DILocation(line: 46, column: 18, scope: !8)
!101 = !DILocation(line: 47, column: 18, scope: !8)
!102 = !DILocation(line: 958, column: 32, scope: !103, inlinedAt: !105)
!103 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !104, file: !104, line: 956, scopeLine: 956, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!104 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!105 = !DILocation(line: 48, column: 12, scope: !8)
!106 = !DILocation(line: 304, column: 55, scope: !107, inlinedAt: !109)
!107 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !108, file: !108, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!108 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!109 = !DILocation(line: 287, column: 9, scope: !110, inlinedAt: !111)
!110 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !108, file: !108, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!111 = !DILocation(line: 958, column: 9, scope: !103, inlinedAt: !105)
!112 = !DILocation(line: 304, column: 40, scope: !107, inlinedAt: !109)
!113 = !DILocation(line: 80, column: 6, scope: !114, inlinedAt: !115)
!114 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !108, file: !108, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!115 = !DILocation(line: 304, column: 18, scope: !107, inlinedAt: !109)
!116 = !DILocation(line: 80, column: 20, scope: !114, inlinedAt: !115)
!117 = !DILocation(line: 86, column: 28, scope: !114, inlinedAt: !115)
!118 = !DILocation(line: 38, column: 12, scope: !114, inlinedAt: !115)
!119 = !DILocation(line: 1039, column: 9, scope: !120, inlinedAt: !122)
!120 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !121, file: !121, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!121 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!122 = !DILocation(line: 38, column: 26, scope: !114, inlinedAt: !115)
!123 = !DILocation(line: 1039, column: 20, scope: !120, inlinedAt: !122)
!124 = !DILocation(line: 1039, column: 25, scope: !120, inlinedAt: !122)
!125 = !DILocation(line: 1039, column: 19, scope: !120, inlinedAt: !122)
!126 = !DILocation(line: 86, column: 10, scope: !114, inlinedAt: !115)
!127 = !DILocation(line: 304, column: 67, scope: !107, inlinedAt: !109)
!128 = !DILocation(line: 304, column: 9, scope: !107, inlinedAt: !109)
!129 = !DILocation(line: 938, column: 30, scope: !130, inlinedAt: !131)
