; ModuleID = 'std::core::mem'
source_filename = "std::core::mem"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

@.enum.NOT_ATOMIC = internal constant [11 x i8] c"NOT_ATOMIC\00", align 1
@.enum.UNORDERED = internal constant [10 x i8] c"UNORDERED\00", align 1
@.enum.RELAXED = internal constant [8 x i8] c"RELAXED\00", align 1
@.enum.ACQUIRE = internal constant [8 x i8] c"ACQUIRE\00", align 1
@.enum.RELEASE = internal constant [8 x i8] c"RELEASE\00", align 1
@.enum.ACQUIRE_RELEASE = internal constant [16 x i8] c"ACQUIRE_RELEASE\00", align 1
@.enum.SEQ_CONSISTENT = internal constant [15 x i8] c"SEQ_CONSISTENT\00", align 1
@"$ct.int" = linkonce global %.introspect { i8 2, i64 0, ptr null, i64 4, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!15 = distinct !DIGlobalVariable(name: "TB", linkageName: "std.core.mem.TB", scope: !2, file: !2, line: 14, type: !9, isLocal: false, isDefinition: true, align: 64)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "pagesize", linkageName: "os_pagesize.pagesize", scope: !2, file: !2, line: 30, type: !18, isLocal: true, isDefinition: true, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !9)
!19 = !{i32 2, !"Dwarf Version", i32 4}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{i32 2, !"wchar_size", i32 4}
!22 = !{i32 4, !"PIC Level", i32 2}
!23 = !{i32 1, !"uwtable", i32 1}
!24 = !{i32 2, !"frame-pointer", i32 1}
!25 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !26, splitDebugInlining: false)
!26 = !{!0, !4, !7, !10, !12, !14, !16}
!27 = distinct !DISubprogram(name: "os_pagesize", linkageName: "std.core.mem.os_pagesize", scope: !2, file: !2, line: 26, type: !28, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25)
!28 = !DISubroutineType(types: !29)
!29 = !{!18}
!30 = !DILocation(line: 31, column: 8, scope: !27)
!31 = !DILocation(line: 31, column: 25, scope: !27)
!32 = !DILocation(line: 32, column: 22, scope: !27)
!33 = distinct !DISubprogram(name: "aligned_offset", linkageName: "std.core.mem.aligned_offset", scope: !2, file: !2, line: 344, type: !34, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !36)
!34 = !DISubroutineType(types: !35)
!35 = !{!18, !9, !9}
!36 = !{}
!37 = !DILocalVariable(name: "offset", arg: 1, scope: !33, file: !2, line: 344, type: !18)
!38 = !DILocation(line: 344, column: 27, scope: !33)
!39 = !DILocalVariable(name: "alignment", arg: 2, scope: !33, file: !2, line: 344, type: !18)
!40 = !DILocation(line: 344, column: 39, scope: !33)
!41 = !DILocation(line: 1039, column: 9, scope: !42, inlinedAt: !44)
!42 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !43, file: !43, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!43 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!44 = !DILocation(line: 342, column: 11, scope: !45)
!45 = distinct !DILexicalBlock(scope: !33, file: !2, line: 345, column: 1)
!46 = !DILocation(line: 1039, column: 20, scope: !42, inlinedAt: !44)
!47 = !DILocation(line: 1039, column: 25, scope: !42, inlinedAt: !44)
!48 = !DILocation(line: 1039, column: 19, scope: !42, inlinedAt: !44)
!49 = !DILocation(line: 346, column: 10, scope: !33)
!50 = !DILocation(line: 346, column: 19, scope: !33)
!51 = !DILocation(line: 346, column: 38, scope: !33)
!52 = !DILocation(line: 346, column: 9, scope: !33)
!53 = distinct !DISubprogram(name: "ptr_is_aligned", linkageName: "std.core.mem.ptr_is_aligned", scope: !2, file: !2, line: 357, type: !54, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !36)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !57, !9}
!56 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DILocalVariable(name: "ptr", arg: 1, scope: !53, file: !2, line: 357, type: !57)
!59 = !DILocation(line: 357, column: 30, scope: !53)
!60 = !DILocalVariable(name: "alignment", arg: 2, scope: !53, file: !2, line: 357, type: !18)
!61 = !DILocation(line: 357, column: 39, scope: !53)
!62 = !DILocation(line: 1039, column: 9, scope: !63, inlinedAt: !64)
!63 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !43, file: !43, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!64 = !DILocation(line: 355, column: 11, scope: !65)
!65 = distinct !DILexicalBlock(scope: !53, file: !2, line: 358, column: 1)
!66 = !DILocation(line: 1039, column: 20, scope: !63, inlinedAt: !64)
!67 = !DILocation(line: 1039, column: 25, scope: !63, inlinedAt: !64)
!68 = !DILocation(line: 1039, column: 19, scope: !63, inlinedAt: !64)
!69 = !DILocation(line: 359, column: 9, scope: !53)
!70 = !DILocation(line: 359, column: 22, scope: !53)
!71 = distinct !DISubprogram(name: "ptr_is_page_aligned", linkageName: "std.core.mem.ptr_is_page_aligned", scope: !2, file: !2, line: 362, type: !72, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !36)
!72 = !DISubroutineType(types: !73)
!73 = !{!56, !57}
!74 = !DILocalVariable(name: "ptr", arg: 1, scope: !71, file: !2, line: 362, type: !57)
!75 = !DILocation(line: 362, column: 35, scope: !71)
!76 = !DILocation(line: 364, column: 9, scope: !71)
!77 = !DILocation(line: 364, column: 22, scope: !71)
!78 = distinct !DISubprogram(name: "temp_push", linkageName: "std.core.mem.temp_push", scope: !2, file: !2, line: 632, type: !79, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25)
!79 = !DISubroutineType(types: !80)
!80 = !{!81}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 496, baseType: !82, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64, dwarfAddressSpace: 0)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !84, identifier: "std.core.mem.allocator.TempAllocator")
!84 = !{!85, !91, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !83, file: !2, line: 33, baseType: !86, size: 128, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !87, identifier: "Allocator")
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !86, baseType: !57, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !83, file: !2, line: 34, baseType: !92, size: 64, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !94, identifier: "std.core.mem.allocator.TempAllocatorPage")
!94 = !{!95, !96, !97, !98, !99}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !93, file: !2, line: 56, baseType: !92, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !93, file: !2, line: 57, baseType: !57, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !2, line: 58, baseType: !18, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !93, file: !2, line: 59, baseType: !18, size: 64, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !2, line: 60, baseType: !100, align: 8, offset: 256)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, align: 8, elements: !102)
!101 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!102 = !{!103}
!103 = !DISubrange(count: 0, lowerBound: 0)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !83, file: !2, line: 35, baseType: !82, size: 64, align: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !83, file: !2, line: 36, baseType: !56, size: 8, align: 8, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !83, file: !2, line: 37, baseType: !18, size: 64, align: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !83, file: !2, line: 38, baseType: !18, size: 64, align: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !83, file: !2, line: 39, baseType: !18, size: 64, align: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !83, file: !2, line: 40, baseType: !18, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !83, file: !2, line: 41, baseType: !18, size: 64, align: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !83, file: !2, line: 42, baseType: !18, size: 64, align: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !2, line: 43, baseType: !100, align: 8, offset: 704)
!113 = !DILocation(line: 634, column: 9, scope: !78)
!114 = distinct !DISubprogram(name: "temp_pop", linkageName: "std.core.mem.temp_pop", scope: !2, file: !2, line: 640, type: !115, scopeLine: 640, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !36)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !81}
!117 = !DILocalVariable(name: "old_state", arg: 1, scope: !114, file: !2, line: 640, type: !81)
!118 = !DILocation(line: 640, column: 28, scope: !114)
!119 = !DILocation(line: 642, column: 22, scope: !114)
!120 = !DILocation(line: 642, column: 2, scope: !114)
!121 = distinct !DISubprogram(name: "malloc", linkageName: "std.core.mem.malloc", scope: !2, file: !2, line: 759, type: !122, scopeLine: 759, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !36)
!122 = !DISubroutineType(types: !123)
!123 = !{!57, !9}
!124 = !DILocalVariable(name: "size", arg: 1, scope: !121, file: !2, line: 759, type: !18)
!125 = !DILocation(line: 759, column: 21, scope: !121)
!126 = !DILocation(line: 761, column: 27, scope: !121)
!127 = !DILocation(line: 80, column: 6, scope: !128, inlinedAt: !130)
!128 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !129, file: !129, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!129 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!130 = !DILocation(line: 75, column: 9, scope: !131, inlinedAt: !132)
!131 = distinct !DISubprogram(name: "malloc", linkageName: "malloc", scope: !129, file: !129, line: 73, scopeLine: 73, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!132 = !DILocation(line: 761, column: 9, scope: !121)
!133 = !DILocation(line: 80, column: 20, scope: !128, inlinedAt: !130)
!134 = !DILocation(line: 86, column: 28, scope: !128, inlinedAt: !130)
!135 = !DILocation(line: 38, column: 12, scope: !128, inlinedAt: !130)
!136 = !DILocation(line: 1039, column: 9, scope: !137, inlinedAt: !138)
!137 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !43, file: !43, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!138 = !DILocation(line: 38, column: 26, scope: !128, inlinedAt: !130)
!139 = !DILocation(line: 1039, column: 20, scope: !137, inlinedAt: !138)
!140 = !DILocation(line: 1039, column: 25, scope: !137, inlinedAt: !138)
!141 = !DILocation(line: 1039, column: 19, scope: !137, inlinedAt: !138)
!142 = !DILocation(line: 86, column: 10, scope: !128, inlinedAt: !130)
!143 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "std.core.mem.malloc_aligned", scope: !2, file: !2, line: 768, type: !144, scopeLine: 768, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !25, retainedNodes: !36)
!144 = !DISubroutineType(types: !145)
!145 = !{!57, !9, !9}
!146 = !DILocalVariable(name: "size", arg: 1, scope: !143, file: !2, line: 768, type: !18)
!147 = !DILocation(line: 768, column: 29, scope: !143)
!148 = !DILocalVariable(name: "alignment", arg: 2, scope: !143, file: !2, line: 768, type: !18)
!149 = !DILocation(line: 768, column: 39, scope: !143)
!150 = !DILocation(line: 770, column: 35, scope: !143)
!151 = !DILocation(line: 128, column: 6, scope: !152, inlinedAt: !153)
!152 = distinct !DISubprogram(name: "malloc_aligned", linkageName: "malloc_aligned", scope: !129, file: !129, line: 126, scopeLine: 126, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25)
!153 = !DILocation(line: 770, column: 9, scope: !143)
!154 = !DILocation(line: 128, column: 20, scope: !152, inlinedAt: !153)
!155 = !DILocation(line: 134, column: 28, scope: !152, inlinedAt: !153)
!156 = !DILocation(line: 134, column: 43, scope: !152, inlinedAt: !153)
!157 = !DILocation(line: 38, column: 12, scope: !152, inlinedAt: !153)
