; ModuleID = 'std::core::runtime'
source_filename = "std::core::runtime"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"HashMap{String, uint}" = type { %"Entry{String, uint}*[]", %any, i32, i32, float }
%"Entry{String, uint}*[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"fn void()[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%"BenchmarkUnit[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%BenchmarkUnit = type { %"char[]", ptr }
%"HashMapIterator{String, uint}" = type { ptr, i32, i32, ptr }
%"TestUnit[]" = type { ptr, i64 }
%TestUnit = type { %"char[]", ptr }
%TestContext = type { [25 x i64], %"char[]", i8, i32, i8, i8, i8, i8, i8, i8, i8, %"char[]", ptr, ptr, ptr, i64, %File, %stored }
%File = type { ptr }
%stored = type { %File, %File, %any }
%TrackingAllocator = type { %any, %"HashMap{ulong, Allocation}", i64, i64, i64, i64 }
%"HashMap{ulong, Allocation}" = type { %"Entry{ulong, Allocation}*[]", %any, i32, i32, float }
%"Entry{ulong, Allocation}*[]" = type { ptr, i64 }

@"$ct.std.core.runtime.BenchmarkUnit" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "bench_fn_iters", linkageName: "std.core.runtime.bench_fn_iters.4128", scope: !2, file: !2, line: 6, type: !3, isLocal: true, isDefinition: true, align: 64)
!2 = !DIFile(filename: "runtime_benchmark.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap{String, uint}", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !4, identifier: "std.collections.map.HashMap$String$uint$")
!4 = !{!5, !28, !35, !36, !37}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !3, file: !2, line: 31, baseType: !6, size: 128, align: 64)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{String, uint}*[]", size: 128, align: 64, elements: !7, identifier: "Entry{String, uint}*[]")
!7 = !{!8, !27}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !6, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{String, uint}", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !12, identifier: "std.collections.map.Entry$String$uint$")
!12 = !{!13, !15, !25, !26}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !11, file: !2, line: 23, baseType: !14, size: 32, align: 32)
!14 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !11, file: !2, line: 24, baseType: !16, size: 128, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !18, identifier: "char[]")
!18 = !{!19, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !17, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !17, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !24)
!24 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !11, file: !2, line: 25, baseType: !14, size: 32, align: 32, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !2, line: 26, baseType: !10, size: 64, align: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !6, baseType: !23, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 32, baseType: !29, size: 128, align: 64, offset: 128)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !30, identifier: "Allocator")
!30 = !{!31, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !29, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !29, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !3, file: !2, line: 34, baseType: !14, size: 32, align: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !3, file: !2, line: 36, baseType: !14, size: 32, align: 32, offset: 288)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !3, file: !2, line: 37, baseType: !38, size: 32, align: 32, offset: 320)
!38 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_WARMUP_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS", scope: !2, file: !2, line: 27, type: !41, isLocal: false, isDefinition: true, align: 32)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_MAX_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_MAX_ITERATIONS", scope: !2, file: !2, line: 28, type: !41, isLocal: false, isDefinition: true, align: 32)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "benchmark_warmup_iterations", linkageName: "std.core.runtime.benchmark_warmup_iterations", scope: !2, file: !2, line: 30, type: !14, isLocal: true, isDefinition: true, align: 32)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "benchmark_max_iterations", linkageName: "std.core.runtime.benchmark_max_iterations", scope: !2, file: !2, line: 31, type: !14, isLocal: true, isDefinition: true, align: 32)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "benchmark_clock", linkageName: "std.core.runtime.benchmark_clock.4151", scope: !2, file: !2, line: 52, type: !50, isLocal: true, isDefinition: true, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", scope: !2, file: !2, line: 6, baseType: !24, align: 64)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "benchmark_nano_seconds", linkageName: "std.core.runtime.benchmark_nano_seconds.4152", scope: !2, file: !2, line: 53, type: !53, isLocal: true, isDefinition: true, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "NanoDuration", scope: !2, file: !2, line: 7, baseType: !54, align: 64)
!54 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "cycle_start", linkageName: "std.core.runtime.cycle_start.4153", scope: !2, file: !2, line: 54, type: !54, isLocal: true, isDefinition: true, align: 64)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "cycle_stop", linkageName: "std.core.runtime.cycle_stop.4154", scope: !2, file: !2, line: 55, type: !54, isLocal: true, isDefinition: true, align: 64)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "benchmark_log", linkageName: "std.core.runtime.benchmark_log.4155", scope: !2, file: !2, line: 56, type: !61, isLocal: true, isDefinition: true, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !62, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64, dwarfAddressSpace: 0)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 8)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "benchmark_warming", linkageName: "std.core.runtime.benchmark_warming.4156", scope: !2, file: !2, line: 57, type: !66, isLocal: true, isDefinition: true, align: 8)
!66 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "this_iteration", linkageName: "std.core.runtime.this_iteration.4157", scope: !2, file: !2, line: 58, type: !14, isLocal: true, isDefinition: true, align: 32)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "benchmark_stop", linkageName: "std.core.runtime.benchmark_stop.4158", scope: !2, file: !2, line: 59, type: !66, isLocal: true, isDefinition: true, align: 8)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "test_context", linkageName: "std.core.runtime.test_context", scope: !73, file: !73, line: 12, type: !74, isLocal: true, isDefinition: true, align: 64)
!73 = !DIFile(filename: "runtime_test.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestContext", scope: !73, file: !73, line: 14, size: 2560, align: 64, elements: !76, identifier: "std.core.runtime.TestContext")
!76 = !{!77, !82, !83, !84, !93, !94, !95, !96, !97, !98, !99, !100, !101, !106, !107, !108, !109, !114}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !75, file: !73, line: 16, baseType: !78, size: 1600, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "JmpBuf", scope: !73, file: !73, line: 55, baseType: !79, align: 64)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1600, align: 64, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 25, lowerBound: 0)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "test_filter", scope: !75, file: !73, line: 18, baseType: !16, size: 128, align: 64, offset: 1600)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_on_assert", scope: !75, file: !73, line: 20, baseType: !66, size: 8, align: 8, offset: 1728)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !75, file: !73, line: 22, baseType: !85, size: 32, align: 32, offset: 1760)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LogPriority", scope: !75, file: !73, line: 30, baseType: !41, size: 32, align: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92}
!87 = !DIEnumerator(name: "VERBOSE", value: 0)
!88 = !DIEnumerator(name: "DEBUG", value: 1)
!89 = !DIEnumerator(name: "INFO", value: 2)
!90 = !DIEnumerator(name: "WARN", value: 3)
!91 = !DIEnumerator(name: "ERROR", value: 4)
!92 = !DIEnumerator(name: "CRITICAL", value: 5)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "assert_print_backtrace", scope: !75, file: !73, line: 25, baseType: !66, size: 8, align: 8, offset: 1792)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "has_ansi_codes", scope: !75, file: !73, line: 26, baseType: !66, size: 8, align: 8, offset: 1800)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "is_in_panic", scope: !75, file: !73, line: 27, baseType: !66, size: 8, align: 8, offset: 1808)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "is_quiet_mode", scope: !75, file: !73, line: 28, baseType: !66, size: 8, align: 8, offset: 1816)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "is_no_capture", scope: !75, file: !73, line: 29, baseType: !66, size: 8, align: 8, offset: 1824)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !75, file: !73, line: 30, baseType: !66, size: 8, align: 8, offset: 1832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "check_leaks", scope: !75, file: !73, line: 31, baseType: !66, size: 8, align: 8, offset: 1840)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "current_test_name", scope: !75, file: !73, line: 32, baseType: !16, size: 128, align: 64, offset: 1856)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "setup_fn", scope: !75, file: !73, line: 33, baseType: !102, size: 64, align: 64, offset: 1984)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "TestFn", scope: !73, file: !73, line: 10, baseType: !103, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!104 = !DISubroutineType(types: !105)
!105 = !{null}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "teardown_fn", scope: !75, file: !73, line: 34, baseType: !102, size: 64, align: 64, offset: 2048)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "error_buffer", scope: !75, file: !73, line: 36, baseType: !20, size: 64, align: 64, offset: 2112)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "error_buffer_capacity", scope: !75, file: !73, line: 37, baseType: !23, size: 64, align: 64, offset: 2176)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "fake_stdout", scope: !75, file: !73, line: 38, baseType: !110, size: 64, align: 64, offset: 2240)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !75, file: !73, line: 4, size: 64, align: 64, elements: !111, identifier: "std.io.File")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !110, file: !73, line: 6, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !73, file: !73, line: 362, baseType: !32, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "stored", scope: !75, file: !73, line: 39, baseType: !115, size: 256, align: 64, offset: 2304)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestContext.stored", scope: !75, file: !73, line: 39, size: 256, align: 64, elements: !116, identifier: "std.core.runtime.TestContext.stored")
!116 = !{!117, !118, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "stdout", scope: !115, file: !73, line: 41, baseType: !110, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "stderr", scope: !115, file: !73, line: 42, baseType: !110, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !115, file: !73, line: 43, baseType: !29, size: 128, align: 64, offset: 128)
!120 = !{i32 2, !"Dwarf Version", i32 4}
!121 = !{i32 2, !"Debug Info Version", i32 3}
!122 = !{i32 2, !"wchar_size", i32 4}
!123 = !{i32 4, !"PIC Level", i32 2}
!124 = !{i32 1, !"uwtable", i32 1}
!125 = !{i32 2, !"frame-pointer", i32 1}
!126 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !127, globals: !128, splitDebugInlining: false)
!127 = !{!85}
!128 = !{!0, !39, !42, !44, !46, !48, !51, !55, !57, !59, !64, !67, !69, !71}
!129 = distinct !DISubprogram(name: "benchmark_collection_create", linkageName: "std.core.runtime.benchmark_collection_create", scope: !2, file: !2, line: 14, type: !130, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !126, retainedNodes: !142)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !29}
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit[]", size: 128, align: 64, elements: !133, identifier: "BenchmarkUnit[]")
!133 = !{!134, !141}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !132, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit", scope: !2, file: !2, line: 8, size: 192, align: 64, elements: !137, identifier: "std.core.runtime.BenchmarkUnit")
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !2, line: 10, baseType: !16, size: 128, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !136, file: !2, line: 11, baseType: !140, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "BenchmarkFn", scope: !2, file: !2, line: 4, baseType: !103, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !132, baseType: !23, size: 64, align: 64, offset: 64)
!142 = !{}
!143 = !DILocalVariable(name: "allocator", arg: 1, scope: !129, file: !2, line: 14, type: !29)
!144 = !DILocation(line: 14, column: 58, scope: !129)
!145 = !DILocalVariable(name: "fns", scope: !129, file: !2, line: 16, type: !146, align: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkFn[]", size: 128, align: 64, elements: !147, identifier: "BenchmarkFn[]")
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !146, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !146, baseType: !23, size: 64, align: 64, offset: 64)
!151 = !DILocation(line: 16, column: 16, scope: !129)
!152 = !DILocation(line: 16, column: 22, scope: !129)
!153 = !DILocalVariable(name: "names", scope: !129, file: !2, line: 17, type: !154, align: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !155, identifier: "String[]")
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !154, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !154, baseType: !23, size: 64, align: 64, offset: 64)
!159 = !DILocation(line: 17, column: 11, scope: !129)
!160 = !DILocation(line: 17, column: 19, scope: !129)
!161 = !DILocalVariable(name: "benchmarks", scope: !129, file: !2, line: 18, type: !132, align: 64)
!162 = !DILocation(line: 18, column: 18, scope: !129)
!163 = !DILocation(line: 18, column: 80, scope: !129)
!164 = !DILocation(line: 304, column: 55, scope: !165, inlinedAt: !167)
!165 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !166, file: !166, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!166 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!167 = !DILocation(line: 287, column: 9, scope: !168, inlinedAt: !169)
!168 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !166, file: !166, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!169 = !DILocation(line: 18, column: 31, scope: !129)
!170 = !DILocation(line: 304, column: 40, scope: !165, inlinedAt: !167)
!171 = !DILocation(line: 80, column: 6, scope: !172, inlinedAt: !173)
!172 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !166, file: !166, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!173 = !DILocation(line: 304, column: 18, scope: !165, inlinedAt: !167)
!174 = !DILocation(line: 80, column: 20, scope: !172, inlinedAt: !173)
!175 = !DILocation(line: 86, column: 28, scope: !172, inlinedAt: !173)
!176 = !DILocation(line: 38, column: 12, scope: !172, inlinedAt: !173)
!177 = !DILocation(line: 1039, column: 9, scope: !178, inlinedAt: !180)
!178 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !179, file: !179, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!179 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!180 = !DILocation(line: 38, column: 26, scope: !172, inlinedAt: !173)
!181 = !DILocation(line: 1039, column: 20, scope: !178, inlinedAt: !180)
!182 = !DILocation(line: 1039, column: 25, scope: !178, inlinedAt: !180)
!183 = !DILocation(line: 1039, column: 19, scope: !178, inlinedAt: !180)
!184 = !DILocation(line: 86, column: 10, scope: !172, inlinedAt: !173)
!185 = !DILocation(line: 304, column: 67, scope: !165, inlinedAt: !167)
!186 = !DILocation(line: 304, column: 9, scope: !165, inlinedAt: !167)
!187 = !DILocation(line: 19, column: 26, scope: !188)
!188 = distinct !DILexicalBlock(scope: !129, file: !2, line: 19, column: 2)
!189 = !DILocalVariable(name: ".temp", scope: !188, file: !2, line: 19, type: !23, align: 64)
!190 = !DILocation(line: 19, column: 11, scope: !188)
!191 = !DILocalVariable(name: "i", scope: !192, file: !2, line: 19, type: !23, align: 64)
!192 = distinct !DILexicalBlock(scope: !188, file: !2, line: 20, column: 2)
!193 = !DILocation(line: 19, column: 11, scope: !192)
!194 = !DILocalVariable(name: "benchmark", scope: !192, file: !2, line: 19, type: !140, align: 64)
!195 = !DILocation(line: 19, column: 14, scope: !192)
!196 = !DILocation(line: 19, column: 26, scope: !192)
!197 = !DILocation(line: 21, column: 21, scope: !198)
!198 = distinct !DILexicalBlock(scope: !192, file: !2, line: 20, column: 2)
!199 = !DILocation(line: 21, column: 27, scope: !198)
!200 = !DILocation(line: 21, column: 31, scope: !198)
!201 = !DILocation(line: 21, column: 35, scope: !198)
!202 = !DILocation(line: 21, column: 3, scope: !198)
!203 = !DILocation(line: 21, column: 14, scope: !198)
!204 = !DILocation(line: 22, column: 31, scope: !198)
!205 = !DILocation(line: 22, column: 37, scope: !198)
!206 = !DILocation(line: 22, column: 8, scope: !198)
!207 = !DILocation(line: 22, column: 69, scope: !198)
!208 = !DILocation(line: 22, column: 57, scope: !198)
!209 = !DILocation(line: 22, column: 63, scope: !198)
!210 = !DILocation(line: 22, column: 42, scope: !198)
!211 = !DILocation(line: 24, column: 9, scope: !129)
!212 = distinct !DISubprogram(name: "set_benchmark_warmup_iterations", linkageName: "std.core.runtime.set_benchmark_warmup_iterations", scope: !2, file: !2, line: 33, type: !213, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !126, retainedNodes: !142)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !14}
!215 = !DILocalVariable(name: "value", arg: 1, scope: !212, file: !2, line: 33, type: !14)
!216 = !DILocation(line: 33, column: 46, scope: !212)
!217 = !DILocation(line: 35, column: 35, scope: !212)
!218 = distinct !DISubprogram(name: "set_benchmark_max_iterations", linkageName: "std.core.runtime.set_benchmark_max_iterations", scope: !2, file: !2, line: 38, type: !213, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !126, retainedNodes: !142)
!219 = !DILocalVariable(name: "value", arg: 1, scope: !218, file: !2, line: 38, type: !14)
!220 = !DILocation(line: 38, column: 43, scope: !218)
!221 = !DILocation(line: 40, column: 12, scope: !218)
!222 = !DILocation(line: 41, column: 32, scope: !218)
!223 = !DILocalVariable(name: ".temp", scope: !224, file: !2, line: 42, type: !225, align: 64)
!224 = distinct !DILexicalBlock(scope: !218, file: !2, line: 42, column: 2)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashMapKeyIterator{String, uint}", scope: !2, file: !2, line: 557, baseType: !226, align: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMapIterator{String, uint}", scope: !2, file: !2, line: 548, size: 192, align: 64, elements: !227, identifier: "std.collections.map.HashMapIterator$String$uint$")
!227 = !{!228, !230, !231, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !226, file: !2, line: 550, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "top_index", scope: !226, file: !2, line: 551, baseType: !41, size: 32, align: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !226, file: !2, line: 552, baseType: !41, size: 32, align: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "current_entry", scope: !226, file: !2, line: 553, baseType: !10, size: 64, align: 64, offset: 128)
!233 = !DILocation(line: 42, column: 15, scope: !224)
!234 = !DILocalVariable(name: ".temp", scope: !224, file: !2, line: 42, type: !23, align: 64)
!235 = !DILocalVariable(name: "k", scope: !236, file: !2, line: 42, type: !16, align: 64)
!236 = distinct !DILexicalBlock(scope: !224, file: !2, line: 42, column: 42)
!237 = !DILocation(line: 42, column: 11, scope: !236)
!238 = !DILocation(line: 42, column: 15, scope: !236)
!239 = !DILocation(line: 42, column: 62, scope: !236)
!240 = !DILocation(line: 42, column: 42, scope: !236)
!241 = distinct !DISubprogram(name: "set_benchmark_func_iterations", linkageName: "std.core.runtime.set_benchmark_func_iterations", scope: !2, file: !2, line: 45, type: !242, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !126, retainedNodes: !142)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !16, !14}
!244 = !DILocalVariable(name: "func", arg: 1, scope: !241, file: !2, line: 45, type: !16)
!245 = !DILocation(line: 45, column: 46, scope: !241)
!246 = !DILocalVariable(name: "value", arg: 2, scope: !241, file: !2, line: 45, type: !14)
!247 = !DILocation(line: 45, column: 57, scope: !241)
!248 = !DILocation(line: 47, column: 9, scope: !241)
!249 = !DILocation(line: 48, column: 25, scope: !241)
!250 = !DILocation(line: 48, column: 2, scope: !241)
!251 = distinct !DISubprogram(name: "run_benchmarks", linkageName: "std.core.runtime.run_benchmarks", scope: !2, file: !2, line: 87, type: !252, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !126, retainedNodes: !142)
!252 = !DISubroutineType(types: !253)
!253 = !{!66, !132}
!254 = !DILocalVariable(name: "benchmarks", arg: 1, scope: !251, file: !2, line: 87, type: !132)
!255 = !DILocation(line: 87, column: 40, scope: !251)
!256 = !DILocalVariable(name: "max_name", scope: !251, file: !2, line: 89, type: !23, align: 64)
!257 = !DILocation(line: 89, column: 6, scope: !251)
!258 = !DILocation(line: 91, column: 19, scope: !259)
!259 = distinct !DILexicalBlock(scope: !251, file: !2, line: 91, column: 2)
!260 = !DILocalVariable(name: ".temp", scope: !259, file: !2, line: 91, type: !23, align: 64)
!261 = !DILocalVariable(name: "unit", scope: !262, file: !2, line: 91, type: !135, align: 64)
!262 = distinct !DILexicalBlock(scope: !259, file: !2, line: 92, column: 2)
!263 = !DILocation(line: 91, column: 12, scope: !262)
!264 = !DILocation(line: 91, column: 19, scope: !262)
!265 = !DILocation(line: 93, column: 7, scope: !266)
!266 = distinct !DILexicalBlock(scope: !262, file: !2, line: 92, column: 2)
!267 = !DILocation(line: 93, column: 18, scope: !266)
!268 = !DILocation(line: 93, column: 44, scope: !266)
!269 = !DILocalVariable(name: "len", scope: !251, file: !2, line: 96, type: !23, align: 64)
!270 = !DILocation(line: 96, column: 6, scope: !251)
!271 = !DILocation(line: 96, column: 12, scope: !251)
!272 = !DILocalVariable(name: "name", scope: !251, file: !2, line: 98, type: !61, align: 64)
!273 = !DILocation(line: 98, column: 10, scope: !251)
!274 = !DILocation(line: 98, column: 17, scope: !251)
!275 = !DILocation(line: 99, column: 26, scope: !251)
!276 = !DILocation(line: 99, column: 2, scope: !251)
!277 = !DILocation(line: 417, column: 27, scope: !278, inlinedAt: !281)
!278 = distinct !DILexicalBlock(scope: !280, file: !279, line: 418, column: 1)
!279 = !DIFile(filename: "dstring.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!280 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !279, file: !279, line: 417, scopeLine: 417, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!281 = !DILocation(line: 100, column: 2, scope: !251)
!282 = !DILocation(line: 336, column: 34, scope: !283, inlinedAt: !285)
!283 = distinct !DILexicalBlock(scope: !284, file: !279, line: 337, column: 1)
!284 = distinct !DISubprogram(name: "append_string", linkageName: "append_string", scope: !279, file: !279, line: 336, scopeLine: 336, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!285 = !DILocation(line: 427, column: 4, scope: !280, inlinedAt: !281)
!286 = !DILocation(line: 341, column: 21, scope: !284, inlinedAt: !285)
!287 = !DILocation(line: 341, column: 3, scope: !284, inlinedAt: !285)
!288 = !DILocation(line: 101, column: 26, scope: !251)
!289 = !DILocation(line: 101, column: 32, scope: !251)
!290 = !DILocation(line: 101, column: 2, scope: !251)
!291 = !DILocation(line: 264, column: 16, scope: !292, inlinedAt: !294)
!292 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !293, file: !293, line: 262, scopeLine: 262, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!293 = !DIFile(filename: "io.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io")
!294 = !DILocation(line: 103, column: 2, scope: !251)
!295 = !DILocalVariable(name: "len", scope: !296, file: !2, line: 238, type: !23, align: 64)
!296 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !293, file: !293, line: 236, scopeLine: 236, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!297 = !DILocation(line: 238, column: 6, scope: !296, inlinedAt: !298)
!298 = !DILocation(line: 264, column: 2, scope: !292, inlinedAt: !294)
!299 = !DILocation(line: 184, column: 25, scope: !300, inlinedAt: !301)
!300 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !293, file: !293, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!301 = !DILocation(line: 238, column: 12, scope: !296, inlinedAt: !298)
!302 = !DILocation(line: 184, column: 35, scope: !300, inlinedAt: !301)
!303 = !DILocation(line: 167, column: 11, scope: !300, inlinedAt: !301)
!304 = !DILocation(line: 239, column: 2, scope: !296, inlinedAt: !298)
!305 = !DILocation(line: 108, column: 11, scope: !296, inlinedAt: !298)
!306 = !DILocation(line: 244, column: 4, scope: !296, inlinedAt: !298)
!307 = !DILocation(line: 247, column: 11, scope: !296, inlinedAt: !298)
!308 = !DILocation(line: 246, column: 9, scope: !296, inlinedAt: !298)
!309 = !DILocation(line: 105, column: 2, scope: !251)
!310 = !DILocation(line: 107, column: 18, scope: !311)
!311 = distinct !DILexicalBlock(scope: !251, file: !2, line: 107, column: 2)
!312 = !DILocalVariable(name: ".temp", scope: !311, file: !2, line: 107, type: !23, align: 64)
!313 = !DILocalVariable(name: "unit", scope: !314, file: !2, line: 107, type: !136, align: 64)
!314 = distinct !DILexicalBlock(scope: !311, file: !2, line: 108, column: 2)
!315 = !DILocation(line: 107, column: 11, scope: !314)
!316 = !DILocation(line: 107, column: 18, scope: !314)
!317 = !DILocation(line: 110, column: 36, scope: !318)
!318 = distinct !DILexicalBlock(scope: !314, file: !2, line: 108, column: 2)
!319 = !DILocation(line: 110, column: 3, scope: !318)
!320 = !DILocation(line: 111, column: 27, scope: !318)
!321 = !DILocation(line: 111, column: 38, scope: !318)
!322 = !DILocation(line: 111, column: 3, scope: !318)
!323 = !DILocation(line: 112, column: 21, scope: !318)
!324 = !DILocation(line: 112, column: 3, scope: !318)
!325 = !DILocation(line: 114, column: 23, scope: !318)
!326 = !DILocalVariable(name: "i", scope: !327, file: !2, line: 115, type: !14, align: 32)
!327 = distinct !DILexicalBlock(scope: !318, file: !2, line: 115, column: 3)
!328 = !DILocation(line: 115, column: 13, scope: !327)
!329 = !DILocation(line: 115, column: 17, scope: !327)
!330 = !DILocation(line: 115, column: 20, scope: !327)
!331 = !DILocation(line: 115, column: 24, scope: !327)
!332 = !DILocation(line: 117, column: 4, scope: !333)
!333 = distinct !DILexicalBlock(scope: !327, file: !2, line: 116, column: 3)
!334 = !DILocation(line: 115, column: 53, scope: !327)
!335 = !DILocation(line: 119, column: 23, scope: !318)
!336 = !DILocalVariable(name: "running_timer", scope: !318, file: !2, line: 121, type: !53, align: 64)
!337 = !DILocation(line: 121, column: 16, scope: !318)
!338 = !DILocalVariable(name: "total_clocks", scope: !318, file: !2, line: 122, type: !54, align: 64)
!339 = !DILocation(line: 122, column: 8, scope: !318)
!340 = !DILocalVariable(name: "current_benchmark_iterations", scope: !318, file: !2, line: 124, type: !14, align: 32)
!341 = !DILocation(line: 124, column: 8, scope: !318)
!342 = !DILocation(line: 124, column: 39, scope: !318)
!343 = !DILocation(line: 124, column: 68, scope: !318)
!344 = !DILocalVariable(name: "perc_str", scope: !318, file: !2, line: 125, type: !17, align: 64)
!345 = !DILocation(line: 125, column: 10, scope: !318)
!346 = !DILocalVariable(name: "perc", scope: !318, file: !2, line: 126, type: !41, align: 32)
!347 = !DILocation(line: 126, column: 7, scope: !318)
!348 = !DILocation(line: 126, column: 14, scope: !318)
!349 = !DILocalVariable(name: "print_step", scope: !318, file: !2, line: 127, type: !14, align: 32)
!350 = !DILocation(line: 127, column: 8, scope: !318)
!351 = !DILocation(line: 127, column: 21, scope: !318)
!352 = !DILocation(line: 128, column: 7, scope: !318)
!353 = !DILocation(line: 128, column: 37, scope: !318)
!354 = !DILocation(line: 130, column: 25, scope: !355)
!355 = distinct !DILexicalBlock(scope: !318, file: !2, line: 130, column: 3)
!356 = !DILocation(line: 130, column: 28, scope: !355)
!357 = !DILocation(line: 130, column: 45, scope: !355)
!358 = !DILocation(line: 132, column: 8, scope: !359)
!359 = distinct !DILexicalBlock(scope: !355, file: !2, line: 131, column: 3)
!360 = !DILocation(line: 132, column: 25, scope: !359)
!361 = !DILocation(line: 134, column: 5, scope: !362)
!362 = distinct !DILexicalBlock(scope: !359, file: !2, line: 133, column: 4)
!363 = !DILocation(line: 134, column: 14, scope: !362)
!364 = !DILocation(line: 134, column: 36, scope: !362)
!365 = !DILocation(line: 134, column: 53, scope: !362)
!366 = !DILocation(line: 134, column: 35, scope: !362)
!367 = !DILocation(line: 31, column: 10, scope: !368, inlinedAt: !370)
!368 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !369, file: !369, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!369 = !DIFile(filename: "values.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!370 = !DILocation(line: 356, column: 27, scope: !371, inlinedAt: !372)
!371 = distinct !DISubprogram(name: "floor", linkageName: "floor", scope: !179, file: !179, line: 356, scopeLine: 356, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!372 = !DILocation(line: 134, column: 17, scope: !362)
!373 = !DILocation(line: 135, column: 36, scope: !362)
!374 = !DILocation(line: 135, column: 53, scope: !362)
!375 = !DILocation(line: 135, column: 29, scope: !362)
!376 = !DILocation(line: 284, column: 25, scope: !377, inlinedAt: !378)
!377 = distinct !DISubprogram(name: "ceil", linkageName: "ceil", scope: !179, file: !179, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!378 = !DILocation(line: 135, column: 12, scope: !362)
!379 = !DILocation(line: 137, column: 44, scope: !362)
!380 = !DILocation(line: 137, column: 61, scope: !362)
!381 = !DILocation(line: 137, column: 80, scope: !362)
!382 = !DILocation(line: 137, column: 96, scope: !362)
!383 = !DILocation(line: 137, column: 126, scope: !362)
!384 = !DILocation(line: 137, column: 5, scope: !362)
!385 = !DILocation(line: 138, column: 5, scope: !362)
!386 = !DILocation(line: 247, column: 11, scope: !362)
!387 = !DILocation(line: 63, column: 20, scope: !388, inlinedAt: !389)
!388 = distinct !DISubprogram(name: "@start_benchmark", linkageName: "@start_benchmark", scope: !2, file: !2, line: 61, scopeLine: 61, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!389 = !DILocation(line: 141, column: 4, scope: !359)
!390 = !DILocation(line: 64, column: 16, scope: !388, inlinedAt: !389)
!391 = !DILocation(line: 143, column: 4, scope: !359)
!392 = !DILocation(line: 144, column: 8, scope: !359)
!393 = !DILocation(line: 109, column: 9, scope: !394)
!394 = distinct !DILexicalBlock(scope: !318, file: !2, line: 109, column: 9)
!395 = !DILocation(line: 146, column: 8, scope: !359)
!396 = !DILocation(line: 69, column: 27, scope: !397, inlinedAt: !398)
!397 = distinct !DISubprogram(name: "@end_benchmark", linkageName: "@end_benchmark", scope: !2, file: !2, line: 67, scopeLine: 67, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!398 = !DILocation(line: 146, column: 52, scope: !359)
!399 = !DILocation(line: 70, column: 15, scope: !397, inlinedAt: !398)
!400 = !DILocation(line: 148, column: 4, scope: !359)
!401 = !DILocation(line: 148, column: 20, scope: !359)
!402 = !DILocation(line: 148, column: 33, scope: !359)
!403 = !DILocation(line: 149, column: 4, scope: !359)
!404 = !DILocation(line: 149, column: 21, scope: !359)
!405 = !DILocation(line: 130, column: 77, scope: !355)
!406 = !DILocation(line: 130, column: 118, scope: !355)
!407 = !DILocalVariable(name: "clock_cycles", scope: !318, file: !2, line: 152, type: !38, align: 32)
!408 = !DILocation(line: 152, column: 9, scope: !318)
!409 = !DILocation(line: 152, column: 24, scope: !318)
!410 = !DILocation(line: 152, column: 46, scope: !318)
!411 = !DILocalVariable(name: "measurement", scope: !318, file: !2, line: 153, type: !38, align: 32)
!412 = !DILocation(line: 153, column: 9, scope: !318)
!413 = !DILocation(line: 153, column: 23, scope: !318)
!414 = !DILocation(line: 153, column: 46, scope: !318)
!415 = !DILocalVariable(name: "units", scope: !318, file: !2, line: 154, type: !154, align: 64)
!416 = !DILocation(line: 154, column: 12, scope: !318)
!417 = !DILocalVariable(name: "adjusted_measurement", scope: !318, file: !2, line: 156, type: !38, align: 32)
!418 = !DILocation(line: 156, column: 9, scope: !318)
!419 = !DILocation(line: 156, column: 32, scope: !318)
!420 = !DILocation(line: 157, column: 3, scope: !318)
!421 = !DILocation(line: 157, column: 10, scope: !422)
!422 = distinct !DILexicalBlock(scope: !318, file: !2, line: 157, column: 3)
!423 = !DILocation(line: 157, column: 40, scope: !422)
!424 = !DILocalVariable(name: "adjusted_runtime_total", scope: !318, file: !2, line: 158, type: !38, align: 32)
!425 = !DILocation(line: 158, column: 9, scope: !318)
!426 = !DILocation(line: 158, column: 34, scope: !318)
!427 = !DILocation(line: 159, column: 3, scope: !318)
!428 = !DILocation(line: 159, column: 10, scope: !429)
!429 = distinct !DILexicalBlock(scope: !318, file: !2, line: 159, column: 3)
!430 = !DILocation(line: 159, column: 42, scope: !429)
!431 = !DILocation(line: 161, column: 23, scope: !318)
!432 = !DILocation(line: 161, column: 3, scope: !318)
!433 = !DILocation(line: 164, column: 4, scope: !318)
!434 = !DILocation(line: 165, column: 4, scope: !318)
!435 = !DILocation(line: 67, column: 10, scope: !436, inlinedAt: !437)
!436 = distinct !DISubprogram(name: "promote_int_same", linkageName: "promote_int_same", scope: !369, file: !369, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!437 = !DILocation(line: 386, column: 15, scope: !438, inlinedAt: !439)
!438 = distinct !DISubprogram(name: "log", linkageName: "log", scope: !179, file: !179, line: 384, scopeLine: 384, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!439 = !DILocation(line: 165, column: 40, scope: !318)
!440 = !DILocation(line: 62, column: 11, scope: !441, inlinedAt: !442)
!441 = distinct !DISubprogram(name: "promote_int_same", linkageName: "promote_int_same", scope: !369, file: !369, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!442 = !DILocation(line: 386, column: 58, scope: !438, inlinedAt: !439)
!443 = !DILocation(line: 386, column: 9, scope: !438, inlinedAt: !439)
!444 = !DILocation(line: 31, column: 10, scope: !445, inlinedAt: !446)
!445 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !369, file: !369, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!446 = !DILocation(line: 356, column: 27, scope: !447, inlinedAt: !448)
!447 = distinct !DISubprogram(name: "floor", linkageName: "floor", scope: !179, file: !179, line: 356, scopeLine: 356, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!448 = !DILocation(line: 165, column: 23, scope: !318)
!449 = !DILocation(line: 440, column: 16, scope: !450, inlinedAt: !451)
!450 = distinct !DISubprogram(name: "min", linkageName: "min", scope: !179, file: !179, line: 437, scopeLine: 437, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!451 = !DILocation(line: 165, column: 10, scope: !318)
!452 = !DILocation(line: 440, column: 19, scope: !450, inlinedAt: !451)
!453 = !DILocation(line: 166, column: 4, scope: !318)
!454 = !DILocation(line: 167, column: 4, scope: !318)
!455 = !DILocation(line: 168, column: 4, scope: !318)
!456 = !DILocation(line: 169, column: 4, scope: !318)
!457 = !DILocation(line: 169, column: 50, scope: !318)
!458 = !DILocation(line: 67, column: 10, scope: !459, inlinedAt: !460)
!459 = distinct !DISubprogram(name: "promote_int_same", linkageName: "promote_int_same", scope: !369, file: !369, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!460 = !DILocation(line: 386, column: 15, scope: !461, inlinedAt: !462)
!461 = distinct !DISubprogram(name: "log", linkageName: "log", scope: !179, file: !179, line: 384, scopeLine: 384, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!462 = !DILocation(line: 169, column: 40, scope: !318)
!463 = !DILocation(line: 62, column: 11, scope: !464, inlinedAt: !465)
!464 = distinct !DISubprogram(name: "promote_int_same", linkageName: "promote_int_same", scope: !369, file: !369, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!465 = !DILocation(line: 386, column: 58, scope: !461, inlinedAt: !462)
!466 = !DILocation(line: 386, column: 9, scope: !461, inlinedAt: !462)
!467 = !DILocation(line: 31, column: 10, scope: !468, inlinedAt: !469)
!468 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !369, file: !369, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!469 = !DILocation(line: 356, column: 27, scope: !470, inlinedAt: !471)
!470 = distinct !DISubprogram(name: "floor", linkageName: "floor", scope: !179, file: !179, line: 356, scopeLine: 356, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!471 = !DILocation(line: 169, column: 23, scope: !318)
!472 = !DILocation(line: 440, column: 16, scope: !473, inlinedAt: !474)
!473 = distinct !DISubprogram(name: "min", linkageName: "min", scope: !179, file: !179, line: 437, scopeLine: 437, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!474 = !DILocation(line: 169, column: 10, scope: !318)
!475 = !DILocation(line: 440, column: 19, scope: !473, inlinedAt: !474)
!476 = !DILocation(line: 162, column: 3, scope: !318)
!477 = !DILocation(line: 109, column: 9, scope: !478)
!478 = distinct !DILexicalBlock(scope: !318, file: !2, line: 109, column: 9)
!479 = !DILocation(line: 173, column: 41, scope: !251)
!480 = !DILocation(line: 173, column: 57, scope: !251)
!481 = !DILocation(line: 173, column: 84, scope: !251)
!482 = !DILocation(line: 173, column: 2, scope: !251)
!483 = !DILocation(line: 174, column: 9, scope: !251)
!484 = distinct !DISubprogram(name: "default_benchmark_runner", linkageName: "std.core.runtime.default_benchmark_runner", scope: !2, file: !2, line: 177, type: !485, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !126, retainedNodes: !142)
!485 = !DISubroutineType(types: !486)
!486 = !{!66, !154}
!487 = !DILocalVariable(name: "args", arg: 1, scope: !484, file: !2, line: 177, type: !154)
!488 = !DILocation(line: 177, column: 43, scope: !484)
!489 = !DILocalVariable(name: "state", scope: !490, file: !2, line: 679, type: !492, align: 64)
!490 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !491, file: !491, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!491 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 496, baseType: !493, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64, dwarfAddressSpace: 0)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !495, identifier: "std.core.mem.allocator.TempAllocator")
!495 = !{!496, !497, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !494, file: !2, line: 33, baseType: !29, size: 128, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !494, file: !2, line: 34, baseType: !498, size: 64, align: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64, dwarfAddressSpace: 0)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !500, identifier: "std.core.mem.allocator.TempAllocatorPage")
!500 = !{!501, !502, !503, !504, !505}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !499, file: !2, line: 56, baseType: !498, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !499, file: !2, line: 57, baseType: !32, size: 64, align: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !499, file: !2, line: 58, baseType: !23, size: 64, align: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !499, file: !2, line: 59, baseType: !23, size: 64, align: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !499, file: !2, line: 60, baseType: !506, align: 8, offset: 256)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, align: 8, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 0, lowerBound: 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !494, file: !2, line: 35, baseType: !493, size: 64, align: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !494, file: !2, line: 36, baseType: !66, size: 8, align: 8, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !494, file: !2, line: 37, baseType: !23, size: 64, align: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !494, file: !2, line: 38, baseType: !23, size: 64, align: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !494, file: !2, line: 39, baseType: !23, size: 64, align: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !494, file: !2, line: 40, baseType: !23, size: 64, align: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !494, file: !2, line: 41, baseType: !23, size: 64, align: 64, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !494, file: !2, line: 42, baseType: !23, size: 64, align: 64, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !494, file: !2, line: 43, baseType: !506, align: 8, offset: 704)
!518 = !DILocation(line: 679, column: 12, scope: !490, inlinedAt: !519)
!519 = !DILocation(line: 177, column: 52, scope: !484)
!520 = !DILocation(line: 679, column: 41, scope: !490, inlinedAt: !519)
!521 = !DILocation(line: 679, column: 20, scope: !490, inlinedAt: !519)
!522 = !DILocation(line: 179, column: 21, scope: !523)
!523 = distinct !DILexicalBlock(scope: !484, file: !2, line: 178, column: 1)
!524 = !DILocation(line: 18, column: 12, scope: !523)
!525 = !DILocation(line: 18, column: 11, scope: !523)
!526 = !DILocation(line: 179, column: 2, scope: !523)
!527 = !DILocation(line: 186, column: 52, scope: !523)
!528 = !DILocation(line: 186, column: 24, scope: !523)
!529 = !DILocation(line: 186, column: 9, scope: !523)
!530 = !DILocation(line: 182, column: 7, scope: !531)
!531 = distinct !DILexicalBlock(scope: !523, file: !2, line: 181, column: 2)
!532 = !DILocation(line: 182, column: 87, scope: !531)
!533 = !DILocation(line: 182, column: 28, scope: !531)
!534 = !DILocation(line: 183, column: 3, scope: !531)
!535 = !DILocation(line: 682, column: 23, scope: !536, inlinedAt: !519)
!536 = distinct !DILexicalBlock(scope: !490, file: !491, line: 681, column: 2)
!537 = !DILocation(line: 682, column: 3, scope: !536, inlinedAt: !519)
!538 = distinct !DISubprogram(name: "test_collection_create", linkageName: "std.core.runtime.test_collection_create", scope: !73, file: !73, line: 53, type: !539, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !126, retainedNodes: !142)
!539 = !DISubroutineType(types: !540)
!540 = !{!541, !29}
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit[]", size: 128, align: 64, elements: !542, identifier: "TestUnit[]")
!542 = !{!543, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !541, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64, dwarfAddressSpace: 0)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit", scope: !73, file: !73, line: 47, size: 192, align: 64, elements: !546, identifier: "std.core.runtime.TestUnit")
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !73, line: 49, baseType: !16, size: 128, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !545, file: !73, line: 50, baseType: !102, size: 64, align: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !541, baseType: !23, size: 64, align: 64, offset: 64)
!550 = !DILocalVariable(name: "allocator", arg: 1, scope: !538, file: !73, line: 53, type: !29)
!551 = !DILocation(line: 53, column: 48, scope: !538)
!552 = !DILocalVariable(name: "fns", scope: !538, file: !73, line: 55, type: !553, align: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestFn[]", size: 128, align: 64, elements: !554, identifier: "TestFn[]")
!554 = !{!555, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !553, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64, dwarfAddressSpace: 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !553, baseType: !23, size: 64, align: 64, offset: 64)
!558 = !DILocation(line: 55, column: 11, scope: !538)
!559 = !DILocation(line: 55, column: 17, scope: !538)
!560 = !DILocalVariable(name: "names", scope: !538, file: !73, line: 56, type: !154, align: 64)
!561 = !DILocation(line: 56, column: 11, scope: !538)
!562 = !DILocation(line: 56, column: 19, scope: !538)
!563 = !DILocalVariable(name: "tests", scope: !538, file: !73, line: 57, type: !541, align: 64)
!564 = !DILocation(line: 57, column: 13, scope: !538)
!565 = !DILocation(line: 57, column: 65, scope: !538)
!566 = !DILocation(line: 304, column: 55, scope: !567, inlinedAt: !568)
!567 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !166, file: !166, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!568 = !DILocation(line: 287, column: 9, scope: !569, inlinedAt: !570)
!569 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !166, file: !166, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!570 = !DILocation(line: 57, column: 21, scope: !538)
!571 = !DILocation(line: 304, column: 40, scope: !567, inlinedAt: !568)
!572 = !DILocation(line: 80, column: 6, scope: !573, inlinedAt: !574)
!573 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !166, file: !166, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!574 = !DILocation(line: 304, column: 18, scope: !567, inlinedAt: !568)
!575 = !DILocation(line: 80, column: 20, scope: !573, inlinedAt: !574)
!576 = !DILocation(line: 86, column: 28, scope: !573, inlinedAt: !574)
!577 = !DILocation(line: 38, column: 12, scope: !573, inlinedAt: !574)
!578 = !DILocation(line: 1039, column: 9, scope: !579, inlinedAt: !580)
!579 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !179, file: !179, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!580 = !DILocation(line: 38, column: 26, scope: !573, inlinedAt: !574)
!581 = !DILocation(line: 1039, column: 20, scope: !579, inlinedAt: !580)
!582 = !DILocation(line: 1039, column: 25, scope: !579, inlinedAt: !580)
!583 = !DILocation(line: 1039, column: 19, scope: !579, inlinedAt: !580)
!584 = !DILocation(line: 86, column: 10, scope: !573, inlinedAt: !574)
!585 = !DILocation(line: 304, column: 67, scope: !567, inlinedAt: !568)
!586 = !DILocation(line: 304, column: 9, scope: !567, inlinedAt: !568)
!587 = !DILocation(line: 58, column: 21, scope: !588)
!588 = distinct !DILexicalBlock(scope: !538, file: !73, line: 58, column: 2)
!589 = !DILocalVariable(name: ".temp", scope: !588, file: !73, line: 58, type: !23, align: 64)
!590 = !DILocation(line: 58, column: 11, scope: !588)
!591 = !DILocalVariable(name: "i", scope: !592, file: !73, line: 58, type: !23, align: 64)
!592 = distinct !DILexicalBlock(scope: !588, file: !73, line: 59, column: 2)
!593 = !DILocation(line: 58, column: 11, scope: !592)
!594 = !DILocalVariable(name: "test", scope: !592, file: !73, line: 58, type: !102, align: 64)
!595 = !DILocation(line: 58, column: 14, scope: !592)
!596 = !DILocation(line: 58, column: 21, scope: !592)
!597 = !DILocation(line: 60, column: 16, scope: !598)
!598 = distinct !DILexicalBlock(scope: !592, file: !73, line: 59, column: 2)
!599 = !DILocation(line: 60, column: 22, scope: !598)
!600 = !DILocation(line: 60, column: 26, scope: !598)
!601 = !DILocation(line: 60, column: 30, scope: !598)
!602 = !DILocation(line: 60, column: 3, scope: !598)
!603 = !DILocation(line: 60, column: 9, scope: !598)
!604 = !DILocation(line: 62, column: 9, scope: !538)
!605 = distinct !DISubprogram(name: "cmp_test_unit", linkageName: "std.core.runtime.cmp_test_unit", scope: !73, file: !73, line: 66, type: !606, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !126, retainedNodes: !142)
!606 = !DISubroutineType(types: !607)
!607 = !{!41, !545, !545}
!608 = !DILocalVariable(name: "a", arg: 1, scope: !605, file: !73, line: 66, type: !545)
!609 = !DILocation(line: 66, column: 31, scope: !605)
!610 = !DILocalVariable(name: "b", arg: 2, scope: !605, file: !73, line: 66, type: !545)
!611 = !DILocation(line: 66, column: 43, scope: !605)
!612 = !DILocalVariable(name: "an", scope: !605, file: !73, line: 68, type: !23, align: 64)
!613 = !DILocation(line: 68, column: 6, scope: !605)
!614 = !DILocation(line: 68, column: 11, scope: !605)
!615 = !DILocalVariable(name: "bn", scope: !605, file: !73, line: 69, type: !23, align: 64)
!616 = !DILocation(line: 69, column: 6, scope: !605)
!617 = !DILocation(line: 69, column: 11, scope: !605)
!618 = !DILocation(line: 70, column: 6, scope: !605)
!619 = !DILocation(line: 70, column: 11, scope: !605)
!620 = !DILocalVariable(name: "temp", scope: !621, file: !73, line: 91, type: !545, align: 64)
!621 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !622, file: !622, line: 89, scopeLine: 89, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!622 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!623 = !DILocation(line: 91, column: 6, scope: !621, inlinedAt: !624)
!624 = !DILocation(line: 70, column: 15, scope: !605)
!625 = !DILocation(line: 91, column: 13, scope: !621, inlinedAt: !624)
!626 = !DILocation(line: 92, column: 7, scope: !621, inlinedAt: !624)
!627 = !DILocation(line: 93, column: 7, scope: !621, inlinedAt: !624)
!628 = !DILocation(line: 71, column: 19, scope: !629)
!629 = distinct !DILexicalBlock(scope: !605, file: !73, line: 71, column: 2)
!630 = !DILocalVariable(name: ".temp", scope: !629, file: !73, line: 71, type: !23, align: 64)
!631 = !DILocation(line: 71, column: 11, scope: !629)
!632 = !DILocalVariable(name: "i", scope: !633, file: !73, line: 71, type: !23, align: 64)
!633 = distinct !DILexicalBlock(scope: !629, file: !73, line: 72, column: 2)
!634 = !DILocation(line: 71, column: 11, scope: !633)
!635 = !DILocalVariable(name: "ac", scope: !633, file: !73, line: 71, type: !21, align: 8)
!636 = !DILocation(line: 71, column: 14, scope: !633)
!637 = !DILocation(line: 71, column: 19, scope: !633)
!638 = !DILocalVariable(name: "bc", scope: !639, file: !73, line: 73, type: !21, align: 8)
!639 = distinct !DILexicalBlock(scope: !633, file: !73, line: 72, column: 2)
!640 = !DILocation(line: 73, column: 8, scope: !639)
!641 = !DILocation(line: 73, column: 13, scope: !639)
!642 = !DILocation(line: 73, column: 20, scope: !639)
!643 = !DILocation(line: 74, column: 7, scope: !639)
!644 = !DILocation(line: 74, column: 13, scope: !639)
!645 = !DILocation(line: 74, column: 24, scope: !639)
!646 = !DILocation(line: 74, column: 29, scope: !639)
!647 = !DILocation(line: 74, column: 34, scope: !639)
!648 = !DILocation(line: 74, column: 39, scope: !639)
!649 = !DILocation(line: 74, column: 44, scope: !639)
!650 = !DILocation(line: 74, column: 49, scope: !639)
!651 = !DILocation(line: 76, column: 15, scope: !605)
!652 = !DILocation(line: 76, column: 20, scope: !605)
!653 = !DILocation(line: 76, column: 9, scope: !605)
!654 = distinct !DISubprogram(name: "terminal_has_ansi_codes", linkageName: "std.core.runtime.terminal_has_ansi_codes.5317", scope: !73, file: !73, line: 79, type: !655, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!655 = !DISubroutineType(types: !656)
!656 = !{!66}
!657 = !DILocalVariable(name: "state", scope: !658, file: !73, line: 679, type: !492, align: 64)
!658 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !491, file: !491, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!659 = !DILocation(line: 679, column: 12, scope: !658, inlinedAt: !660)
!660 = !DILocation(line: 79, column: 45, scope: !654)
!661 = !DILocation(line: 679, column: 41, scope: !658, inlinedAt: !660)
!662 = !DILocation(line: 679, column: 20, scope: !658, inlinedAt: !660)
!663 = !DILocalVariable(name: "v", scope: !664, file: !73, line: 82, type: !16, align: 64)
!664 = distinct !DILexicalBlock(scope: !654, file: !73, line: 80, column: 1)
!665 = !DILocation(line: 82, column: 10, scope: !664)
!666 = !DILocation(line: 82, column: 14, scope: !664)
!667 = !DILocation(line: 84, column: 18, scope: !668)
!668 = distinct !DILexicalBlock(scope: !664, file: !73, line: 83, column: 2)
!669 = !DILocation(line: 84, column: 7, scope: !668)
!670 = !DILocation(line: 84, column: 41, scope: !668)
!671 = !DILocation(line: 84, column: 30, scope: !668)
!672 = !DILocation(line: 84, column: 64, scope: !668)
!673 = !DILocation(line: 84, column: 53, scope: !668)
!674 = !DILocation(line: 682, column: 23, scope: !675, inlinedAt: !660)
!675 = distinct !DILexicalBlock(scope: !658, file: !491, line: 681, column: 2)
!676 = !DILocation(line: 682, column: 3, scope: !675, inlinedAt: !660)
!677 = !DILocation(line: 89, column: 10, scope: !664)
!678 = !DILocation(line: 682, column: 23, scope: !679, inlinedAt: !660)
!679 = distinct !DILexicalBlock(scope: !658, file: !491, line: 681, column: 2)
!680 = !DILocation(line: 682, column: 3, scope: !679, inlinedAt: !660)
!681 = distinct !DISubprogram(name: "test_panic", linkageName: "std.core.runtime.test_panic.5326", scope: !73, file: !73, line: 103, type: !682, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !16, !16, !16, !14}
!684 = !DILocalVariable(name: "message", arg: 1, scope: !681, file: !73, line: 103, type: !16)
!685 = !DILocation(line: 103, column: 27, scope: !681)
!686 = !DILocalVariable(name: "file", arg: 2, scope: !681, file: !73, line: 103, type: !16)
!687 = !DILocation(line: 103, column: 43, scope: !681)
!688 = !DILocalVariable(name: "function", arg: 3, scope: !681, file: !73, line: 103, type: !16)
!689 = !DILocation(line: 103, column: 56, scope: !681)
!690 = !DILocalVariable(name: "line", arg: 4, scope: !681, file: !73, line: 103, type: !14)
!691 = !DILocation(line: 103, column: 71, scope: !681)
!692 = !DILocation(line: 107, column: 97, scope: !693, inlinedAt: !694)
!693 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !73, file: !73, line: 107, scopeLine: 107, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!694 = !DILocation(line: 105, column: 2, scope: !681)
!695 = distinct !DISubprogram(name: "panic_test", linkageName: "std.core.runtime.panic_test.5331", scope: !73, file: !73, line: 107, type: !696, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !16, !16, !16, !14, !32}
!698 = !DILocalVariable(name: "message", arg: 1, scope: !695, file: !73, line: 107, type: !16)
!699 = !DILocation(line: 107, column: 27, scope: !695)
!700 = !DILocalVariable(name: "file", arg: 2, scope: !695, file: !73, line: 107, type: !16)
!701 = !DILocation(line: 107, column: 43, scope: !695)
!702 = !DILocalVariable(name: "function", arg: 3, scope: !695, file: !73, line: 107, type: !16)
!703 = !DILocation(line: 107, column: 56, scope: !695)
!704 = !DILocalVariable(name: "line", arg: 4, scope: !695, file: !73, line: 107, type: !14)
!705 = !DILocation(line: 107, column: 71, scope: !695)
!706 = !DILocalVariable(name: "extra_trace", arg: 5, scope: !695, file: !73, line: 107, type: !32)
!707 = !DILocation(line: 107, column: 83, scope: !695)
!708 = !DILocation(line: 109, column: 6, scope: !695)
!709 = !DILocation(line: 109, column: 38, scope: !695)
!710 = !DILocation(line: 110, column: 2, scope: !695)
!711 = !DILocation(line: 112, column: 2, scope: !695)
!712 = !DILocation(line: 113, column: 8, scope: !695)
!713 = !DILocation(line: 247, column: 11, scope: !695)
!714 = !DILocation(line: 113, column: 2, scope: !695)
!715 = !DILocation(line: 114, column: 6, scope: !695)
!716 = !DILocation(line: 117, column: 41, scope: !717)
!717 = distinct !DILexicalBlock(scope: !695, file: !73, line: 115, column: 2)
!718 = !DILocation(line: 117, column: 59, scope: !717)
!719 = !DILocation(line: 117, column: 62, scope: !717)
!720 = !DILocation(line: 117, column: 7, scope: !717)
!721 = !DILocation(line: 120, column: 50, scope: !695)
!722 = !DILocation(line: 120, column: 56, scope: !695)
!723 = !DILocation(line: 120, column: 62, scope: !695)
!724 = !DILocation(line: 120, column: 2, scope: !695)
!725 = !DILocation(line: 121, column: 2, scope: !695)
!726 = !DILocation(line: 123, column: 6, scope: !695)
!727 = !DILocation(line: 307, column: 2, scope: !728, inlinedAt: !729)
!728 = distinct !DISubprogram(name: "breakpoint", linkageName: "breakpoint", scope: !622, file: !622, line: 305, scopeLine: 305, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!729 = !DILocation(line: 125, column: 3, scope: !730)
!730 = distinct !DILexicalBlock(scope: !695, file: !73, line: 124, column: 2)
!731 = !DILocation(line: 128, column: 6, scope: !695)
!732 = !DILocation(line: 130, column: 3, scope: !733)
!733 = distinct !DILexicalBlock(scope: !695, file: !73, line: 129, column: 2)
!734 = !DILocation(line: 133, column: 2, scope: !695)
!735 = !DILocation(line: 134, column: 2, scope: !695)
!736 = !DILocation(line: 134, column: 32, scope: !695)
!737 = !DILocation(line: 135, column: 17, scope: !695)
!738 = !DILocation(line: 135, column: 2, scope: !695)
!739 = distinct !DISubprogram(name: "mute_output", linkageName: "std.core.runtime.mute_output.5337", scope: !73, file: !73, line: 138, type: !104, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!740 = !DILocation(line: 140, column: 6, scope: !739)
!741 = !DILocation(line: 140, column: 37, scope: !739)
!742 = !DILocation(line: 140, column: 74, scope: !739)
!743 = !DILocalVariable(name: "stdout", scope: !739, file: !73, line: 141, type: !744, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64, dwarfAddressSpace: 0)
!745 = !DILocation(line: 141, column: 8, scope: !739)
!746 = !DILocation(line: 141, column: 17, scope: !739)
!747 = !DILocalVariable(name: "stderr", scope: !739, file: !73, line: 142, type: !744, align: 64)
!748 = !DILocation(line: 142, column: 11, scope: !739)
!749 = !DILocation(line: 142, column: 20, scope: !739)
!750 = !DILocation(line: 143, column: 12, scope: !739)
!751 = !DILocation(line: 143, column: 3, scope: !739)
!752 = !DILocation(line: 144, column: 12, scope: !739)
!753 = !DILocation(line: 144, column: 3, scope: !739)
!754 = !DILocation(line: 145, column: 8, scope: !739)
!755 = !DILocation(line: 76, column: 11, scope: !739)
!756 = !DILocation(line: 145, column: 2, scope: !739)
!757 = distinct !DISubprogram(name: "unmute_output", linkageName: "std.core.runtime.unmute_output.5340", scope: !73, file: !73, line: 148, type: !758, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !66}
!760 = !DILocalVariable(name: "has_error", arg: 1, scope: !757, file: !73, line: 148, type: !66)
!761 = !DILocation(line: 148, column: 28, scope: !757)
!762 = !DILocation(line: 150, column: 6, scope: !757)
!763 = !DILocation(line: 150, column: 37, scope: !757)
!764 = !DILocation(line: 150, column: 74, scope: !757)
!765 = !DILocalVariable(name: "stdout", scope: !757, file: !73, line: 152, type: !744, align: 64)
!766 = !DILocation(line: 152, column: 8, scope: !757)
!767 = !DILocation(line: 152, column: 17, scope: !757)
!768 = !DILocalVariable(name: "stderr", scope: !757, file: !73, line: 153, type: !744, align: 64)
!769 = !DILocation(line: 153, column: 8, scope: !757)
!770 = !DILocation(line: 153, column: 17, scope: !757)
!771 = !DILocation(line: 155, column: 12, scope: !757)
!772 = !DILocation(line: 155, column: 3, scope: !757)
!773 = !DILocation(line: 156, column: 12, scope: !757)
!774 = !DILocation(line: 156, column: 3, scope: !757)
!775 = !DILocalVariable(name: "log_size", scope: !757, file: !73, line: 158, type: !24, align: 64)
!776 = !DILocation(line: 158, column: 8, scope: !757)
!777 = !DILocation(line: 158, column: 19, scope: !757)
!778 = !DILocation(line: 84, column: 11, scope: !757)
!779 = !DILocation(line: 159, column: 6, scope: !757)
!780 = !DILocation(line: 161, column: 14, scope: !781)
!781 = distinct !DILexicalBlock(scope: !757, file: !73, line: 160, column: 2)
!782 = !DILocation(line: 161, column: 68, scope: !781)
!783 = !DILocation(line: 264, column: 16, scope: !784, inlinedAt: !785)
!784 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !293, file: !293, line: 262, scopeLine: 262, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!785 = !DILocation(line: 161, column: 3, scope: !781)
!786 = !DILocalVariable(name: "len", scope: !787, file: !73, line: 238, type: !23, align: 64)
!787 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !293, file: !293, line: 236, scopeLine: 236, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!788 = !DILocation(line: 238, column: 6, scope: !787, inlinedAt: !789)
!789 = !DILocation(line: 264, column: 2, scope: !784, inlinedAt: !785)
!790 = !DILocation(line: 182, column: 24, scope: !791, inlinedAt: !792)
!791 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !293, file: !293, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!792 = !DILocation(line: 238, column: 12, scope: !787, inlinedAt: !789)
!793 = !DILocation(line: 182, column: 34, scope: !791, inlinedAt: !792)
!794 = !DILocation(line: 167, column: 11, scope: !791, inlinedAt: !792)
!795 = !DILocation(line: 239, column: 2, scope: !787, inlinedAt: !789)
!796 = !DILocation(line: 108, column: 11, scope: !787, inlinedAt: !789)
!797 = !DILocation(line: 244, column: 4, scope: !787, inlinedAt: !789)
!798 = !DILocation(line: 247, column: 11, scope: !787, inlinedAt: !789)
!799 = !DILocation(line: 246, column: 9, scope: !787, inlinedAt: !789)
!800 = !DILocation(line: 164, column: 6, scope: !757)
!801 = !DILocation(line: 164, column: 19, scope: !757)
!802 = !DILocation(line: 166, column: 3, scope: !803)
!803 = distinct !DILexicalBlock(scope: !757, file: !73, line: 165, column: 2)
!804 = !DILocation(line: 108, column: 11, scope: !803)
!805 = !DILocation(line: 167, column: 3, scope: !803)
!806 = !DILocation(line: 168, column: 3, scope: !803)
!807 = !DILocation(line: 76, column: 11, scope: !803)
!808 = !DILocation(line: 170, column: 3, scope: !803)
!809 = !DILocation(line: 171, column: 23, scope: !803)
!810 = !DILocation(line: 171, column: 3, scope: !803)
!811 = !DILocation(line: 172, column: 3, scope: !803)
!812 = !DILocalVariable(name: "c", scope: !813, file: !73, line: 172, type: !21, align: 8)
!813 = distinct !DILexicalBlock(scope: !803, file: !73, line: 172, column: 3)
!814 = !DILocation(line: 172, column: 14, scope: !813)
!815 = !DILocation(line: 172, column: 18, scope: !813)
!816 = !DILocation(line: 174, column: 18, scope: !817, inlinedAt: !818)
!817 = distinct !DISubprogram(name: "@unlikely", linkageName: "@unlikely", scope: !622, file: !622, line: 403, scopeLine: 403, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!818 = !DILocation(line: 174, column: 8, scope: !819)
!819 = distinct !DILexicalBlock(scope: !813, file: !73, line: 173, column: 3)
!820 = !DILocation(line: 409, column: 18, scope: !817, inlinedAt: !818)
!821 = !DILocation(line: 409, column: 26, scope: !817, inlinedAt: !818)
!822 = !DILocation(line: 177, column: 5, scope: !823)
!823 = distinct !DILexicalBlock(scope: !819, file: !73, line: 175, column: 4)
!824 = !DILocation(line: 179, column: 18, scope: !819)
!825 = !DILocation(line: 179, column: 4, scope: !819)
!826 = !DILocation(line: 181, column: 3, scope: !803)
!827 = !DILocation(line: 183, column: 8, scope: !757)
!828 = !DILocation(line: 247, column: 11, scope: !757)
!829 = !DILocation(line: 183, column: 2, scope: !757)
!830 = distinct !DISubprogram(name: "run_tests", linkageName: "std.core.runtime.run_tests", scope: !73, file: !73, line: 187, type: !831, scopeLine: 187, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!831 = !DISubroutineType(types: !832)
!832 = !{!66, !154, !541}
!833 = !DILocalVariable(name: "args", arg: 1, scope: !830, file: !73, line: 187, type: !154)
!834 = !DILocation(line: 187, column: 28, scope: !830)
!835 = !DILocalVariable(name: "tests", arg: 2, scope: !830, file: !73, line: 187, type: !541)
!836 = !DILocation(line: 187, column: 45, scope: !830)
!837 = !DILocalVariable(name: "max_name", scope: !830, file: !73, line: 189, type: !23, align: 64)
!838 = !DILocation(line: 189, column: 6, scope: !830)
!839 = !DILocation(line: 190, column: 6, scope: !830)
!840 = !DILocation(line: 264, column: 16, scope: !841, inlinedAt: !842)
!841 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !293, file: !293, line: 262, scopeLine: 262, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!842 = !DILocation(line: 192, column: 3, scope: !843)
!843 = distinct !DILexicalBlock(scope: !830, file: !73, line: 191, column: 2)
!844 = !DILocalVariable(name: "len", scope: !845, file: !73, line: 238, type: !23, align: 64)
!845 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !293, file: !293, line: 236, scopeLine: 236, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!846 = !DILocation(line: 238, column: 6, scope: !845, inlinedAt: !847)
!847 = !DILocation(line: 264, column: 2, scope: !841, inlinedAt: !842)
!848 = !DILocation(line: 182, column: 24, scope: !849, inlinedAt: !850)
!849 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !293, file: !293, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!850 = !DILocation(line: 238, column: 12, scope: !845, inlinedAt: !847)
!851 = !DILocation(line: 182, column: 34, scope: !849, inlinedAt: !850)
!852 = !DILocation(line: 167, column: 11, scope: !849, inlinedAt: !850)
!853 = !DILocation(line: 239, column: 2, scope: !845, inlinedAt: !847)
!854 = !DILocation(line: 108, column: 11, scope: !845, inlinedAt: !847)
!855 = !DILocation(line: 244, column: 4, scope: !845, inlinedAt: !847)
!856 = !DILocation(line: 247, column: 11, scope: !845, inlinedAt: !847)
!857 = !DILocation(line: 246, column: 9, scope: !845, inlinedAt: !847)
!858 = !DILocation(line: 193, column: 10, scope: !843)
!859 = !DILocation(line: 196, column: 2, scope: !830)
!860 = !DILocation(line: 197, column: 2, scope: !830)
!861 = !DILocation(line: 199, column: 19, scope: !862)
!862 = distinct !DILexicalBlock(scope: !830, file: !73, line: 199, column: 2)
!863 = !DILocalVariable(name: ".temp", scope: !862, file: !73, line: 199, type: !23, align: 64)
!864 = !DILocalVariable(name: "unit", scope: !865, file: !73, line: 199, type: !544, align: 64)
!865 = distinct !DILexicalBlock(scope: !862, file: !73, line: 200, column: 2)
!866 = !DILocation(line: 199, column: 12, scope: !865)
!867 = !DILocation(line: 199, column: 19, scope: !865)
!868 = !DILocation(line: 201, column: 7, scope: !869)
!869 = distinct !DILexicalBlock(scope: !865, file: !73, line: 200, column: 2)
!870 = !DILocation(line: 201, column: 18, scope: !869)
!871 = !DILocation(line: 201, column: 44, scope: !869)
!872 = !DILocalVariable(name: "context", scope: !830, file: !73, line: 203, type: !75, align: 64)
!873 = !DILocation(line: 203, column: 14, scope: !830)
!874 = !DILocation(line: 205, column: 29, scope: !830)
!875 = !DILocation(line: 206, column: 27, scope: !830)
!876 = !DILocation(line: 207, column: 17, scope: !830)
!877 = !DILocation(line: 208, column: 24, scope: !830)
!878 = !DILocation(line: 209, column: 16, scope: !830)
!879 = !DILocation(line: 210, column: 18, scope: !830)
!880 = !DILocation(line: 211, column: 21, scope: !830)
!881 = !DILocation(line: 212, column: 23, scope: !830)
!882 = !DILocation(line: 213, column: 21, scope: !830)
!883 = !DILocation(line: 214, column: 21, scope: !830)
!884 = !DILocalVariable(name: "i", scope: !885, file: !73, line: 216, type: !41, align: 32)
!885 = distinct !DILexicalBlock(scope: !830, file: !73, line: 216, column: 2)
!886 = !DILocation(line: 216, column: 11, scope: !885)
!887 = !DILocation(line: 216, column: 15, scope: !885)
!888 = !DILocation(line: 216, column: 18, scope: !885)
!889 = !DILocation(line: 216, column: 22, scope: !885)
!890 = !DILocation(line: 218, column: 11, scope: !891)
!891 = distinct !DILexicalBlock(scope: !892, file: !73, line: 218, column: 3)
!892 = distinct !DILexicalBlock(scope: !885, file: !73, line: 217, column: 2)
!893 = !DILocation(line: 218, column: 16, scope: !891)
!894 = !DILocation(line: 220, column: 9, scope: !891)
!895 = !DILocation(line: 221, column: 5, scope: !896)
!896 = distinct !DILexicalBlock(scope: !891, file: !73, line: 221, column: 5)
!897 = !DILocation(line: 222, column: 9, scope: !891)
!898 = !DILocation(line: 223, column: 5, scope: !899)
!899 = distinct !DILexicalBlock(scope: !891, file: !73, line: 223, column: 5)
!900 = !DILocation(line: 224, column: 9, scope: !891)
!901 = !DILocation(line: 225, column: 5, scope: !902)
!902 = distinct !DILexicalBlock(scope: !891, file: !73, line: 225, column: 5)
!903 = !DILocation(line: 226, column: 9, scope: !891)
!904 = !DILocation(line: 227, column: 9, scope: !891)
!905 = !DILocation(line: 228, column: 5, scope: !906)
!906 = distinct !DILexicalBlock(scope: !891, file: !73, line: 228, column: 5)
!907 = !DILocation(line: 229, column: 9, scope: !891)
!908 = !DILocation(line: 230, column: 5, scope: !909)
!909 = distinct !DILexicalBlock(scope: !891, file: !73, line: 230, column: 5)
!910 = !DILocation(line: 231, column: 9, scope: !891)
!911 = !DILocation(line: 232, column: 5, scope: !912)
!912 = distinct !DILexicalBlock(scope: !891, file: !73, line: 232, column: 5)
!913 = !DILocation(line: 233, column: 9, scope: !891)
!914 = !DILocation(line: 234, column: 5, scope: !915)
!915 = distinct !DILexicalBlock(scope: !891, file: !73, line: 234, column: 5)
!916 = !DILocation(line: 235, column: 9, scope: !891)
!917 = !DILocation(line: 236, column: 9, scope: !918)
!918 = distinct !DILexicalBlock(scope: !891, file: !73, line: 236, column: 5)
!919 = !DILocation(line: 236, column: 14, scope: !918)
!920 = !DILocation(line: 264, column: 16, scope: !921, inlinedAt: !922)
!921 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !293, file: !293, line: 262, scopeLine: 262, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!922 = !DILocation(line: 238, column: 6, scope: !923)
!923 = distinct !DILexicalBlock(scope: !918, file: !73, line: 237, column: 5)
!924 = !DILocalVariable(name: "len", scope: !925, file: !73, line: 238, type: !23, align: 64)
!925 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !293, file: !293, line: 236, scopeLine: 236, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!926 = !DILocation(line: 238, column: 6, scope: !925, inlinedAt: !927)
!927 = !DILocation(line: 264, column: 2, scope: !921, inlinedAt: !922)
!928 = !DILocation(line: 182, column: 24, scope: !929, inlinedAt: !930)
!929 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !293, file: !293, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!930 = !DILocation(line: 238, column: 12, scope: !925, inlinedAt: !927)
!931 = !DILocation(line: 182, column: 34, scope: !929, inlinedAt: !930)
!932 = !DILocation(line: 167, column: 11, scope: !929, inlinedAt: !930)
!933 = !DILocation(line: 239, column: 2, scope: !925, inlinedAt: !927)
!934 = !DILocation(line: 108, column: 11, scope: !925, inlinedAt: !927)
!935 = !DILocation(line: 244, column: 4, scope: !925, inlinedAt: !927)
!936 = !DILocation(line: 247, column: 11, scope: !925, inlinedAt: !927)
!937 = !DILocation(line: 246, column: 9, scope: !925, inlinedAt: !927)
!938 = !DILocation(line: 239, column: 13, scope: !923)
!939 = !DILocation(line: 241, column: 27, scope: !918)
!940 = !DILocation(line: 241, column: 32, scope: !918)
!941 = !DILocation(line: 241, column: 5, scope: !918)
!942 = !DILocation(line: 242, column: 5, scope: !918)
!943 = !DILocation(line: 243, column: 9, scope: !891)
!944 = !DILocation(line: 244, column: 9, scope: !945)
!945 = distinct !DILexicalBlock(scope: !891, file: !73, line: 244, column: 5)
!946 = !DILocation(line: 244, column: 14, scope: !945)
!947 = !DILocation(line: 264, column: 16, scope: !948, inlinedAt: !949)
!948 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !293, file: !293, line: 262, scopeLine: 262, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!949 = !DILocation(line: 246, column: 6, scope: !950)
!950 = distinct !DILexicalBlock(scope: !945, file: !73, line: 245, column: 5)
!951 = !DILocalVariable(name: "len", scope: !952, file: !73, line: 238, type: !23, align: 64)
!952 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !293, file: !293, line: 236, scopeLine: 236, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!953 = !DILocation(line: 238, column: 6, scope: !952, inlinedAt: !954)
!954 = !DILocation(line: 264, column: 2, scope: !948, inlinedAt: !949)
!955 = !DILocation(line: 182, column: 24, scope: !956, inlinedAt: !957)
!956 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !293, file: !293, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!957 = !DILocation(line: 238, column: 12, scope: !952, inlinedAt: !954)
!958 = !DILocation(line: 182, column: 34, scope: !956, inlinedAt: !957)
!959 = !DILocation(line: 167, column: 11, scope: !956, inlinedAt: !957)
!960 = !DILocation(line: 239, column: 2, scope: !952, inlinedAt: !954)
!961 = !DILocation(line: 108, column: 11, scope: !952, inlinedAt: !954)
!962 = !DILocation(line: 244, column: 4, scope: !952, inlinedAt: !954)
!963 = !DILocation(line: 247, column: 11, scope: !952, inlinedAt: !954)
!964 = !DILocation(line: 246, column: 9, scope: !952, inlinedAt: !954)
!965 = !DILocation(line: 247, column: 13, scope: !950)
!966 = !DILocalVariable(name: "state", scope: !967, file: !73, line: 679, type: !492, align: 64)
!967 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !491, file: !491, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!968 = !DILocation(line: 679, column: 12, scope: !967, inlinedAt: !969)
!969 = !DILocation(line: 249, column: 5, scope: !945)
!970 = !DILocation(line: 679, column: 41, scope: !967, inlinedAt: !969)
!971 = !DILocation(line: 679, column: 20, scope: !967, inlinedAt: !969)
!972 = !DILocalVariable(name: "upper", scope: !973, file: !73, line: 251, type: !16, align: 64)
!973 = distinct !DILexicalBlock(scope: !945, file: !73, line: 250, column: 5)
!974 = !DILocation(line: 251, column: 13, scope: !973)
!975 = !DILocation(line: 251, column: 21, scope: !973)
!976 = !DILocation(line: 251, column: 26, scope: !973)
!977 = !DILocation(line: 251, column: 47, scope: !973)
!978 = !DILocalVariable(name: "res", scope: !979, file: !73, line: 543, type: !41, align: 32)
!979 = distinct !DISubprogram(name: "@try", linkageName: "@try", scope: !622, file: !622, line: 541, scopeLine: 541, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!980 = !DILocation(line: 543, column: 6, scope: !979, inlinedAt: !981)
!981 = !DILocation(line: 252, column: 16, scope: !973)
!982 = !DILocalVariable(name: "x", scope: !983, file: !73, line: 352, type: !34, align: 64)
!983 = distinct !DISubprogram(name: "enum_by_name", linkageName: "enum_by_name", scope: !622, file: !622, line: 350, scopeLine: 350, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!984 = !DILocation(line: 352, column: 9, scope: !983, inlinedAt: !985)
!985 = !DILocation(line: 543, column: 12, scope: !979, inlinedAt: !981)
!986 = !DILocation(line: 352, column: 13, scope: !983, inlinedAt: !985)
!987 = !DILocation(line: 353, column: 21, scope: !988, inlinedAt: !985)
!988 = distinct !DILexicalBlock(scope: !983, file: !622, line: 353, column: 2)
!989 = !DILocalVariable(name: ".temp", scope: !988, file: !73, line: 353, type: !23, align: 64)
!990 = !DILocation(line: 353, column: 11, scope: !988, inlinedAt: !985)
!991 = !DILocalVariable(name: "i", scope: !992, file: !73, line: 353, type: !23, align: 64)
!992 = distinct !DILexicalBlock(scope: !988, file: !622, line: 354, column: 2)
!993 = !DILocation(line: 353, column: 11, scope: !992, inlinedAt: !985)
!994 = !DILocalVariable(name: "name", scope: !992, file: !73, line: 353, type: !16, align: 64)
!995 = !DILocation(line: 353, column: 14, scope: !992, inlinedAt: !985)
!996 = !DILocation(line: 353, column: 21, scope: !992, inlinedAt: !985)
!997 = !DILocation(line: 355, column: 7, scope: !998, inlinedAt: !985)
!998 = distinct !DILexicalBlock(scope: !992, file: !622, line: 354, column: 2)
!999 = !DILocation(line: 355, column: 15, scope: !998, inlinedAt: !985)
!1000 = !DILocation(line: 355, column: 52, scope: !998, inlinedAt: !985)
!1001 = !DILocation(line: 355, column: 33, scope: !998, inlinedAt: !985)
!1002 = !DILocation(line: 357, column: 9, scope: !983, inlinedAt: !985)
!1003 = !DILocalVariable(name: "err", scope: !979, file: !73, line: 544, type: !1004, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !54)
!1005 = !DILocation(line: 544, column: 12, scope: !979, inlinedAt: !981)
!1006 = !DILocation(line: 544, column: 18, scope: !979, inlinedAt: !981)
!1007 = !DILocation(line: 544, column: 30, scope: !979, inlinedAt: !981)
!1008 = !DILocation(line: 252, column: 21, scope: !979, inlinedAt: !981)
!1009 = !DILocation(line: 264, column: 16, scope: !1010, inlinedAt: !1011)
!1010 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !293, file: !293, line: 262, scopeLine: 262, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!1011 = !DILocation(line: 254, column: 7, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !973, file: !73, line: 253, column: 6)
!1013 = !DILocalVariable(name: "len", scope: !1014, file: !73, line: 238, type: !23, align: 64)
!1014 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !293, file: !293, line: 236, scopeLine: 236, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!1015 = !DILocation(line: 238, column: 6, scope: !1014, inlinedAt: !1016)
!1016 = !DILocation(line: 264, column: 2, scope: !1010, inlinedAt: !1011)
!1017 = !DILocation(line: 182, column: 24, scope: !1018, inlinedAt: !1019)
!1018 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !293, file: !293, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!1019 = !DILocation(line: 238, column: 12, scope: !1014, inlinedAt: !1016)
!1020 = !DILocation(line: 182, column: 34, scope: !1018, inlinedAt: !1019)
!1021 = !DILocation(line: 167, column: 11, scope: !1018, inlinedAt: !1019)
!1022 = !DILocation(line: 239, column: 2, scope: !1014, inlinedAt: !1016)
!1023 = !DILocation(line: 108, column: 11, scope: !1014, inlinedAt: !1016)
!1024 = !DILocation(line: 244, column: 4, scope: !1014, inlinedAt: !1016)
!1025 = !DILocation(line: 247, column: 11, scope: !1014, inlinedAt: !1016)
!1026 = !DILocation(line: 246, column: 9, scope: !1014, inlinedAt: !1016)
!1027 = !DILocation(line: 682, column: 23, scope: !1028, inlinedAt: !969)
!1028 = distinct !DILexicalBlock(scope: !967, file: !491, line: 681, column: 2)
!1029 = !DILocation(line: 682, column: 3, scope: !1028, inlinedAt: !969)
!1030 = !DILocation(line: 682, column: 23, scope: !1031, inlinedAt: !969)
!1031 = distinct !DILexicalBlock(scope: !967, file: !491, line: 681, column: 2)
!1032 = !DILocation(line: 682, column: 3, scope: !1031, inlinedAt: !969)
!1033 = !DILocation(line: 258, column: 5, scope: !945)
!1034 = !DILocation(line: 260, column: 41, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !891, file: !73, line: 260, column: 5)
!1036 = !DILocation(line: 260, column: 46, scope: !1035)
!1037 = !DILocation(line: 260, column: 5, scope: !1035)
!1038 = !DILocation(line: 216, column: 32, scope: !885)
!1039 = !DILocation(line: 263, column: 18, scope: !830)
!1040 = !DILocation(line: 264, column: 24, scope: !830)
!1041 = !DILocation(line: 264, column: 2, scope: !830)
!1042 = !DILocation(line: 266, column: 6, scope: !830)
!1043 = !DILocalVariable(name: "used_cmp", scope: !1044, file: !73, line: 13, type: !1046, align: 64)
!1044 = distinct !DISubprogram(name: "quicksort", linkageName: "quicksort", scope: !1045, file: !1045, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!1045 = !DIFile(filename: "quicksort.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/sort")
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64, dwarfAddressSpace: 0)
!1047 = !DILocation(line: 13, column: 6, scope: !1044, inlinedAt: !1048)
!1048 = !DILocation(line: 268, column: 3, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !830, file: !73, line: 267, column: 2)
!1050 = !DILocation(line: 13, column: 17, scope: !1044, inlinedAt: !1048)
!1051 = !DILocalVariable(name: "used_ctx", scope: !1044, file: !73, line: 14, type: !1052, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypeNotSet", scope: !73, file: !73, line: 4, baseType: !32, align: 64)
!1053 = !DILocation(line: 14, column: 6, scope: !1044, inlinedAt: !1048)
!1054 = !DILocation(line: 14, column: 17, scope: !1044, inlinedAt: !1048)
!1055 = !DILocation(line: 16, column: 71, scope: !1044, inlinedAt: !1048)
!1056 = !DILocation(line: 16, column: 100, scope: !1044, inlinedAt: !1048)
!1057 = !DILocation(line: 16, column: 3, scope: !1044, inlinedAt: !1048)
!1058 = !DILocation(line: 273, column: 30, scope: !830)
!1059 = !DILocation(line: 273, column: 3, scope: !830)
!1060 = !DILocation(line: 275, column: 6, scope: !830)
!1061 = !DILocation(line: 254, column: 15, scope: !1062, inlinedAt: !1063)
!1062 = distinct !DISubprogram(name: "print", linkageName: "print", scope: !293, file: !293, line: 252, scopeLine: 252, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!1063 = !DILocation(line: 277, column: 3, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !830, file: !73, line: 276, column: 2)
!1065 = !DILocation(line: 182, column: 24, scope: !1066, inlinedAt: !1067)
!1066 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !293, file: !293, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!1067 = !DILocation(line: 254, column: 2, scope: !1062, inlinedAt: !1063)
!1068 = !DILocation(line: 182, column: 34, scope: !1066, inlinedAt: !1067)
!1069 = !DILocation(line: 167, column: 11, scope: !1066, inlinedAt: !1067)
!1070 = !DILocalVariable(name: "old_panic", scope: !830, file: !73, line: 280, type: !1071, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !73, file: !73, line: 253, baseType: !1072, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64, dwarfAddressSpace: 0)
!1073 = !DILocation(line: 280, column: 10, scope: !830)
!1074 = !DILocation(line: 280, column: 22, scope: !830)
!1075 = !DILocation(line: 282, column: 19, scope: !830)
!1076 = !DILocalVariable(name: "tests_passed", scope: !830, file: !73, line: 283, type: !41, align: 32)
!1077 = !DILocation(line: 283, column: 6, scope: !830)
!1078 = !DILocation(line: 283, column: 21, scope: !830)
!1079 = !DILocalVariable(name: "tests_skipped", scope: !830, file: !73, line: 284, type: !41, align: 32)
!1080 = !DILocation(line: 284, column: 6, scope: !830)
!1081 = !DILocation(line: 284, column: 22, scope: !830)
!1082 = !DILocalVariable(name: "test_count", scope: !830, file: !73, line: 285, type: !41, align: 32)
!1083 = !DILocation(line: 285, column: 6, scope: !830)
!1084 = !DILocation(line: 285, column: 19, scope: !830)
!1085 = !DILocalVariable(name: "name", scope: !830, file: !73, line: 286, type: !61, align: 64)
!1086 = !DILocation(line: 286, column: 10, scope: !830)
!1087 = !DILocation(line: 286, column: 17, scope: !830)
!1088 = !DILocalVariable(name: "len", scope: !830, file: !73, line: 287, type: !23, align: 64)
!1089 = !DILocation(line: 287, column: 6, scope: !830)
!1090 = !DILocation(line: 287, column: 12, scope: !830)
!1091 = !DILocation(line: 288, column: 26, scope: !830)
!1092 = !DILocation(line: 288, column: 2, scope: !830)
!1093 = !DILocation(line: 417, column: 27, scope: !1094, inlinedAt: !1096)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !279, line: 418, column: 1)
!1095 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !279, file: !279, line: 417, scopeLine: 417, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!1096 = !DILocation(line: 289, column: 2, scope: !830)
!1097 = !DILocation(line: 336, column: 34, scope: !1098, inlinedAt: !1100)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !279, line: 337, column: 1)
!1099 = distinct !DISubprogram(name: "append_string", linkageName: "append_string", scope: !279, file: !279, line: 336, scopeLine: 336, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!1100 = !DILocation(line: 427, column: 4, scope: !1095, inlinedAt: !1096)
!1101 = !DILocation(line: 341, column: 21, scope: !1099, inlinedAt: !1100)
!1102 = !DILocation(line: 341, column: 3, scope: !1099, inlinedAt: !1100)
!1103 = !DILocation(line: 290, column: 26, scope: !830)
!1104 = !DILocation(line: 290, column: 32, scope: !830)
!1105 = !DILocation(line: 290, column: 2, scope: !830)
!1106 = !DILocation(line: 291, column: 7, scope: !830)
!1107 = !DILocation(line: 264, column: 16, scope: !1108, inlinedAt: !1109)
!1108 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !293, file: !293, line: 262, scopeLine: 262, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!1109 = !DILocation(line: 291, column: 30, scope: !830)
!1110 = !DILocalVariable(name: "len", scope: !1111, file: !73, line: 238, type: !23, align: 64)
!1111 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !293, file: !293, line: 236, scopeLine: 236, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126, retainedNodes: !142)
!1112 = !DILocation(line: 238, column: 6, scope: !1111, inlinedAt: !1113)
!1113 = !DILocation(line: 264, column: 2, scope: !1108, inlinedAt: !1109)
!1114 = !DILocation(line: 184, column: 25, scope: !1115, inlinedAt: !1116)
!1115 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !293, file: !293, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!1116 = !DILocation(line: 238, column: 12, scope: !1111, inlinedAt: !1113)
!1117 = !DILocation(line: 184, column: 35, scope: !1115, inlinedAt: !1116)
!1118 = !DILocation(line: 167, column: 11, scope: !1115, inlinedAt: !1116)
!1119 = !DILocation(line: 239, column: 2, scope: !1111, inlinedAt: !1113)
!1120 = !DILocation(line: 108, column: 11, scope: !1111, inlinedAt: !1113)
!1121 = !DILocation(line: 244, column: 4, scope: !1111, inlinedAt: !1113)
!1122 = !DILocation(line: 247, column: 11, scope: !1111, inlinedAt: !1113)
!1123 = !DILocation(line: 246, column: 9, scope: !1111, inlinedAt: !1113)
!1124 = !DILocation(line: 292, column: 2, scope: !830)
!1125 = !DILocalVariable(name: "temp_state", scope: !830, file: !73, line: 293, type: !492, align: 64)
!1126 = !DILocation(line: 293, column: 12, scope: !830)
!1127 = !DILocation(line: 293, column: 25, scope: !830)
!1128 = !DILocation(line: 295, column: 17, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !830, file: !73, line: 295, column: 2)
!1130 = !DILocalVariable(name: ".temp", scope: !1129, file: !73, line: 295, type: !23, align: 64)
!1131 = !DILocalVariable(name: "unit", scope: !1132, file: !73, line: 295, type: !545, align: 64)
!1132 = distinct !DILexicalBlock(scope: !1129, file: !73, line: 296, column: 2)
!1133 = !DILocation(line: 295, column: 10, scope: !1132)
!1134 = !DILocation(line: 295, column: 17, scope: !1132)
!1135 = !DILocation(line: 297, column: 17, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !73, line: 296, column: 2)
!1137 = !DILocation(line: 297, column: 3, scope: !1136)
!1138 = !DILocation(line: 298, column: 7, scope: !1136)
!1139 = !DILocation(line: 298, column: 50, scope: !1136)
!1140 = !DILocation(line: 298, column: 31, scope: !1136)
!1141 = !DILocation(line: 300, column: 4, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1136, file: !73, line: 299, column: 3)
!1143 = !DILocation(line: 301, column: 4, scope: !1142)
!1144 = !DILocation(line: 303, column: 3, scope: !1136)
!1145 = !DILocation(line: 304, column: 3, scope: !1136)
!1146 = !DILocation(line: 305, column: 3, scope: !1136)
!1147 = !DILocation(line: 308, column: 31, scope: !1136)
!1148 = !DILocation(line: 308, column: 3, scope: !1136)
!1149 = !DILocation(line: 309, column: 27, scope: !1136)
!1150 = !DILocation(line: 309, column: 38, scope: !1136)
!1151 = !DILocation(line: 309, column: 3, scope: !1136)
!1152 = !DILocation(line: 310, column: 7, scope: !1136)
!1153 = !DILocation(line: 254, column: 15, scope: !1154, inlinedAt: !1155)
!1154 = distinct !DISubprogram(name: "print", linkageName: "print", scope: !293, file: !293, line: 252, scopeLine: 252, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!1155 = !DILocation(line: 312, column: 4, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1136, file: !73, line: 311, column: 3)
!1157 = !DILocation(line: 182, column: 24, scope: !1158, inlinedAt: !1159)
!1158 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !293, file: !293, line: 178, scopeLine: 178, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !126)
!1159 = !DILocation(line: 254, column: 2, scope: !1154, inlinedAt: !1155)
!1160 = !DILocation(line: 182, column: 34, scope: !1158, inlinedAt: !1159)
!1161 = !DILocation(line: 167, column: 11, scope: !1158, inlinedAt: !1159)
!1162 = !DILocation(line: 316, column: 22, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1136, file: !73, line: 315, column: 3)
!1164 = !DILocation(line: 316, column: 4, scope: !1163)
!1165 = !DILocation(line: 318, column: 9, scope: !1136)
!1166 = !DILocation(line: 247, column: 11, scope: !1136)
!1167 = !DILocation(line: 318, column: 3, scope: !1136)
!1168 = !DILocalVariable(name: "mem", scope: !1136, file: !73, line: 319, type: !1169, align: 64)
!1169 = !DICompositeType(tag: DW_TAG_structure_type, name: "TrackingAllocator", scope: !73, file: !73, line: 25, size: 768, align: 64, elements: !1170, identifier: "std.core.mem.allocator.TrackingAllocator")
!1170 = !{!1171, !1172, !1201, !1202, !1203, !1204}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "inner_allocator", scope: !1169, file: !73, line: 27, baseType: !29, size: 128, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1169, file: !73, line: 28, baseType: !1173, size: 384, align: 64, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AllocMap", scope: !73, file: !73, line: 16, baseType: !1174, align: 64)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap{ulong, Allocation}", scope: !73, file: !73, line: 29, size: 384, align: 64, elements: !1175, identifier: "std.collections.map.HashMap$ulong$std.core.mem.allocator.Allocation$")
!1175 = !{!1176, !1197, !1198, !1199, !1200}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1174, file: !73, line: 31, baseType: !1177, size: 128, align: 64)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{ulong, Allocation}*[]", size: 128, align: 64, elements: !1178, identifier: "Entry{ulong, Allocation}*[]")
!1178 = !{!1179, !1196}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1177, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64, dwarfAddressSpace: 0)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64, dwarfAddressSpace: 0)
