; ModuleID = 'std::math::vector'
source_filename = "std::math::vector"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"Matrix4x4{float}" = type { %.anon }
%.anon = type { %.anon.0 }
%.anon.0 = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float }
%"Matrix4x4{double}" = type { %.anon.1 }
%.anon.1 = type { %.anon.2 }
%.anon.2 = type { double, double, double, double, double, double, double, double, double, double, double, double, double, double, double, double }
%"QuaternionNumber{float}" = type { %.anon.3 }
%.anon.3 = type { float, float, float, float }
%"QuaternionNumber{double}" = type { %.anon.4 }
%.anon.4 = type { double, double, double, double }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

@.panic_msg = internal constant [44 x i8] c"Dereference of null pointer, 'v1' was null.\00", align 1
@.file = internal constant [10 x i8] c"vector.c3\00", align 1
@.func = internal constant [16 x i8] c"ortho_normalize\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@"$ct.ulong" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 8, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!304 = !DILocalVariable(name: "d11", scope: !271, file: !7, line: 206, type: !36, align: 64)
!305 = !DILocation(line: 206, column: 6, scope: !271, inlinedAt: !273)
!306 = !DILocation(line: 726, column: 64, scope: !307, inlinedAt: !308)
!307 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !66, file: !66, line: 726, scopeLine: 726, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!308 = !DILocation(line: 206, column: 12, scope: !271, inlinedAt: !273)
!309 = !DILocation(line: 726, column: 68, scope: !307, inlinedAt: !308)
!310 = !DILocation(line: 711, column: 85, scope: !311, inlinedAt: !312)
!311 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !66, file: !66, line: 711, scopeLine: 711, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!312 = !DILocation(line: 726, column: 63, scope: !307, inlinedAt: !308)
!313 = !DILocation(line: 711, column: 82, scope: !311, inlinedAt: !312)
!314 = !DILocalVariable(name: "d20", scope: !271, file: !7, line: 207, type: !36, align: 64)
!315 = !DILocation(line: 207, column: 6, scope: !271, inlinedAt: !273)
!316 = !DILocation(line: 726, column: 64, scope: !317, inlinedAt: !318)
!317 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !66, file: !66, line: 726, scopeLine: 726, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!318 = !DILocation(line: 207, column: 12, scope: !271, inlinedAt: !273)
!319 = !DILocation(line: 726, column: 68, scope: !317, inlinedAt: !318)
!320 = !DILocation(line: 711, column: 85, scope: !321, inlinedAt: !322)
!321 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !66, file: !66, line: 711, scopeLine: 711, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!322 = !DILocation(line: 726, column: 63, scope: !317, inlinedAt: !318)
!323 = !DILocation(line: 711, column: 82, scope: !321, inlinedAt: !322)
!324 = !DILocalVariable(name: "d21", scope: !271, file: !7, line: 208, type: !36, align: 64)
!325 = !DILocation(line: 208, column: 6, scope: !271, inlinedAt: !273)
!326 = !DILocation(line: 726, column: 64, scope: !327, inlinedAt: !328)
!327 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !66, file: !66, line: 726, scopeLine: 726, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!328 = !DILocation(line: 208, column: 12, scope: !271, inlinedAt: !273)
!329 = !DILocation(line: 726, column: 68, scope: !327, inlinedAt: !328)
!330 = !DILocation(line: 711, column: 85, scope: !331, inlinedAt: !332)
!331 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !66, file: !66, line: 711, scopeLine: 711, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!332 = !DILocation(line: 726, column: 63, scope: !327, inlinedAt: !328)
!333 = !DILocation(line: 711, column: 82, scope: !331, inlinedAt: !332)
!334 = !DILocalVariable(name: "denom", scope: !271, file: !7, line: 209, type: !36, align: 64)
!335 = !DILocation(line: 209, column: 6, scope: !271, inlinedAt: !273)
!336 = !DILocation(line: 209, column: 14, scope: !271, inlinedAt: !273)
!337 = !DILocation(line: 209, column: 20, scope: !271, inlinedAt: !273)
!338 = !DILocation(line: 209, column: 26, scope: !271, inlinedAt: !273)
!339 = !DILocation(line: 209, column: 32, scope: !271, inlinedAt: !273)
!340 = !DILocalVariable(name: "y", scope: !271, file: !7, line: 210, type: !36, align: 64)
!341 = !DILocation(line: 210, column: 6, scope: !271, inlinedAt: !273)
!342 = !DILocation(line: 210, column: 11, scope: !271, inlinedAt: !273)
!343 = !DILocation(line: 210, column: 17, scope: !271, inlinedAt: !273)
!344 = !DILocation(line: 210, column: 23, scope: !271, inlinedAt: !273)
!345 = !DILocation(line: 210, column: 29, scope: !271, inlinedAt: !273)
!346 = !DILocation(line: 210, column: 36, scope: !271, inlinedAt: !273)
!347 = !DILocation(line: 210, column: 10, scope: !271, inlinedAt: !273)
!348 = !DILocalVariable(name: "z", scope: !271, file: !7, line: 211, type: !36, align: 64)
!349 = !DILocation(line: 211, column: 6, scope: !271, inlinedAt: !273)
!350 = !DILocation(line: 211, column: 11, scope: !271, inlinedAt: !273)
!351 = !DILocation(line: 211, column: 17, scope: !271, inlinedAt: !273)
!352 = !DILocation(line: 211, column: 23, scope: !271, inlinedAt: !273)
!353 = !DILocation(line: 211, column: 29, scope: !271, inlinedAt: !273)
!354 = !DILocation(line: 211, column: 36, scope: !271, inlinedAt: !273)
!355 = !DILocation(line: 211, column: 10, scope: !271, inlinedAt: !273)
!356 = !DILocation(line: 212, column: 27, scope: !271, inlinedAt: !273)
!357 = !DILocation(line: 212, column: 23, scope: !271, inlinedAt: !273)
!358 = !DILocation(line: 212, column: 31, scope: !271, inlinedAt: !273)
!359 = !DILocation(line: 212, column: 9, scope: !271, inlinedAt: !273)
!360 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.float[<3>].transform", scope: !7, file: !7, line: 49, type: !361, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!361 = !DISubroutineType(types: !362)
!362 = !{!11, !11, !363}
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4{float}", scope: !7, file: !7, line: 61, size: 512, align: 32, elements: !364, identifier: "std.math.matrix.Matrix4x4$float$")
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, scope: !363, file: !7, line: 63, baseType: !366, size: 512, align: 32)
!366 = !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !7, line: 63, size: 512, align: 32, elements: !367)
!367 = !{!368, !387}
!368 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !7, line: 65, baseType: !369, size: 512, align: 32)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4.$anon.$anon", scope: !366, file: !7, line: 65, size: 512, align: 32, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !369, file: !7, line: 67, baseType: !12, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !369, file: !7, line: 67, baseType: !12, size: 32, align: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !369, file: !7, line: 67, baseType: !12, size: 32, align: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !369, file: !7, line: 67, baseType: !12, size: 32, align: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !369, file: !7, line: 68, baseType: !12, size: 32, align: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !369, file: !7, line: 68, baseType: !12, size: 32, align: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !369, file: !7, line: 68, baseType: !12, size: 32, align: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !369, file: !7, line: 68, baseType: !12, size: 32, align: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !369, file: !7, line: 69, baseType: !12, size: 32, align: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !369, file: !7, line: 69, baseType: !12, size: 32, align: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !369, file: !7, line: 69, baseType: !12, size: 32, align: 32, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !369, file: !7, line: 69, baseType: !12, size: 32, align: 32, offset: 352)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !369, file: !7, line: 70, baseType: !12, size: 32, align: 32, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !369, file: !7, line: 70, baseType: !12, size: 32, align: 32, offset: 416)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !369, file: !7, line: 70, baseType: !12, size: 32, align: 32, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !369, file: !7, line: 70, baseType: !12, size: 32, align: 32, offset: 480)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !366, file: !7, line: 72, baseType: !388, size: 512, align: 32)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 512, align: 32, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 16, lowerBound: 0)
!391 = !DILocalVariable(name: "self", arg: 1, scope: !360, file: !7, line: 49, type: !11)
!392 = !DILocation(line: 49, column: 36, scope: !360)
!393 = !DILocalVariable(name: "mat", arg: 2, scope: !360, file: !7, line: 49, type: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4f", scope: !7, file: !7, line: 8, baseType: !363, align: 32)
!395 = !DILocation(line: 49, column: 51, scope: !360)
!396 = !DILocation(line: 140, column: 3, scope: !397, inlinedAt: !398)
!397 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 137, scopeLine: 137, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!398 = !DILocation(line: 49, column: 59, scope: !360)
!399 = !DILocation(line: 140, column: 13, scope: !397, inlinedAt: !398)
!400 = !DILocation(line: 140, column: 15, scope: !397, inlinedAt: !398)
!401 = !DILocation(line: 140, column: 20, scope: !397, inlinedAt: !398)
!402 = !DILocation(line: 140, column: 30, scope: !397, inlinedAt: !398)
!403 = !DILocation(line: 140, column: 32, scope: !397, inlinedAt: !398)
!404 = !DILocation(line: 140, column: 37, scope: !397, inlinedAt: !398)
!405 = !DILocation(line: 140, column: 47, scope: !397, inlinedAt: !398)
!406 = !DILocation(line: 140, column: 49, scope: !397, inlinedAt: !398)
!407 = !DILocation(line: 140, column: 54, scope: !397, inlinedAt: !398)
!408 = !DILocation(line: 139, column: 9, scope: !397, inlinedAt: !398)
!409 = !DILocation(line: 141, column: 3, scope: !397, inlinedAt: !398)
!410 = !DILocation(line: 141, column: 13, scope: !397, inlinedAt: !398)
!411 = !DILocation(line: 141, column: 15, scope: !397, inlinedAt: !398)
!412 = !DILocation(line: 141, column: 20, scope: !397, inlinedAt: !398)
!413 = !DILocation(line: 141, column: 30, scope: !397, inlinedAt: !398)
!414 = !DILocation(line: 141, column: 32, scope: !397, inlinedAt: !398)
!415 = !DILocation(line: 141, column: 37, scope: !397, inlinedAt: !398)
!416 = !DILocation(line: 141, column: 47, scope: !397, inlinedAt: !398)
!417 = !DILocation(line: 141, column: 49, scope: !397, inlinedAt: !398)
!418 = !DILocation(line: 141, column: 54, scope: !397, inlinedAt: !398)
!419 = !DILocation(line: 142, column: 3, scope: !397, inlinedAt: !398)
!420 = !DILocation(line: 142, column: 13, scope: !397, inlinedAt: !398)
!421 = !DILocation(line: 142, column: 15, scope: !397, inlinedAt: !398)
!422 = !DILocation(line: 142, column: 20, scope: !397, inlinedAt: !398)
!423 = !DILocation(line: 142, column: 30, scope: !397, inlinedAt: !398)
!424 = !DILocation(line: 142, column: 32, scope: !397, inlinedAt: !398)
!425 = !DILocation(line: 142, column: 37, scope: !397, inlinedAt: !398)
!426 = !DILocation(line: 142, column: 47, scope: !397, inlinedAt: !398)
!427 = !DILocation(line: 142, column: 49, scope: !397, inlinedAt: !398)
!428 = !DILocation(line: 142, column: 54, scope: !397, inlinedAt: !398)
!429 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.double[<3>].transform", scope: !7, file: !7, line: 50, type: !430, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!430 = !DISubroutineType(types: !431)
!431 = !{!35, !35, !432}
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4{double}", scope: !7, file: !7, line: 61, size: 1024, align: 64, elements: !433, identifier: "std.math.matrix.Matrix4x4$double$")
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, scope: !432, file: !7, line: 63, baseType: !435, size: 1024, align: 64)
!435 = !DICompositeType(tag: DW_TAG_union_type, scope: !432, file: !7, line: 63, size: 1024, align: 64, elements: !436)
!436 = !{!437, !456}
!437 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !7, line: 65, baseType: !438, size: 1024, align: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4.$anon.$anon", scope: !435, file: !7, line: 65, size: 1024, align: 64, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !438, file: !7, line: 67, baseType: !36, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !438, file: !7, line: 67, baseType: !36, size: 64, align: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !438, file: !7, line: 67, baseType: !36, size: 64, align: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !438, file: !7, line: 67, baseType: !36, size: 64, align: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !438, file: !7, line: 68, baseType: !36, size: 64, align: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !438, file: !7, line: 68, baseType: !36, size: 64, align: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !438, file: !7, line: 68, baseType: !36, size: 64, align: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !438, file: !7, line: 68, baseType: !36, size: 64, align: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !438, file: !7, line: 69, baseType: !36, size: 64, align: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !438, file: !7, line: 69, baseType: !36, size: 64, align: 64, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !438, file: !7, line: 69, baseType: !36, size: 64, align: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !438, file: !7, line: 69, baseType: !36, size: 64, align: 64, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !438, file: !7, line: 70, baseType: !36, size: 64, align: 64, offset: 768)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !438, file: !7, line: 70, baseType: !36, size: 64, align: 64, offset: 832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !438, file: !7, line: 70, baseType: !36, size: 64, align: 64, offset: 896)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !438, file: !7, line: 70, baseType: !36, size: 64, align: 64, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !435, file: !7, line: 72, baseType: !457, size: 1024, align: 64)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1024, align: 64, elements: !389)
!458 = !DILocalVariable(name: "self", arg: 1, scope: !429, file: !7, line: 50, type: !35)
!459 = !DILocation(line: 50, column: 38, scope: !429)
!460 = !DILocalVariable(name: "mat", arg: 2, scope: !429, file: !7, line: 50, type: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4", scope: !7, file: !7, line: 9, baseType: !432, align: 64)
!462 = !DILocation(line: 50, column: 52, scope: !429)
!463 = !DILocation(line: 140, column: 3, scope: !464, inlinedAt: !465)
!464 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 137, scopeLine: 137, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!465 = !DILocation(line: 50, column: 60, scope: !429)
!466 = !DILocation(line: 140, column: 13, scope: !464, inlinedAt: !465)
!467 = !DILocation(line: 140, column: 15, scope: !464, inlinedAt: !465)
!468 = !DILocation(line: 140, column: 20, scope: !464, inlinedAt: !465)
!469 = !DILocation(line: 140, column: 30, scope: !464, inlinedAt: !465)
!470 = !DILocation(line: 140, column: 32, scope: !464, inlinedAt: !465)
!471 = !DILocation(line: 140, column: 37, scope: !464, inlinedAt: !465)
!472 = !DILocation(line: 140, column: 47, scope: !464, inlinedAt: !465)
!473 = !DILocation(line: 140, column: 49, scope: !464, inlinedAt: !465)
!474 = !DILocation(line: 140, column: 54, scope: !464, inlinedAt: !465)
!475 = !DILocation(line: 139, column: 9, scope: !464, inlinedAt: !465)
!476 = !DILocation(line: 141, column: 3, scope: !464, inlinedAt: !465)
!477 = !DILocation(line: 141, column: 13, scope: !464, inlinedAt: !465)
!478 = !DILocation(line: 141, column: 15, scope: !464, inlinedAt: !465)
!479 = !DILocation(line: 141, column: 20, scope: !464, inlinedAt: !465)
!480 = !DILocation(line: 141, column: 30, scope: !464, inlinedAt: !465)
!481 = !DILocation(line: 141, column: 32, scope: !464, inlinedAt: !465)
!482 = !DILocation(line: 141, column: 37, scope: !464, inlinedAt: !465)
!483 = !DILocation(line: 141, column: 47, scope: !464, inlinedAt: !465)
!484 = !DILocation(line: 141, column: 49, scope: !464, inlinedAt: !465)
!485 = !DILocation(line: 141, column: 54, scope: !464, inlinedAt: !465)
!486 = !DILocation(line: 142, column: 3, scope: !464, inlinedAt: !465)
!487 = !DILocation(line: 142, column: 13, scope: !464, inlinedAt: !465)
!488 = !DILocation(line: 142, column: 15, scope: !464, inlinedAt: !465)
!489 = !DILocation(line: 142, column: 20, scope: !464, inlinedAt: !465)
!490 = !DILocation(line: 142, column: 30, scope: !464, inlinedAt: !465)
!491 = !DILocation(line: 142, column: 32, scope: !464, inlinedAt: !465)
!492 = !DILocation(line: 142, column: 37, scope: !464, inlinedAt: !465)
!493 = !DILocation(line: 142, column: 47, scope: !464, inlinedAt: !465)
!494 = !DILocation(line: 142, column: 49, scope: !464, inlinedAt: !465)
!495 = !DILocation(line: 142, column: 54, scope: !464, inlinedAt: !465)
!496 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.float[<3>].angle", scope: !7, file: !7, line: 52, type: !497, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!497 = !DISubroutineType(types: !498)
!498 = !{!12, !11, !11}
!499 = !DILocalVariable(name: "self", arg: 1, scope: !496, file: !7, line: 52, type: !11)
!500 = !DILocation(line: 52, column: 27, scope: !496)
!501 = !DILocalVariable(name: "v2", arg: 2, scope: !496, file: !7, line: 52, type: !11)
!502 = !DILocation(line: 52, column: 44, scope: !496)
!503 = !DILocalVariable(name: "len", scope: !504, file: !7, line: 149, type: !12, align: 32)
!504 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 147, scopeLine: 147, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!505 = !DILocation(line: 149, column: 6, scope: !504, inlinedAt: !506)
!506 = !DILocation(line: 52, column: 51, scope: !496)
!507 = !DILocation(line: 149, column: 21, scope: !504, inlinedAt: !506)
!508 = !DILocation(line: 149, column: 12, scope: !504, inlinedAt: !506)
!509 = !DILocation(line: 683, column: 60, scope: !510, inlinedAt: !511)
!510 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !66, file: !66, line: 683, scopeLine: 683, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!511 = !DILocation(line: 684, column: 55, scope: !512, inlinedAt: !508)
!512 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !66, file: !66, line: 684, scopeLine: 684, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!513 = !DILocation(line: 683, column: 64, scope: !510, inlinedAt: !511)
!514 = !DILocation(line: 668, column: 81, scope: !515, inlinedAt: !516)
!515 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !66, file: !66, line: 668, scopeLine: 668, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!516 = !DILocation(line: 683, column: 59, scope: !510, inlinedAt: !511)
!517 = !DILocation(line: 668, column: 78, scope: !515, inlinedAt: !516)
!518 = !DILocalVariable(name: "dot", scope: !504, file: !7, line: 150, type: !12, align: 32)
!519 = !DILocation(line: 150, column: 6, scope: !504, inlinedAt: !506)
!520 = !DILocation(line: 683, column: 60, scope: !521, inlinedAt: !522)
!521 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !66, file: !66, line: 683, scopeLine: 683, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!522 = !DILocation(line: 150, column: 12, scope: !504, inlinedAt: !506)
!523 = !DILocation(line: 683, column: 64, scope: !521, inlinedAt: !522)
!524 = !DILocation(line: 668, column: 81, scope: !525, inlinedAt: !526)
!525 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !66, file: !66, line: 668, scopeLine: 668, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!526 = !DILocation(line: 683, column: 59, scope: !521, inlinedAt: !522)
!527 = !DILocation(line: 668, column: 78, scope: !525, inlinedAt: !526)
!528 = !DILocation(line: 170, column: 21, scope: !529, inlinedAt: !530)
!529 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !66, file: !66, line: 167, scopeLine: 167, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!530 = !DILocation(line: 151, column: 9, scope: !504, inlinedAt: !506)
!531 = !DILocation(line: 170, column: 10, scope: !529, inlinedAt: !530)
!532 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.double[<3>].angle", scope: !7, file: !7, line: 53, type: !533, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!533 = !DISubroutineType(types: !534)
!534 = !{!36, !35, !35}
!535 = !DILocalVariable(name: "self", arg: 1, scope: !532, file: !7, line: 53, type: !35)
!536 = !DILocation(line: 53, column: 29, scope: !532)
!537 = !DILocalVariable(name: "v2", arg: 2, scope: !532, file: !7, line: 53, type: !35)
!538 = !DILocation(line: 53, column: 47, scope: !532)
!539 = !DILocalVariable(name: "len", scope: !540, file: !7, line: 149, type: !36, align: 64)
!540 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 147, scopeLine: 147, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!541 = !DILocation(line: 149, column: 6, scope: !540, inlinedAt: !542)
!542 = !DILocation(line: 53, column: 54, scope: !532)
!543 = !DILocation(line: 149, column: 21, scope: !540, inlinedAt: !542)
!544 = !DILocation(line: 149, column: 12, scope: !540, inlinedAt: !542)
!545 = !DILocation(line: 726, column: 64, scope: !546, inlinedAt: !547)
!546 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !66, file: !66, line: 726, scopeLine: 726, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!547 = !DILocation(line: 727, column: 58, scope: !548, inlinedAt: !544)
!548 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !66, file: !66, line: 727, scopeLine: 727, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!549 = !DILocation(line: 726, column: 68, scope: !546, inlinedAt: !547)
!550 = !DILocation(line: 711, column: 85, scope: !551, inlinedAt: !552)
!551 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !66, file: !66, line: 711, scopeLine: 711, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!552 = !DILocation(line: 726, column: 63, scope: !546, inlinedAt: !547)
!553 = !DILocation(line: 711, column: 82, scope: !551, inlinedAt: !552)
!554 = !DILocalVariable(name: "dot", scope: !540, file: !7, line: 150, type: !36, align: 64)
!555 = !DILocation(line: 150, column: 6, scope: !540, inlinedAt: !542)
!556 = !DILocation(line: 726, column: 64, scope: !557, inlinedAt: !558)
!557 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !66, file: !66, line: 726, scopeLine: 726, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!558 = !DILocation(line: 150, column: 12, scope: !540, inlinedAt: !542)
!559 = !DILocation(line: 726, column: 68, scope: !557, inlinedAt: !558)
!560 = !DILocation(line: 711, column: 85, scope: !561, inlinedAt: !562)
!561 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !66, file: !66, line: 711, scopeLine: 711, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!562 = !DILocation(line: 726, column: 63, scope: !557, inlinedAt: !558)
!563 = !DILocation(line: 711, column: 82, scope: !561, inlinedAt: !562)
!564 = !DILocation(line: 172, column: 20, scope: !565, inlinedAt: !566)
!565 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !66, file: !66, line: 167, scopeLine: 167, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!566 = !DILocation(line: 151, column: 9, scope: !540, inlinedAt: !542)
!567 = !DILocation(line: 172, column: 10, scope: !565, inlinedAt: !566)
!568 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.float[<3>].refract", scope: !7, file: !7, line: 55, type: !569, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!569 = !DISubroutineType(types: !570)
!570 = !{!11, !11, !11, !12}
!571 = !DILocalVariable(name: "self", arg: 1, scope: !568, file: !7, line: 55, type: !11)
!572 = !DILocation(line: 55, column: 34, scope: !568)
!573 = !DILocalVariable(name: "n", arg: 2, scope: !568, file: !7, line: 55, type: !11)
!574 = !DILocation(line: 55, column: 51, scope: !568)
!575 = !DILocalVariable(name: "r", arg: 3, scope: !568, file: !7, line: 55, type: !12)
!576 = !DILocation(line: 55, column: 60, scope: !568)
!577 = !DILocalVariable(name: "dot", scope: !578, file: !7, line: 217, type: !12, align: 32)
!578 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 215, scopeLine: 215, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!579 = !DILocation(line: 217, column: 6, scope: !578, inlinedAt: !580)
!580 = !DILocation(line: 55, column: 66, scope: !568)
!581 = !DILocation(line: 683, column: 60, scope: !582, inlinedAt: !583)
!582 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !66, file: !66, line: 683, scopeLine: 683, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!583 = !DILocation(line: 217, column: 12, scope: !578, inlinedAt: !580)
!584 = !DILocation(line: 683, column: 64, scope: !582, inlinedAt: !583)
!585 = !DILocation(line: 668, column: 81, scope: !586, inlinedAt: !587)
!586 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !66, file: !66, line: 668, scopeLine: 668, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!587 = !DILocation(line: 683, column: 59, scope: !582, inlinedAt: !583)
!588 = !DILocation(line: 668, column: 78, scope: !586, inlinedAt: !587)
!589 = !DILocalVariable(name: "d", scope: !578, file: !7, line: 218, type: !12, align: 32)
!590 = !DILocation(line: 218, column: 6, scope: !578, inlinedAt: !580)
!591 = !DILocation(line: 218, column: 14, scope: !578, inlinedAt: !580)
!592 = !DILocation(line: 218, column: 18, scope: !578, inlinedAt: !580)
!593 = !DILocation(line: 218, column: 27, scope: !578, inlinedAt: !580)
!594 = !DILocation(line: 218, column: 33, scope: !578, inlinedAt: !580)
!595 = !DILocation(line: 218, column: 23, scope: !578, inlinedAt: !580)
!596 = !DILocation(line: 218, column: 10, scope: !578, inlinedAt: !580)
!597 = !DILocation(line: 220, column: 9, scope: !578, inlinedAt: !580)
!598 = !DILocation(line: 220, column: 17, scope: !578, inlinedAt: !580)
!599 = !DILocation(line: 220, column: 21, scope: !578, inlinedAt: !580)
!600 = !DILocation(line: 220, column: 25, scope: !578, inlinedAt: !580)
!601 = !DILocation(line: 220, column: 30, scope: !578, inlinedAt: !580)
!602 = !DILocation(line: 220, column: 34, scope: !578, inlinedAt: !580)
!603 = !DILocation(line: 31, column: 10, scope: !604, inlinedAt: !606)
!604 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !605, file: !605, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!605 = !DIFile(filename: "values.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!606 = !DILocation(line: 555, column: 25, scope: !607, inlinedAt: !608)
!607 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !66, file: !66, line: 555, scopeLine: 555, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!608 = !DILocation(line: 220, column: 40, scope: !578, inlinedAt: !580)
!609 = !DILocation(line: 220, column: 57, scope: !578, inlinedAt: !580)
!610 = !DILocation(line: 220, column: 29, scope: !578, inlinedAt: !580)
!611 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.double[<3>].refract", scope: !7, file: !7, line: 56, type: !612, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!612 = !DISubroutineType(types: !613)
!613 = !{!35, !35, !35, !36}
!614 = !DILocalVariable(name: "self", arg: 1, scope: !611, file: !7, line: 56, type: !35)
!615 = !DILocation(line: 56, column: 36, scope: !611)
!616 = !DILocalVariable(name: "n", arg: 2, scope: !611, file: !7, line: 56, type: !35)
!617 = !DILocation(line: 56, column: 54, scope: !611)
!618 = !DILocalVariable(name: "r", arg: 3, scope: !611, file: !7, line: 56, type: !36)
!619 = !DILocation(line: 56, column: 64, scope: !611)
!620 = !DILocalVariable(name: "dot", scope: !621, file: !7, line: 217, type: !36, align: 64)
!621 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 215, scopeLine: 215, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!622 = !DILocation(line: 217, column: 6, scope: !621, inlinedAt: !623)
!623 = !DILocation(line: 56, column: 70, scope: !611)
!624 = !DILocation(line: 726, column: 64, scope: !625, inlinedAt: !626)
!625 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !66, file: !66, line: 726, scopeLine: 726, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!626 = !DILocation(line: 217, column: 12, scope: !621, inlinedAt: !623)
!627 = !DILocation(line: 726, column: 68, scope: !625, inlinedAt: !626)
!628 = !DILocation(line: 711, column: 85, scope: !629, inlinedAt: !630)
!629 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !66, file: !66, line: 711, scopeLine: 711, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!630 = !DILocation(line: 726, column: 63, scope: !625, inlinedAt: !626)
!631 = !DILocation(line: 711, column: 82, scope: !629, inlinedAt: !630)
!632 = !DILocalVariable(name: "d", scope: !621, file: !7, line: 218, type: !36, align: 64)
!633 = !DILocation(line: 218, column: 6, scope: !621, inlinedAt: !623)
!634 = !DILocation(line: 218, column: 14, scope: !621, inlinedAt: !623)
!635 = !DILocation(line: 218, column: 18, scope: !621, inlinedAt: !623)
!636 = !DILocation(line: 218, column: 27, scope: !621, inlinedAt: !623)
!637 = !DILocation(line: 218, column: 33, scope: !621, inlinedAt: !623)
!638 = !DILocation(line: 218, column: 23, scope: !621, inlinedAt: !623)
!639 = !DILocation(line: 218, column: 10, scope: !621, inlinedAt: !623)
!640 = !DILocation(line: 220, column: 9, scope: !621, inlinedAt: !623)
!641 = !DILocation(line: 220, column: 17, scope: !621, inlinedAt: !623)
!642 = !DILocation(line: 220, column: 21, scope: !621, inlinedAt: !623)
!643 = !DILocation(line: 220, column: 25, scope: !621, inlinedAt: !623)
!644 = !DILocation(line: 220, column: 30, scope: !621, inlinedAt: !623)
!645 = !DILocation(line: 220, column: 34, scope: !621, inlinedAt: !623)
!646 = !DILocation(line: 31, column: 10, scope: !647, inlinedAt: !648)
!647 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !605, file: !605, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!648 = !DILocation(line: 555, column: 25, scope: !649, inlinedAt: !650)
!649 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !66, file: !66, line: 555, scopeLine: 555, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!650 = !DILocation(line: 220, column: 40, scope: !621, inlinedAt: !623)
!651 = !DILocation(line: 220, column: 57, scope: !621, inlinedAt: !623)
!652 = !DILocation(line: 220, column: 29, scope: !621, inlinedAt: !623)
!653 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.float[<3>].rotate_quat", scope: !7, file: !7, line: 58, type: !654, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!654 = !DISubroutineType(types: !655)
!655 = !{!11, !11, !656}
!656 = !DICompositeType(tag: DW_TAG_union_type, name: "QuaternionNumber{float}", scope: !7, file: !7, line: 18, size: 128, align: 32, elements: !657, identifier: "std.math.quaternion.QuaternionNumber$float$")
!657 = !{!658, !665}
!658 = !DIDerivedType(tag: DW_TAG_member, scope: !656, file: !7, line: 20, baseType: !659, size: 128, align: 32)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "QuaternionNumber.$anon", scope: !656, file: !7, line: 20, size: 128, align: 32, elements: !660)
!660 = !{!661, !662, !663, !664}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !659, file: !7, line: 22, baseType: !12, size: 32, align: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !659, file: !7, line: 22, baseType: !12, size: 32, align: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !659, file: !7, line: 22, baseType: !12, size: 32, align: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !659, file: !7, line: 22, baseType: !12, size: 32, align: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !656, file: !7, line: 24, baseType: !666, size: 128, align: 32)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, align: 32, flags: DIFlagVector, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 4, lowerBound: 0)
!669 = !DILocalVariable(name: "self", arg: 1, scope: !653, file: !7, line: 58, type: !11)
!670 = !DILocation(line: 58, column: 38, scope: !653)
!671 = !DILocalVariable(name: "q", arg: 2, scope: !653, file: !7, line: 58, type: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternionf", scope: !7, file: !7, line: 5, baseType: !656, align: 32)
!673 = !DILocation(line: 58, column: 56, scope: !653)
!674 = !DILocation(line: 58, column: 66, scope: !653)
!675 = !DILocation(line: 58, column: 62, scope: !653)
!676 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.double[<3>].rotate_quat", scope: !7, file: !7, line: 59, type: !677, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!677 = !DISubroutineType(types: !678)
!678 = !{!35, !35, !679}
!679 = !DICompositeType(tag: DW_TAG_union_type, name: "QuaternionNumber{double}", scope: !7, file: !7, line: 18, size: 256, align: 64, elements: !680, identifier: "std.math.quaternion.QuaternionNumber$double$")
!680 = !{!681, !688}
!681 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !7, line: 20, baseType: !682, size: 256, align: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "QuaternionNumber.$anon", scope: !679, file: !7, line: 20, size: 256, align: 64, elements: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !682, file: !7, line: 22, baseType: !36, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !682, file: !7, line: 22, baseType: !36, size: 64, align: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !682, file: !7, line: 22, baseType: !36, size: 64, align: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !682, file: !7, line: 22, baseType: !36, size: 64, align: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !679, file: !7, line: 24, baseType: !689, size: 256, align: 64)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 256, align: 64, flags: DIFlagVector, elements: !667)
!690 = !DILocalVariable(name: "self", arg: 1, scope: !676, file: !7, line: 59, type: !35)
!691 = !DILocation(line: 59, column: 40, scope: !676)
!692 = !DILocalVariable(name: "q", arg: 2, scope: !676, file: !7, line: 59, type: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternion", scope: !7, file: !7, line: 6, baseType: !679, align: 64)
!694 = !DILocation(line: 59, column: 57, scope: !676)
!695 = !DILocation(line: 59, column: 67, scope: !676)
!696 = !DILocation(line: 59, column: 63, scope: !676)
!697 = distinct !DISubprogram(name: "rotate_axis", linkageName: "std.math.vector.float[<3>].rotate_axis", scope: !7, file: !7, line: 61, type: !569, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !15)
!698 = !DILocalVariable(name: "self", arg: 1, scope: !697, file: !7, line: 61, type: !11)
!699 = !DILocation(line: 61, column: 38, scope: !697)
!700 = !DILocalVariable(name: "axis", arg: 2, scope: !697, file: !7, line: 61, type: !11)
!701 = !DILocation(line: 61, column: 55, scope: !697)
!702 = !DILocalVariable(name: "angle", arg: 3, scope: !697, file: !7, line: 61, type: !12)
!703 = !DILocation(line: 61, column: 67, scope: !697)
!704 = !DILocalVariable(name: "len", scope: !705, file: !7, line: 633, type: !12, align: 32)
!705 = distinct !DISubprogram(name: "normalize", linkageName: "normalize", scope: !66, file: !66, line: 631, scopeLine: 631, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!706 = !DILocation(line: 633, column: 6, scope: !705, inlinedAt: !707)
!707 = !DILocation(line: 686, column: 56, scope: !708, inlinedAt: !709)
!708 = distinct !DISubprogram(name: "normalize", linkageName: "normalize", scope: !66, file: !66, line: 686, scopeLine: 686, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!709 = !DILocation(line: 163, column: 9, scope: !710, inlinedAt: !711)
!710 = distinct !DISubprogram(name: "rotate_axis_angle", linkageName: "rotate_axis_angle", scope: !7, file: !7, line: 161, scopeLine: 161, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !15)
!711 = !DILocation(line: 61, column: 77, scope: !697)
!712 = !DILocation(line: 683, column: 60, scope: !713, inlinedAt: !714)
!713 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !66, file: !66, line: 683, scopeLine: 683, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!714 = !DILocation(line: 684, column: 55, scope: !715, inlinedAt: !716)
!715 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !66, file: !66, line: 684, scopeLine: 684, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!716 = !DILocation(line: 633, column: 12, scope: !705, inlinedAt: !707)
!717 = !DILocation(line: 683, column: 64, scope: !713, inlinedAt: !714)
!718 = !DILocation(line: 668, column: 81, scope: !719, inlinedAt: !720)
!719 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !66, file: !66, line: 668, scopeLine: 668, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!720 = !DILocation(line: 683, column: 59, scope: !713, inlinedAt: !714)
!721 = !DILocation(line: 668, column: 78, scope: !719, inlinedAt: !720)
!722 = !DILocation(line: 634, column: 6, scope: !705, inlinedAt: !707)
!723 = !DILocation(line: 634, column: 23, scope: !705, inlinedAt: !707)
!724 = !DILocation(line: 635, column: 9, scope: !705, inlinedAt: !707)
!725 = !DILocation(line: 635, column: 18, scope: !705, inlinedAt: !707)
!726 = !DILocation(line: 635, column: 14, scope: !705, inlinedAt: !707)
!727 = !DILocation(line: 165, column: 2, scope: !710, inlinedAt: !711)
