; ModuleID = 'std::encoding::pem'
source_filename = "std::encoding::pem"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%Base64Alphabet = type { [64 x i8], [256 x i8] }
%Pem = type { %any, %"char[]", %"LinkedHashMap{String, String}", %"char[]" }
%"LinkedHashMap{String, String}" = type { %"LinkedEntry{String, String}*[]", %any, i64, i64, float, ptr, ptr }
%"LinkedEntry{String, String}*[]" = type { ptr, i64 }
%"char[][2][]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"List{Pem}" = type { i64, i64, %any, ptr }
%"char[][]" = type { ptr, i64 }
%"Pem[]" = type { ptr, i64 }
%"char[][2][][]" = type { ptr, i64 }

@"$ct.std.encoding.pem.Pem" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 120, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8
@.str = private unnamed_addr constant [25 x i8] c"PRIVACY-ENHANCED MESSAGE\00", align 1
@std.encoding.pem.DEFAULT_TAG = weak local_unnamed_addr constant %"char[]" { ptr @.str, i64 24 }, align 8, !dbg !0
@std.encoding.pem.TAG_SET.12962 = internal unnamed_addr constant i128 42089961299097578121109438464, align 16, !dbg !12
@std.encoding.pem.HEADER_KEY_SET.12963 = internal unnamed_addr constant i128 116972063611741436228934278030836105216, align 16, !dbg !16

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DEFAULT_TAG", linkageName: "std.encoding.pem.DEFAULT_TAG", scope: !2, file: !2, line: 13, type: !3, isLocal: false, isDefinition: true, align: 64)
!2 = !DIFile(filename: "pem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/encoding")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !4)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !5, identifier: "char[]")
!5 = !{!6, !9}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !4, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !4, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !11)
!11 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "TAG_SET", linkageName: "std.encoding.pem.TAG_SET.12962", scope: !2, file: !2, line: 16, type: !14, isLocal: true, isDefinition: true, align: 128)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsciiCharset", scope: !2, file: !2, line: 115, baseType: !15, align: 128)
!15 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "HEADER_KEY_SET", linkageName: "std.encoding.pem.HEADER_KEY_SET.12963", scope: !2, file: !2, line: 18, type: !14, isLocal: true, isDefinition: true, align: 128)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "EB_DELIMITER", linkageName: "std.encoding.pem.EB_DELIMITER.12964", scope: !2, file: !2, line: 21, type: !3, isLocal: true, isDefinition: true, align: 64)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "PRE_EB_PREFIX", linkageName: "std.encoding.pem.PRE_EB_PREFIX.12965", scope: !2, file: !2, line: 23, type: !3, isLocal: true, isDefinition: true, align: 64)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "POST_EB_PREFIX", linkageName: "std.encoding.pem.POST_EB_PREFIX.12966", scope: !2, file: !2, line: 25, type: !3, isLocal: true, isDefinition: true, align: 64)
!24 = !{i32 2, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 2, !"wchar_size", i32 4}
!27 = !{i32 4, !"PIC Level", i32 2}
!28 = !{i32 1, !"uwtable", i32 1}
!29 = !{i32 2, !"frame-pointer", i32 1}
!30 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !31, splitDebugInlining: false)
!31 = !{!0, !12, !16, !18, !20, !22}
!32 = distinct !DISubprogram(name: "copy", linkageName: "std.encoding.pem.Pem.copy", scope: !2, file: !2, line: 101, type: !33, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !30, retainedNodes: !73)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !72, !38}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pem", scope: !2, file: !2, line: 53, size: 960, align: 64, elements: !36, identifier: "std.encoding.pem.Pem")
!36 = !{!37, !44, !45, !71}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !35, file: !2, line: 56, baseType: !38, size: 128, align: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !39, identifier: "Allocator")
!39 = !{!40, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !38, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !38, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !35, file: !2, line: 58, baseType: !3, size: 128, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !35, file: !2, line: 60, baseType: !46, size: 576, align: 64, offset: 256)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkedHashMap{String, String}", scope: !35, file: !2, line: 26, size: 576, align: 64, elements: !47, identifier: "std.collections.map.LinkedHashMap$String$String$")
!47 = !{!48, !64, !65, !66, !67, !69, !70}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !46, file: !2, line: 28, baseType: !49, size: 128, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkedEntry{String, String}*[]", size: 128, align: 64, elements: !50, identifier: "LinkedEntry{String, String}*[]")
!50 = !{!51, !63}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkedEntry{String, String}", scope: !2, file: !2, line: 13, size: 512, align: 64, elements: !55, identifier: "std.collections.map.LinkedEntry$String$String$")
!55 = !{!56, !58, !59, !60, !61, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !54, file: !2, line: 15, baseType: !57, size: 32, align: 32)
!57 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !54, file: !2, line: 16, baseType: !3, size: 128, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !54, file: !2, line: 17, baseType: !3, size: 128, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !2, line: 19, baseType: !53, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !54, file: !2, line: 21, baseType: !53, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !54, file: !2, line: 23, baseType: !53, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, baseType: !10, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !46, file: !2, line: 29, baseType: !38, size: 128, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !46, file: !2, line: 30, baseType: !10, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !46, file: !2, line: 31, baseType: !10, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !46, file: !2, line: 32, baseType: !68, size: 32, align: 32, offset: 384)
!68 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !46, file: !2, line: 34, baseType: !53, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !46, file: !2, line: 36, baseType: !53, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !35, file: !2, line: 62, baseType: !4, size: 128, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!73 = !{}
!74 = !DILocation(line: 102, column: 1, scope: !32)
!75 = !DILocalVariable(name: "self", arg: 1, scope: !32, file: !2, line: 101, type: !72)
!76 = !DILocation(line: 101, column: 17, scope: !32)
!77 = !DILocalVariable(name: "allocator", arg: 2, scope: !32, file: !2, line: 101, type: !38)
!78 = !DILocation(line: 101, column: 34, scope: !32)
!79 = !DILocalVariable(name: "result", scope: !32, file: !2, line: 103, type: !35, align: 64)
!80 = !DILocation(line: 103, column: 6, scope: !32)
!81 = !DILocation(line: 103, column: 33, scope: !32)
!82 = !DILocation(line: 103, column: 44, scope: !32)
!83 = !DILocation(line: 103, column: 15, scope: !32)
!84 = !DILocation(line: 104, column: 2, scope: !32)
!85 = !DILocalVariable(name: "entry", scope: !86, file: !2, line: 319, type: !53, align: 64)
!86 = distinct !DISubprogram(name: "@each_entry", linkageName: "@each_entry", scope: !87, file: !87, line: 317, scopeLine: 317, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!87 = !DIFile(filename: "linked_hashmap.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!88 = !DILocation(line: 319, column: 15, scope: !86, inlinedAt: !89)
!89 = !DILocation(line: 311, column: 2, scope: !90, inlinedAt: !84)
!90 = distinct !DISubprogram(name: "@each", linkageName: "@each", scope: !87, file: !87, line: 309, scopeLine: 309, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!91 = !DILocation(line: 319, column: 23, scope: !86, inlinedAt: !89)
!92 = !DILocation(line: 320, column: 2, scope: !86, inlinedAt: !89)
!93 = !DILocation(line: 320, column: 9, scope: !94, inlinedAt: !89)
!94 = distinct !DILexicalBlock(scope: !86, file: !87, line: 320, column: 2)
!95 = !DILocalVariable(name: "entry", scope: !90, file: !2, line: 311, type: !53, align: 64)
!96 = !DILocation(line: 311, column: 33, scope: !90, inlinedAt: !84)
!97 = !DILocation(line: 322, column: 9, scope: !98, inlinedAt: !89)
!98 = distinct !DILexicalBlock(scope: !99, file: !87, line: 322, column: 3)
!99 = distinct !DILexicalBlock(scope: !94, file: !87, line: 321, column: 2)
!100 = !DILocalVariable(name: "key", scope: !32, file: !2, line: 104, type: !3, align: 64)
!101 = !DILocation(line: 104, column: 29, scope: !32)
!102 = !DILocalVariable(name: "value", scope: !32, file: !2, line: 104, type: !3, align: 64)
!103 = !DILocation(line: 104, column: 41, scope: !32)
!104 = !DILocation(line: 313, column: 9, scope: !105, inlinedAt: !84)
!105 = distinct !DILexicalBlock(scope: !106, file: !87, line: 313, column: 3)
!106 = distinct !DILexicalBlock(scope: !90, file: !87, line: 312, column: 2)
!107 = !DILocation(line: 313, column: 20, scope: !105, inlinedAt: !84)
!108 = !DILocation(line: 106, column: 26, scope: !109)
!109 = distinct !DILexicalBlock(scope: !32, file: !2, line: 105, column: 2)
!110 = !DILocation(line: 106, column: 3, scope: !109)
!111 = !DILocation(line: 323, column: 11, scope: !99, inlinedAt: !89)
!112 = !DILocation(line: 108, column: 9, scope: !32)
!113 = distinct !DISubprogram(name: "free", linkageName: "std.encoding.pem.Pem.free", scope: !2, file: !2, line: 114, type: !114, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !30, retainedNodes: !73)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !72}
!116 = !DILocation(line: 115, column: 1, scope: !113)
!117 = !DILocalVariable(name: "self", arg: 1, scope: !113, file: !2, line: 114, type: !72)
!118 = !DILocation(line: 114, column: 18, scope: !113)
!119 = !DILocation(line: 116, column: 21, scope: !113)
!120 = !DILocation(line: 369, column: 11, scope: !121, inlinedAt: !123)
!121 = distinct !DISubprogram(name: "zero_volatile", linkageName: "zero_volatile", scope: !122, file: !122, line: 367, scopeLine: 367, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!122 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!123 = !DILocation(line: 116, column: 2, scope: !113)
!124 = !DILocation(line: 369, column: 30, scope: !121, inlinedAt: !123)
!125 = !DILocation(line: 369, column: 40, scope: !121, inlinedAt: !123)
!126 = !DILocation(line: 117, column: 6, scope: !113)
!127 = !DILocation(line: 117, column: 24, scope: !113)
!128 = !DILocation(line: 119, column: 3, scope: !129)
!129 = distinct !DILexicalBlock(scope: !113, file: !2, line: 118, column: 2)
!130 = !DILocalVariable(name: "entry", scope: !131, file: !2, line: 319, type: !53, align: 64)
!131 = distinct !DISubprogram(name: "@each_entry", linkageName: "@each_entry", scope: !87, file: !87, line: 317, scopeLine: 317, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!132 = !DILocation(line: 319, column: 15, scope: !131, inlinedAt: !133)
!133 = !DILocation(line: 311, column: 2, scope: !134, inlinedAt: !128)
!134 = distinct !DISubprogram(name: "@each", linkageName: "@each", scope: !87, file: !87, line: 309, scopeLine: 309, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!135 = !DILocation(line: 319, column: 23, scope: !131, inlinedAt: !133)
!136 = !DILocation(line: 320, column: 2, scope: !131, inlinedAt: !133)
!137 = !DILocation(line: 320, column: 9, scope: !138, inlinedAt: !133)
!138 = distinct !DILexicalBlock(scope: !131, file: !87, line: 320, column: 2)
!139 = !DILocalVariable(name: "entry", scope: !134, file: !2, line: 311, type: !53, align: 64)
!140 = !DILocation(line: 311, column: 33, scope: !134, inlinedAt: !128)
!141 = !DILocation(line: 322, column: 9, scope: !142, inlinedAt: !133)
!142 = distinct !DILexicalBlock(scope: !143, file: !87, line: 322, column: 3)
!143 = distinct !DILexicalBlock(scope: !138, file: !87, line: 321, column: 2)
!144 = !DILocalVariable(name: "key", scope: !129, file: !2, line: 119, type: !3, align: 64)
!145 = !DILocation(line: 119, column: 30, scope: !129)
!146 = !DILocalVariable(name: "value", scope: !129, file: !2, line: 119, type: !3, align: 64)
!147 = !DILocation(line: 119, column: 42, scope: !129)
!148 = !DILocation(line: 313, column: 9, scope: !149, inlinedAt: !128)
!149 = distinct !DILexicalBlock(scope: !150, file: !87, line: 313, column: 3)
!150 = distinct !DILexicalBlock(scope: !134, file: !87, line: 312, column: 2)
!151 = !DILocation(line: 313, column: 20, scope: !149, inlinedAt: !128)
!152 = !DILocation(line: 121, column: 20, scope: !153)
!153 = distinct !DILexicalBlock(scope: !129, file: !2, line: 120, column: 3)
!154 = !DILocation(line: 119, column: 6, scope: !155, inlinedAt: !157)
!155 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !156, file: !156, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!156 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!157 = !DILocation(line: 121, column: 4, scope: !153)
!158 = !DILocation(line: 119, column: 18, scope: !155, inlinedAt: !157)
!159 = !DILocation(line: 123, column: 20, scope: !155, inlinedAt: !157)
!160 = !DILocation(line: 123, column: 2, scope: !155, inlinedAt: !157)
!161 = !DILocation(line: 323, column: 11, scope: !143, inlinedAt: !133)
!162 = !DILocation(line: 123, column: 3, scope: !129)
!163 = !DILocation(line: 124, column: 3, scope: !129)
!164 = !DILocation(line: 124, column: 17, scope: !129)
!165 = !DILocation(line: 125, column: 19, scope: !129)
!166 = !DILocation(line: 125, column: 35, scope: !129)
!167 = !DILocation(line: 119, column: 6, scope: !168, inlinedAt: !169)
!168 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !156, file: !156, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!169 = !DILocation(line: 125, column: 3, scope: !129)
!170 = !DILocation(line: 119, column: 18, scope: !168, inlinedAt: !169)
!171 = !DILocation(line: 123, column: 20, scope: !168, inlinedAt: !169)
!172 = !DILocation(line: 123, column: 2, scope: !168, inlinedAt: !169)
!173 = !DILocation(line: 127, column: 36, scope: !174, inlinedAt: !176)
!174 = distinct !DISubprogram(name: "@as_char_view", linkageName: "@as_char_view", scope: !175, file: !175, line: 597, scopeLine: 597, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!175 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!176 = !DILocation(line: 127, column: 21, scope: !113)
!177 = !DILocation(line: 369, column: 11, scope: !178, inlinedAt: !179)
!178 = distinct !DISubprogram(name: "zero_volatile", linkageName: "zero_volatile", scope: !122, file: !122, line: 367, scopeLine: 367, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!179 = !DILocation(line: 127, column: 2, scope: !113)
!180 = !DILocation(line: 369, column: 30, scope: !178, inlinedAt: !179)
!181 = !DILocation(line: 369, column: 40, scope: !178, inlinedAt: !179)
!182 = distinct !DISubprogram(name: "add_header", linkageName: "std.encoding.pem.Pem.add_header", scope: !2, file: !2, line: 130, type: !183, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !30, retainedNodes: !73)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !72, !3, !3}
!185 = !DILocation(line: 131, column: 1, scope: !182)
!186 = !DILocalVariable(name: "self", arg: 1, scope: !182, file: !2, line: 130, type: !72)
!187 = !DILocation(line: 130, column: 24, scope: !182)
!188 = !DILocalVariable(name: "key", arg: 2, scope: !182, file: !2, line: 130, type: !3)
!189 = !DILocation(line: 130, column: 38, scope: !182)
!190 = !DILocalVariable(name: "value", arg: 3, scope: !182, file: !2, line: 130, type: !3)
!191 = !DILocation(line: 130, column: 50, scope: !182)
!192 = !DILocation(line: 132, column: 8, scope: !182)
!193 = !DILocation(line: 132, column: 31, scope: !182)
!194 = !DILocation(line: 132, column: 2, scope: !182)
!195 = !DILocation(line: 133, column: 33, scope: !182)
!196 = !DILocation(line: 133, column: 22, scope: !182)
!197 = !DILocation(line: 133, column: 2, scope: !182)
!198 = distinct !DISubprogram(name: "create", linkageName: "std.encoding.pem.create", scope: !2, file: !2, line: 80, type: !199, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !30, retainedNodes: !73)
!199 = !DISubroutineType(types: !200)
!200 = !{!35, !38, !4, !3, !201}
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[2][]", size: 128, align: 64, elements: !202, identifier: "String[2][]")
!202 = !{!203, !208}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !201, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64, dwarfAddressSpace: 0)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 256, align: 64, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 2, lowerBound: 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !201, baseType: !10, size: 64, align: 64, offset: 64)
!209 = !DILocalVariable(name: "allocator", arg: 1, scope: !198, file: !2, line: 80, type: !38)
!210 = !DILocation(line: 80, column: 25, scope: !198)
!211 = !DILocalVariable(name: "data", arg: 2, scope: !198, file: !2, line: 80, type: !4)
!212 = !DILocation(line: 80, column: 43, scope: !198)
!213 = !DILocalVariable(name: "tag", arg: 3, scope: !198, file: !2, line: 80, type: !3)
!214 = !DILocation(line: 80, column: 56, scope: !198)
!215 = !DILocalVariable(name: "args", arg: 4, scope: !198, file: !2, line: 80, type: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "PemHeader[]", size: 128, align: 64, elements: !217, identifier: "PemHeader[]")
!217 = !{!218, !221}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !216, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64, dwarfAddressSpace: 0)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PemHeader", scope: !2, file: !2, line: 27, baseType: !205, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !216, baseType: !10, size: 64, align: 64, offset: 64)
!222 = !DILocation(line: 80, column: 74, scope: !198)
!223 = !DILocalVariable(name: "result", scope: !198, file: !2, line: 82, type: !35, align: 64)
!224 = !DILocation(line: 82, column: 6, scope: !198)
!225 = !DILocation(line: 83, column: 16, scope: !198)
!226 = !DILocation(line: 84, column: 19, scope: !198)
!227 = !DILocation(line: 84, column: 10, scope: !198)
!228 = !DILocation(line: 352, column: 29, scope: !229, inlinedAt: !231)
!229 = distinct !DILexicalBlock(scope: !230, file: !156, line: 353, column: 1)
!230 = distinct !DISubprogram(name: "clone_slice", linkageName: "clone_slice", scope: !156, file: !156, line: 352, scopeLine: 352, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!231 = !DILocation(line: 85, column: 11, scope: !198)
!232 = !DILocation(line: 354, column: 6, scope: !230, inlinedAt: !231)
!233 = !DILocation(line: 354, column: 31, scope: !230, inlinedAt: !231)
!234 = !DILocalVariable(name: "new_arr", scope: !230, file: !2, line: 358, type: !4, align: 64)
!235 = !DILocation(line: 358, column: 10, scope: !230, inlinedAt: !231)
!236 = !DILocation(line: 358, column: 48, scope: !230, inlinedAt: !231)
!237 = !DILocation(line: 270, column: 55, scope: !238, inlinedAt: !239)
!238 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !156, file: !156, line: 268, scopeLine: 268, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!239 = !DILocation(line: 262, column: 9, scope: !240, inlinedAt: !241)
!240 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !156, file: !156, line: 260, scopeLine: 260, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!241 = !DILocation(line: 358, column: 20, scope: !230, inlinedAt: !231)
!242 = !DILocation(line: 270, column: 40, scope: !238, inlinedAt: !239)
!243 = !DILocation(line: 97, column: 6, scope: !244, inlinedAt: !245)
!244 = distinct !DISubprogram(name: "calloc_try", linkageName: "calloc_try", scope: !156, file: !156, line: 95, scopeLine: 95, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!245 = !DILocation(line: 270, column: 18, scope: !238, inlinedAt: !239)
!246 = !DILocation(line: 97, column: 20, scope: !244, inlinedAt: !245)
!247 = !DILocation(line: 98, column: 27, scope: !244, inlinedAt: !245)
!248 = !DILocation(line: 38, column: 12, scope: !244, inlinedAt: !245)
!249 = !DILocation(line: 1039, column: 9, scope: !250, inlinedAt: !252)
!250 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !251, file: !251, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!251 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!252 = !DILocation(line: 38, column: 26, scope: !244, inlinedAt: !245)
!253 = !DILocation(line: 1039, column: 20, scope: !250, inlinedAt: !252)
!254 = !DILocation(line: 1039, column: 25, scope: !250, inlinedAt: !252)
!255 = !DILocation(line: 1039, column: 19, scope: !250, inlinedAt: !252)
!256 = !DILocation(line: 98, column: 9, scope: !244, inlinedAt: !245)
!257 = !DILocation(line: 270, column: 67, scope: !238, inlinedAt: !239)
!258 = !DILocation(line: 270, column: 9, scope: !238, inlinedAt: !239)
!259 = !DILocation(line: 359, column: 12, scope: !230, inlinedAt: !231)
!260 = !DILocation(line: 359, column: 26, scope: !230, inlinedAt: !231)
!261 = !DILocation(line: 359, column: 32, scope: !230, inlinedAt: !231)
!262 = !DILocation(line: 359, column: 36, scope: !230, inlinedAt: !231)
!263 = !DILocation(line: 395, column: 23, scope: !264, inlinedAt: !266)
!264 = distinct !DILexicalBlock(scope: !265, file: !122, line: 396, column: 1)
!265 = distinct !DISubprogram(name: "copy", linkageName: "copy", scope: !122, file: !122, line: 395, scopeLine: 395, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!266 = !DILocation(line: 359, column: 2, scope: !230, inlinedAt: !231)
!267 = !DILocation(line: 392, column: 11, scope: !264, inlinedAt: !266)
!268 = !DILocation(line: 392, column: 26, scope: !264, inlinedAt: !266)
!269 = !DILocation(line: 359, column: 2, scope: !264, inlinedAt: !266)
!270 = !DILocation(line: 393, column: 11, scope: !264, inlinedAt: !266)
!271 = !DILocation(line: 393, column: 23, scope: !264, inlinedAt: !266)
!272 = !DILocation(line: 393, column: 29, scope: !264, inlinedAt: !266)
!273 = !DILocation(line: 393, column: 36, scope: !264, inlinedAt: !266)
!274 = !DILocation(line: 393, column: 43, scope: !264, inlinedAt: !266)
!275 = !DILocation(line: 393, column: 49, scope: !264, inlinedAt: !266)
!276 = !DILocation(line: 393, column: 56, scope: !264, inlinedAt: !266)
!277 = !DILocation(line: 397, column: 11, scope: !265, inlinedAt: !266)
!278 = !DILocation(line: 397, column: 16, scope: !265, inlinedAt: !266)
!279 = !DILocation(line: 397, column: 21, scope: !265, inlinedAt: !266)
!280 = !DILocation(line: 397, column: 26, scope: !265, inlinedAt: !266)
!281 = !DILocation(line: 361, column: 9, scope: !230, inlinedAt: !231)
!282 = !DILocation(line: 87, column: 2, scope: !198)
!283 = !DILocation(line: 87, column: 22, scope: !198)
!284 = !DILocation(line: 87, column: 47, scope: !198)
!285 = !DILocation(line: 47, column: 10, scope: !286, inlinedAt: !288)
!286 = distinct !DISubprogram(name: "greater", linkageName: "greater", scope: !287, file: !287, line: 39, scopeLine: 39, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!287 = !DIFile(filename: "builtin_comparison.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!288 = !DILocation(line: 116, column: 10, scope: !289, inlinedAt: !290)
!289 = distinct !DISubprogram(name: "max", linkageName: "max", scope: !287, file: !287, line: 113, scopeLine: 113, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!290 = !DILocation(line: 87, column: 43, scope: !198)
!291 = !DILocation(line: 47, column: 14, scope: !286, inlinedAt: !288)
!292 = !DILocation(line: 116, column: 34, scope: !289, inlinedAt: !290)
!293 = !DILocation(line: 116, column: 38, scope: !289, inlinedAt: !290)
!294 = !DILocation(line: 44, column: 12, scope: !198)
!295 = !DILocation(line: 88, column: 17, scope: !296)
!296 = distinct !DILexicalBlock(scope: !198, file: !2, line: 88, column: 2)
!297 = !DILocalVariable(name: ".temp", scope: !296, file: !2, line: 88, type: !10, align: 64)
!298 = !DILocalVariable(name: "arg", scope: !299, file: !2, line: 88, type: !220, align: 64)
!299 = distinct !DILexicalBlock(scope: !296, file: !2, line: 89, column: 2)
!300 = !DILocation(line: 88, column: 11, scope: !299)
!301 = !DILocation(line: 88, column: 17, scope: !299)
!302 = !DILocation(line: 90, column: 33, scope: !303)
!303 = distinct !DILexicalBlock(scope: !299, file: !2, line: 89, column: 2)
!304 = !DILocation(line: 90, column: 3, scope: !303)
!305 = !DILocation(line: 92, column: 9, scope: !198)
!306 = distinct !DISubprogram(name: "decode", linkageName: "std.encoding.pem.decode", scope: !2, file: !2, line: 146, type: !307, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !30, retainedNodes: !73)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !38, !3}
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pem[]", size: 128, align: 64, elements: !310, identifier: "Pem[]")
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !309, baseType: !72, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !309, baseType: !10, size: 64, align: 64, offset: 64)
!313 = !DILocalVariable(name: "allocator", arg: 1, scope: !306, file: !2, line: 146, type: !38)
!314 = !DILocation(line: 146, column: 28, scope: !306)
!315 = !DILocalVariable(name: "input", arg: 2, scope: !306, file: !2, line: 146, type: !3)
!316 = !DILocation(line: 146, column: 46, scope: !306)
!317 = !DILocalVariable(name: "state", scope: !318, file: !2, line: 679, type: !319, align: 64)
!318 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !122, file: !122, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 496, baseType: !320, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64, dwarfAddressSpace: 0)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !322, identifier: "std.core.mem.allocator.TempAllocator")
!322 = !{!323, !324, !336, !337, !339, !340, !341, !342, !343, !344, !345}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !321, file: !2, line: 33, baseType: !38, size: 128, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !321, file: !2, line: 34, baseType: !325, size: 64, align: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64, dwarfAddressSpace: 0)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !327, identifier: "std.core.mem.allocator.TempAllocatorPage")
!327 = !{!328, !329, !330, !331, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !326, file: !2, line: 56, baseType: !325, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !326, file: !2, line: 57, baseType: !41, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !326, file: !2, line: 58, baseType: !10, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !326, file: !2, line: 59, baseType: !10, size: 64, align: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !326, file: !2, line: 60, baseType: !333, align: 8, offset: 256)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, align: 8, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 0, lowerBound: 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !321, file: !2, line: 35, baseType: !320, size: 64, align: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !321, file: !2, line: 36, baseType: !338, size: 8, align: 8, offset: 256)
!338 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !321, file: !2, line: 37, baseType: !10, size: 64, align: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !321, file: !2, line: 38, baseType: !10, size: 64, align: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !321, file: !2, line: 39, baseType: !10, size: 64, align: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !321, file: !2, line: 40, baseType: !10, size: 64, align: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !321, file: !2, line: 41, baseType: !10, size: 64, align: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !321, file: !2, line: 42, baseType: !10, size: 64, align: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !2, line: 43, baseType: !333, align: 8, offset: 704)
!346 = !DILocation(line: 679, column: 12, scope: !318, inlinedAt: !347)
!347 = !DILocation(line: 146, column: 56, scope: !306)
!348 = !DILocation(line: 679, column: 41, scope: !318, inlinedAt: !347)
!349 = !DILocation(line: 679, column: 20, scope: !318, inlinedAt: !347)
!350 = !DILocalVariable(name: "pem_list", scope: !351, file: !2, line: 148, type: !352, align: 64)
!351 = distinct !DILexicalBlock(scope: !306, file: !2, line: 147, column: 1)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{Pem}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !353, identifier: "std.collections.list.List$std.encoding.pem.Pem$")
!353 = !{!354, !355, !356, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !352, file: !2, line: 20, baseType: !10, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !352, file: !2, line: 21, baseType: !10, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !352, file: !2, line: 22, baseType: !38, size: 128, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !352, file: !2, line: 23, baseType: !72, size: 64, align: 64, offset: 256)
!358 = !DILocation(line: 148, column: 12, scope: !351)
!359 = !DILocation(line: 149, column: 2, scope: !351)
!360 = !DILocalVariable(name: "lines", scope: !351, file: !2, line: 151, type: !361, align: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !362, identifier: "String[]")
!362 = !{!363, !365}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !361, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !361, baseType: !10, size: 64, align: 64, offset: 64)
!366 = !DILocation(line: 151, column: 11, scope: !351)
!367 = !DILocation(line: 151, column: 42, scope: !351)
!368 = !DILocation(line: 151, column: 19, scope: !351)
!369 = !DILocation(line: 424, column: 79, scope: !370, inlinedAt: !368)
!370 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !371, file: !371, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!371 = !DIFile(filename: "string.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!372 = !DILocation(line: 152, column: 19, scope: !373)
!373 = distinct !DILexicalBlock(scope: !351, file: !2, line: 152, column: 2)
!374 = !DILocalVariable(name: ".temp", scope: !373, file: !2, line: 152, type: !10, align: 64)
!375 = !DILocalVariable(name: "line", scope: !376, file: !2, line: 152, type: !364, align: 64)
!376 = distinct !DILexicalBlock(scope: !373, file: !2, line: 152, column: 26)
!377 = !DILocation(line: 152, column: 12, scope: !376)
!378 = !DILocation(line: 152, column: 19, scope: !376)
!379 = !DILocation(line: 152, column: 36, scope: !376)
!380 = !DILocation(line: 301, column: 52, scope: !381, inlinedAt: !382)
!381 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !371, file: !371, line: 301, scopeLine: 301, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!382 = !DILocation(line: 152, column: 34, scope: !376)
!383 = !DILocation(line: 152, column: 27, scope: !376)
!384 = !DILocation(line: 153, column: 2, scope: !351)
!385 = !DILocation(line: 153, column: 9, scope: !386)
!386 = distinct !DILexicalBlock(scope: !351, file: !2, line: 153, column: 2)
!387 = !DILocation(line: 155, column: 17, scope: !388)
!388 = distinct !DILexicalBlock(scope: !386, file: !2, line: 154, column: 2)
!389 = !DILocation(line: 682, column: 23, scope: !390, inlinedAt: !347)
!390 = distinct !DILexicalBlock(scope: !318, file: !122, line: 681, column: 2)
!391 = !DILocation(line: 682, column: 3, scope: !390, inlinedAt: !347)
!392 = !DILocation(line: 155, column: 3, scope: !388)
!393 = !DILocation(line: 156, column: 3, scope: !388)
!394 = !DILocation(line: 156, column: 10, scope: !395)
!395 = distinct !DILexicalBlock(scope: !388, file: !2, line: 156, column: 3)
!396 = !DILocation(line: 156, column: 27, scope: !395)
!397 = !DILocation(line: 156, column: 33, scope: !395)
!398 = !DILocation(line: 254, column: 46, scope: !399, inlinedAt: !396)
!399 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !371, file: !371, line: 254, scopeLine: 254, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!400 = !DILocation(line: 156, column: 61, scope: !395)
!401 = !DILocation(line: 156, column: 67, scope: !395)
!402 = !DILocation(line: 169, column: 28, scope: !403, inlinedAt: !406)
!403 = distinct !DILexicalBlock(scope: !405, file: !404, line: 170, column: 1)
!404 = !DIFile(filename: "list.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!405 = distinct !DISubprogram(name: "to_array", linkageName: "to_array", scope: !404, file: !404, line: 169, scopeLine: 169, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!406 = !DILocation(line: 158, column: 9, scope: !351)
!407 = !DILocation(line: 16, column: 7, scope: !408, inlinedAt: !410)
!408 = distinct !DISubprogram(name: "list_to_array", linkageName: "list_to_array", scope: !409, file: !409, line: 14, scopeLine: 14, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!409 = !DIFile(filename: "list_common.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/collections")
!410 = !DILocation(line: 171, column: 9, scope: !405, inlinedAt: !406)
!411 = !DILocation(line: 16, column: 25, scope: !408, inlinedAt: !410)
!412 = !DILocalVariable(name: "result", scope: !408, file: !2, line: 17, type: !309, align: 64)
!413 = !DILocation(line: 17, column: 10, scope: !408, inlinedAt: !410)
!414 = !DILocation(line: 17, column: 60, scope: !408, inlinedAt: !410)
!415 = !DILocation(line: 304, column: 55, scope: !416, inlinedAt: !417)
!416 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !156, file: !156, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!417 = !DILocation(line: 287, column: 9, scope: !418, inlinedAt: !419)
!418 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !156, file: !156, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!419 = !DILocation(line: 17, column: 19, scope: !408, inlinedAt: !410)
!420 = !DILocation(line: 304, column: 40, scope: !416, inlinedAt: !417)
!421 = !DILocation(line: 80, column: 6, scope: !422, inlinedAt: !423)
!422 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !156, file: !156, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!423 = !DILocation(line: 304, column: 18, scope: !416, inlinedAt: !417)
!424 = !DILocation(line: 80, column: 20, scope: !422, inlinedAt: !423)
!425 = !DILocation(line: 86, column: 28, scope: !422, inlinedAt: !423)
!426 = !DILocation(line: 38, column: 12, scope: !422, inlinedAt: !423)
!427 = !DILocation(line: 1039, column: 9, scope: !428, inlinedAt: !429)
!428 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !251, file: !251, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!429 = !DILocation(line: 38, column: 26, scope: !422, inlinedAt: !423)
!430 = !DILocation(line: 1039, column: 20, scope: !428, inlinedAt: !429)
!431 = !DILocation(line: 1039, column: 25, scope: !428, inlinedAt: !429)
!432 = !DILocation(line: 1039, column: 19, scope: !428, inlinedAt: !429)
!433 = !DILocation(line: 86, column: 10, scope: !422, inlinedAt: !423)
!434 = !DILocation(line: 304, column: 67, scope: !416, inlinedAt: !417)
!435 = !DILocation(line: 304, column: 9, scope: !416, inlinedAt: !417)
!436 = !DILocation(line: 18, column: 15, scope: !408, inlinedAt: !410)
!437 = !DILocation(line: 18, column: 29, scope: !408, inlinedAt: !410)
!438 = !DILocation(line: 18, column: 2, scope: !408, inlinedAt: !410)
!439 = !DILocation(line: 18, column: 9, scope: !408, inlinedAt: !410)
!440 = !DILocation(line: 19, column: 9, scope: !408, inlinedAt: !410)
!441 = !DILocation(line: 682, column: 23, scope: !442, inlinedAt: !347)
!442 = distinct !DILexicalBlock(scope: !318, file: !122, line: 681, column: 2)
!443 = !DILocation(line: 682, column: 3, scope: !442, inlinedAt: !347)
!444 = distinct !DISubprogram(name: "_decode_single", linkageName: "std.encoding.pem._decode_single.13022", scope: !2, file: !2, line: 168, type: !445, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!445 = !DISubroutineType(types: !446)
!446 = !{!35, !38, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64, dwarfAddressSpace: 0)
!448 = !DILocalVariable(name: "allocator", arg: 1, scope: !444, file: !2, line: 168, type: !38)
!449 = !DILocation(line: 168, column: 34, scope: !444)
!450 = !DILocalVariable(name: "lines_io", arg: 2, scope: !444, file: !2, line: 168, type: !447)
!451 = !DILocation(line: 168, column: 55, scope: !444)
!452 = !DILocalVariable(name: "lines", scope: !444, file: !2, line: 170, type: !361, align: 64)
!453 = !DILocation(line: 170, column: 11, scope: !444)
!454 = !DILocation(line: 170, column: 20, scope: !444)
!455 = !DILocalVariable(name: "result", scope: !444, file: !2, line: 171, type: !35, align: 64)
!456 = !DILocation(line: 171, column: 6, scope: !444)
!457 = !DILocation(line: 171, column: 30, scope: !444)
!458 = !DILocation(line: 172, column: 2, scope: !444)
!459 = !DILocation(line: 172, column: 22, scope: !444)
!460 = !DILocation(line: 44, column: 12, scope: !444)
!461 = !DILocation(line: 176, column: 2, scope: !444)
!462 = !DILocation(line: 176, column: 9, scope: !463)
!463 = distinct !DILexicalBlock(scope: !444, file: !2, line: 176, column: 2)
!464 = !DILocation(line: 176, column: 15, scope: !463)
!465 = !DILocation(line: 254, column: 46, scope: !466, inlinedAt: !462)
!466 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !371, file: !371, line: 254, scopeLine: 254, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!467 = !DILocation(line: 176, column: 43, scope: !463)
!468 = !DILocation(line: 176, column: 49, scope: !463)
!469 = !DILocation(line: 178, column: 6, scope: !444)
!470 = !DILocation(line: 173, column: 14, scope: !471)
!471 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!472 = !DILocalVariable(name: "pre_eb", scope: !444, file: !2, line: 181, type: !3, align: 64)
!473 = !DILocation(line: 181, column: 9, scope: !444)
!474 = !DILocation(line: 181, column: 18, scope: !444)
!475 = !DILocation(line: 181, column: 24, scope: !444)
!476 = !DILocation(line: 182, column: 6, scope: !444)
!477 = !DILocation(line: 182, column: 39, scope: !444)
!478 = !DILocation(line: 182, column: 47, scope: !444)
!479 = !DILocation(line: 173, column: 14, scope: !480)
!480 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!481 = !DILocalVariable(name: "tag", scope: !444, file: !2, line: 183, type: !3, align: 64)
!482 = !DILocation(line: 183, column: 9, scope: !444)
!483 = !DILocation(line: 183, column: 15, scope: !444)
!484 = !DILocation(line: 183, column: 22, scope: !444)
!485 = !DILocation(line: 183, column: 42, scope: !444)
!486 = !DILocation(line: 184, column: 6, scope: !444)
!487 = !DILocation(line: 254, column: 46, scope: !488, inlinedAt: !489)
!488 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !371, file: !371, line: 254, scopeLine: 254, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!489 = !DILocation(line: 184, column: 19, scope: !444)
!490 = !DILocation(line: 184, column: 18, scope: !444)
!491 = !DILocation(line: 173, column: 14, scope: !492)
!492 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!493 = !DILocation(line: 185, column: 15, scope: !494)
!494 = distinct !DILexicalBlock(scope: !444, file: !2, line: 185, column: 2)
!495 = !DILocalVariable(name: ".temp", scope: !494, file: !2, line: 185, type: !10, align: 64)
!496 = !DILocalVariable(name: "c", scope: !497, file: !2, line: 185, type: !8, align: 8)
!497 = distinct !DILexicalBlock(scope: !494, file: !2, line: 185, column: 20)
!498 = !DILocation(line: 185, column: 11, scope: !497)
!499 = !DILocation(line: 185, column: 15, scope: !497)
!500 = !DILocation(line: 149, column: 53, scope: !501, inlinedAt: !503)
!501 = distinct !DISubprogram(name: "contains", linkageName: "contains", scope: !502, file: !502, line: 149, scopeLine: 149, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!502 = !DIFile(filename: "ascii.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!503 = !DILocation(line: 185, column: 25, scope: !497)
!504 = !DILocation(line: 149, column: 67, scope: !501, inlinedAt: !503)
!505 = !DILocation(line: 149, column: 96, scope: !501, inlinedAt: !503)
!506 = !DILocation(line: 149, column: 73, scope: !501, inlinedAt: !503)
!507 = !DILocation(line: 149, column: 64, scope: !501, inlinedAt: !503)
!508 = !DILocation(line: 149, column: 50, scope: !501, inlinedAt: !503)
!509 = !DILocation(line: 173, column: 14, scope: !510)
!510 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!511 = !DILocation(line: 186, column: 24, scope: !444)
!512 = !DILocation(line: 186, column: 15, scope: !444)
!513 = !DILocation(line: 186, column: 2, scope: !444)
!514 = !DILocalVariable(name: "post_eb", scope: !444, file: !2, line: 190, type: !3, align: 64)
!515 = !DILocation(line: 190, column: 9, scope: !444)
!516 = !DILocalVariable(name: "endl", scope: !444, file: !2, line: 191, type: !10, align: 64)
!517 = !DILocation(line: 191, column: 6, scope: !444)
!518 = !DILocation(line: 192, column: 25, scope: !519)
!519 = distinct !DILexicalBlock(scope: !444, file: !2, line: 192, column: 2)
!520 = !DILocation(line: 192, column: 28, scope: !519)
!521 = !DILocation(line: 192, column: 35, scope: !519)
!522 = !DILocation(line: 194, column: 7, scope: !523)
!523 = distinct !DILexicalBlock(scope: !519, file: !2, line: 193, column: 2)
!524 = !DILocation(line: 194, column: 13, scope: !523)
!525 = !DILocation(line: 194, column: 47, scope: !523)
!526 = !DILocation(line: 194, column: 53, scope: !523)
!527 = !DILocation(line: 196, column: 14, scope: !528)
!528 = distinct !DILexicalBlock(scope: !523, file: !2, line: 195, column: 3)
!529 = !DILocation(line: 196, column: 20, scope: !528)
!530 = !DILocation(line: 197, column: 4, scope: !528)
!531 = !DILocation(line: 192, column: 46, scope: !519)
!532 = !DILocation(line: 200, column: 6, scope: !444)
!533 = !DILocation(line: 173, column: 14, scope: !534)
!534 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!535 = !DILocation(line: 201, column: 6, scope: !444)
!536 = !DILocation(line: 201, column: 40, scope: !444)
!537 = !DILocation(line: 201, column: 49, scope: !444)
!538 = !DILocation(line: 173, column: 14, scope: !539)
!539 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!540 = !DILocalVariable(name: "post_tag", scope: !444, file: !2, line: 202, type: !3, align: 64)
!541 = !DILocation(line: 202, column: 9, scope: !444)
!542 = !DILocation(line: 202, column: 20, scope: !444)
!543 = !DILocation(line: 202, column: 28, scope: !444)
!544 = !DILocation(line: 202, column: 49, scope: !444)
!545 = !DILocation(line: 203, column: 6, scope: !444)
!546 = !DILocation(line: 203, column: 22, scope: !444)
!547 = !DILocation(line: 203, column: 33, scope: !444)
!548 = !DILocation(line: 203, column: 45, scope: !444)
!549 = !DILocation(line: 173, column: 14, scope: !550)
!550 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!551 = !DILocation(line: 206, column: 14, scope: !444)
!552 = !DILocation(line: 206, column: 20, scope: !444)
!553 = !DILocation(line: 206, column: 3, scope: !444)
!554 = !DILocation(line: 207, column: 10, scope: !444)
!555 = !DILocation(line: 207, column: 16, scope: !444)
!556 = !DILocation(line: 207, column: 18, scope: !444)
!557 = !DILocation(line: 210, column: 2, scope: !444)
!558 = !DILocation(line: 210, column: 9, scope: !559)
!559 = distinct !DILexicalBlock(scope: !444, file: !2, line: 210, column: 2)
!560 = !DILocation(line: 210, column: 15, scope: !559)
!561 = !DILocation(line: 210, column: 27, scope: !559)
!562 = !DILocation(line: 212, column: 32, scope: !563)
!563 = distinct !DILexicalBlock(scope: !559, file: !2, line: 211, column: 2)
!564 = !DILocation(line: 212, column: 38, scope: !563)
!565 = !DILocation(line: 212, column: 41, scope: !563)
!566 = !DILocation(line: 149, column: 53, scope: !567, inlinedAt: !568)
!567 = distinct !DISubprogram(name: "contains", linkageName: "contains", scope: !502, file: !502, line: 149, scopeLine: 149, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!568 = !DILocation(line: 212, column: 8, scope: !563)
!569 = !DILocation(line: 149, column: 67, scope: !567, inlinedAt: !568)
!570 = !DILocation(line: 149, column: 96, scope: !567, inlinedAt: !568)
!571 = !DILocation(line: 149, column: 73, scope: !567, inlinedAt: !568)
!572 = !DILocation(line: 149, column: 64, scope: !567, inlinedAt: !568)
!573 = !DILocation(line: 149, column: 50, scope: !567, inlinedAt: !568)
!574 = !DILocation(line: 173, column: 14, scope: !575)
!575 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!576 = !DILocalVariable(name: "marker", scope: !563, file: !2, line: 213, type: !361, align: 64)
!577 = !DILocation(line: 213, column: 12, scope: !563)
!578 = !DILocation(line: 213, column: 21, scope: !563)
!579 = !DILocalVariable(name: "span", scope: !563, file: !2, line: 214, type: !10, align: 64)
!580 = !DILocation(line: 214, column: 7, scope: !563)
!581 = !DILocation(line: 214, column: 14, scope: !563)
!582 = !DILocation(line: 217, column: 16, scope: !583)
!583 = distinct !DILexicalBlock(scope: !563, file: !2, line: 217, column: 3)
!584 = !DILocation(line: 217, column: 22, scope: !583)
!585 = !DILocation(line: 217, column: 28, scope: !583)
!586 = !DILocation(line: 217, column: 34, scope: !583)
!587 = !DILocation(line: 217, column: 79, scope: !583)
!588 = !DILocation(line: 217, column: 85, scope: !583)
!589 = !DILocation(line: 217, column: 88, scope: !583)
!590 = !DILocation(line: 149, column: 53, scope: !591, inlinedAt: !592)
!591 = distinct !DISubprogram(name: "contains", linkageName: "contains", scope: !502, file: !502, line: 149, scopeLine: 149, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!592 = !DILocation(line: 217, column: 48, scope: !583)
!593 = !DILocation(line: 149, column: 67, scope: !591, inlinedAt: !592)
!594 = !DILocation(line: 149, column: 96, scope: !591, inlinedAt: !592)
!595 = !DILocation(line: 149, column: 73, scope: !591, inlinedAt: !592)
!596 = !DILocation(line: 149, column: 64, scope: !591, inlinedAt: !592)
!597 = !DILocation(line: 149, column: 50, scope: !591, inlinedAt: !592)
!598 = !DILocation(line: 217, column: 101, scope: !583)
!599 = !DILocation(line: 217, column: 107, scope: !583)
!600 = !DILocation(line: 217, column: 113, scope: !583)
!601 = !DILocation(line: 218, column: 20, scope: !602)
!602 = distinct !DILexicalBlock(scope: !563, file: !2, line: 218, column: 3)
!603 = !DILocation(line: 218, column: 27, scope: !602)
!604 = !DILocation(line: 218, column: 28, scope: !602)
!605 = !DILocalVariable(name: ".temp", scope: !602, file: !2, line: 218, type: !10, align: 64)
!606 = !DILocalVariable(name: "line", scope: !607, file: !2, line: 218, type: !364, align: 64)
!607 = distinct !DILexicalBlock(scope: !602, file: !2, line: 218, column: 35)
!608 = !DILocation(line: 218, column: 13, scope: !607)
!609 = !DILocation(line: 218, column: 20, scope: !607)
!610 = !DILocation(line: 218, column: 45, scope: !607)
!611 = !DILocation(line: 254, column: 46, scope: !612, inlinedAt: !613)
!612 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !371, file: !371, line: 254, scopeLine: 254, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!613 = !DILocation(line: 218, column: 43, scope: !607)
!614 = !DILocation(line: 218, column: 36, scope: !607)
!615 = !DILocalVariable(name: "full_header", scope: !563, file: !2, line: 220, type: !3, align: 64)
!616 = !DILocation(line: 220, column: 10, scope: !563)
!617 = !DILocation(line: 220, column: 38, scope: !563)
!618 = !DILocation(line: 220, column: 45, scope: !563)
!619 = !DILocation(line: 220, column: 46, scope: !563)
!620 = !DILocation(line: 198, column: 55, scope: !621, inlinedAt: !622)
!621 = distinct !DISubprogram(name: "tjoin", linkageName: "tjoin", scope: !371, file: !371, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!622 = !DILocation(line: 220, column: 24, scope: !563)
!623 = !DILocation(line: 198, column: 64, scope: !621, inlinedAt: !622)
!624 = !DILocation(line: 198, column: 50, scope: !621, inlinedAt: !622)
!625 = !DILocation(line: 221, column: 29, scope: !563)
!626 = !DILocation(line: 221, column: 8, scope: !563)
!627 = !DILocation(line: 173, column: 14, scope: !628)
!628 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!629 = !DILocalVariable(name: "kv", scope: !563, file: !2, line: 225, type: !361, align: 64)
!630 = !DILocation(line: 225, column: 12, scope: !563)
!631 = !DILocation(line: 424, column: 79, scope: !632, inlinedAt: !633)
!632 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !371, file: !371, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!633 = !DILocation(line: 225, column: 17, scope: !563)
!634 = !DILocation(line: 226, column: 8, scope: !563)
!635 = !DILocation(line: 226, column: 11, scope: !563)
!636 = !DILocation(line: 173, column: 14, scope: !637)
!637 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!638 = !DILocation(line: 227, column: 8, scope: !563)
!639 = !DILocation(line: 227, column: 11, scope: !563)
!640 = !DILocation(line: 173, column: 14, scope: !641)
!641 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!642 = !DILocation(line: 228, column: 16, scope: !643)
!643 = distinct !DILexicalBlock(scope: !563, file: !2, line: 228, column: 3)
!644 = !DILocation(line: 228, column: 19, scope: !643)
!645 = !DILocalVariable(name: ".temp", scope: !643, file: !2, line: 228, type: !10, align: 64)
!646 = !DILocalVariable(name: "c", scope: !647, file: !2, line: 228, type: !8, align: 8)
!647 = distinct !DILexicalBlock(scope: !643, file: !2, line: 228, column: 23)
!648 = !DILocation(line: 228, column: 12, scope: !647)
!649 = !DILocation(line: 228, column: 16, scope: !647)
!650 = !DILocation(line: 149, column: 53, scope: !651, inlinedAt: !652)
!651 = distinct !DISubprogram(name: "contains", linkageName: "contains", scope: !502, file: !502, line: 149, scopeLine: 149, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!652 = !DILocation(line: 228, column: 28, scope: !647)
!653 = !DILocation(line: 149, column: 67, scope: !651, inlinedAt: !652)
!654 = !DILocation(line: 149, column: 96, scope: !651, inlinedAt: !652)
!655 = !DILocation(line: 149, column: 73, scope: !651, inlinedAt: !652)
!656 = !DILocation(line: 149, column: 64, scope: !651, inlinedAt: !652)
!657 = !DILocation(line: 149, column: 50, scope: !651, inlinedAt: !652)
!658 = !DILocation(line: 173, column: 14, scope: !659)
!659 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!660 = !DILocation(line: 230, column: 21, scope: !563)
!661 = !DILocation(line: 230, column: 24, scope: !563)
!662 = !DILocation(line: 230, column: 28, scope: !563)
!663 = !DILocation(line: 230, column: 31, scope: !563)
!664 = !DILocation(line: 230, column: 3, scope: !563)
!665 = !DILocation(line: 234, column: 6, scope: !444)
!666 = !DILocation(line: 236, column: 7, scope: !667)
!667 = distinct !DILexicalBlock(scope: !444, file: !2, line: 235, column: 2)
!668 = !DILocation(line: 236, column: 13, scope: !667)
!669 = !DILocation(line: 254, column: 46, scope: !670, inlinedAt: !666)
!670 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !371, file: !371, line: 254, scopeLine: 254, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!671 = !DILocation(line: 173, column: 14, scope: !672)
!672 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!673 = !DILocation(line: 237, column: 11, scope: !667)
!674 = !DILocation(line: 237, column: 17, scope: !667)
!675 = !DILocation(line: 241, column: 6, scope: !444)
!676 = !DILocation(line: 173, column: 14, scope: !677)
!677 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!678 = !DILocalVariable(name: "to_decode", scope: !444, file: !2, line: 246, type: !3, align: 64)
!679 = !DILocation(line: 246, column: 9, scope: !444)
!680 = !DILocation(line: 198, column: 55, scope: !681, inlinedAt: !682)
!681 = distinct !DISubprogram(name: "tjoin", linkageName: "tjoin", scope: !371, file: !371, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!682 = !DILocation(line: 246, column: 21, scope: !444)
!683 = !DILocation(line: 198, column: 64, scope: !681, inlinedAt: !682)
!684 = !DILocation(line: 198, column: 50, scope: !681, inlinedAt: !682)
!685 = !DILocation(line: 247, column: 6, scope: !444)
!686 = !DILocation(line: 173, column: 14, scope: !687)
!687 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!688 = !DILocation(line: 248, column: 17, scope: !444)
!689 = !DILocation(line: 248, column: 57, scope: !444)
!690 = !DILocation(line: 173, column: 14, scope: !691)
!691 = distinct !DILexicalBlock(scope: !444, file: !2, line: 173, column: 14)
!692 = !DILocation(line: 248, column: 2, scope: !444)
!693 = !DILocation(line: 250, column: 9, scope: !444)
!694 = distinct !DISubprogram(name: "encode_pem", linkageName: "std.encoding.pem.encode_pem", scope: !2, file: !2, line: 260, type: !695, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !30, retainedNodes: !73)
!695 = !DISubroutineType(types: !696)
!696 = !{!4, !35, !38, !338}
!697 = !DILocalVariable(name: "pem", arg: 1, scope: !694, file: !2, line: 260, type: !35)
!698 = !DILocation(line: 260, column: 27, scope: !694)
!699 = !DILocalVariable(name: "allocator", arg: 2, scope: !694, file: !2, line: 260, type: !38)
!700 = !DILocation(line: 260, column: 42, scope: !694)
!701 = !DILocalVariable(name: "use_crlf", arg: 3, scope: !694, file: !2, line: 260, type: !338)
!702 = !DILocation(line: 260, column: 58, scope: !694)
!703 = !DILocation(line: 262, column: 7, scope: !694)
!704 = !DILocation(line: 262, column: 28, scope: !694)
!705 = !DILocation(line: 263, column: 7, scope: !694)
!706 = !DILocation(line: 263, column: 27, scope: !694)
!707 = !DILocalVariable(name: "out", scope: !694, file: !2, line: 265, type: !708, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !709, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64, dwarfAddressSpace: 0)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 8)
!711 = !DILocation(line: 265, column: 10, scope: !694)
!712 = !DILocation(line: 36, column: 12, scope: !694)
!713 = !DILocation(line: 36, column: 11, scope: !694)
!714 = !DILocation(line: 266, column: 2, scope: !694)
!715 = !DILocalVariable(name: "line_ending", scope: !694, file: !2, line: 267, type: !3, align: 64)
!716 = !DILocation(line: 267, column: 9, scope: !694)
!717 = !DILocation(line: 267, column: 23, scope: !694)
!718 = !DILocation(line: 267, column: 43, scope: !694)
!719 = !DILocalVariable(name: "state", scope: !720, file: !2, line: 679, type: !319, align: 64)
!720 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !122, file: !122, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!721 = !DILocation(line: 679, column: 12, scope: !720, inlinedAt: !722)
!722 = !DILocation(line: 268, column: 2, scope: !694)
!723 = !DILocation(line: 679, column: 41, scope: !720, inlinedAt: !722)
!724 = !DILocation(line: 679, column: 20, scope: !720, inlinedAt: !722)
!725 = !DILocation(line: 270, column: 65, scope: !726)
!726 = distinct !DILexicalBlock(scope: !694, file: !2, line: 269, column: 2)
!727 = !DILocation(line: 270, column: 74, scope: !726)
!728 = !DILocation(line: 270, column: 3, scope: !726)
!729 = !DILocation(line: 271, column: 28, scope: !730)
!730 = distinct !DILexicalBlock(scope: !726, file: !2, line: 271, column: 3)
!731 = !DILocalVariable(name: ".temp", scope: !730, file: !2, line: 271, type: !10, align: 64)
!732 = !DILocalVariable(name: "key", scope: !733, file: !2, line: 271, type: !3, align: 64)
!733 = distinct !DILexicalBlock(scope: !730, file: !2, line: 272, column: 3)
!734 = !DILocation(line: 271, column: 22, scope: !733)
!735 = !DILocation(line: 271, column: 28, scope: !733)
!736 = !DILocation(line: 273, column: 8, scope: !737)
!737 = distinct !DILexicalBlock(scope: !733, file: !2, line: 272, column: 3)
!738 = !DILocation(line: 682, column: 23, scope: !739, inlinedAt: !722)
!739 = distinct !DILexicalBlock(scope: !720, file: !122, line: 681, column: 2)
!740 = !DILocation(line: 682, column: 3, scope: !739, inlinedAt: !722)
!741 = !DILocalVariable(name: "value", scope: !737, file: !2, line: 274, type: !3, align: 64)
!742 = !DILocation(line: 274, column: 11, scope: !737)
!743 = !DILocation(line: 274, column: 19, scope: !737)
!744 = !DILocation(line: 275, column: 8, scope: !737)
!745 = !DILocation(line: 682, column: 23, scope: !746, inlinedAt: !722)
!746 = distinct !DILexicalBlock(scope: !720, file: !122, line: 681, column: 2)
!747 = !DILocation(line: 682, column: 3, scope: !746, inlinedAt: !722)
!748 = !DILocalVariable(name: "first_line_length", scope: !737, file: !2, line: 276, type: !10, align: 64)
!749 = !DILocation(line: 276, column: 8, scope: !737)
!750 = !DILocation(line: 276, column: 37, scope: !737)
!751 = !DILocation(line: 276, column: 28, scope: !737)
!752 = !DILocation(line: 277, column: 8, scope: !737)
!753 = !DILocation(line: 277, column: 21, scope: !737)
!754 = !DILocation(line: 279, column: 29, scope: !755)
!755 = distinct !DILexicalBlock(scope: !737, file: !2, line: 278, column: 4)
!756 = !DILocation(line: 279, column: 34, scope: !755)
!757 = !DILocation(line: 279, column: 41, scope: !755)
!758 = !DILocation(line: 279, column: 5, scope: !755)
!759 = !DILocation(line: 280, column: 5, scope: !755)
!760 = !DILocation(line: 282, column: 28, scope: !737)
!761 = !DILocation(line: 282, column: 33, scope: !737)
!762 = !DILocation(line: 282, column: 39, scope: !737)
!763 = !DILocation(line: 282, column: 40, scope: !737)
!764 = !DILocation(line: 282, column: 67, scope: !737)
!765 = !DILocation(line: 282, column: 4, scope: !737)
!766 = !DILocation(line: 283, column: 12, scope: !737)
!767 = !DILocation(line: 283, column: 18, scope: !737)
!768 = !DILocation(line: 284, column: 4, scope: !737)
!769 = !DILocation(line: 284, column: 11, scope: !770)
!770 = distinct !DILexicalBlock(scope: !737, file: !2, line: 284, column: 4)
!771 = !DILocation(line: 286, column: 27, scope: !772)
!772 = distinct !DILexicalBlock(scope: !770, file: !2, line: 285, column: 4)
!773 = !DILocation(line: 286, column: 45, scope: !772)
!774 = !DILocation(line: 286, column: 58, scope: !772)
!775 = !DILocation(line: 286, column: 64, scope: !772)
!776 = !DILocation(line: 286, column: 26, scope: !772)
!777 = !DILocation(line: 286, column: 77, scope: !772)
!778 = !DILocation(line: 286, column: 5, scope: !772)
!779 = !DILocation(line: 287, column: 13, scope: !772)
!780 = !DILocation(line: 287, column: 31, scope: !772)
!781 = !DILocation(line: 287, column: 37, scope: !772)
!782 = !DILocation(line: 287, column: 45, scope: !772)
!783 = !DILocation(line: 290, column: 7, scope: !726)
!784 = !DILocation(line: 417, column: 27, scope: !785, inlinedAt: !788)
!785 = distinct !DILexicalBlock(scope: !787, file: !786, line: 418, column: 1)
!786 = !DIFile(filename: "dstring.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!787 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !786, file: !786, line: 417, scopeLine: 417, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!788 = !DILocation(line: 290, column: 30, scope: !726)
!789 = !DILocation(line: 336, column: 34, scope: !790, inlinedAt: !792)
!790 = distinct !DILexicalBlock(scope: !791, file: !786, line: 337, column: 1)
!791 = distinct !DISubprogram(name: "append_string", linkageName: "append_string", scope: !786, file: !786, line: 336, scopeLine: 336, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!792 = !DILocation(line: 427, column: 4, scope: !787, inlinedAt: !788)
!793 = !DILocation(line: 341, column: 21, scope: !791, inlinedAt: !792)
!794 = !DILocation(line: 341, column: 3, scope: !791, inlinedAt: !792)
!795 = !DILocalVariable(name: "body", scope: !726, file: !2, line: 291, type: !3, align: 64)
!796 = !DILocation(line: 291, column: 10, scope: !726)
!797 = !DILocation(line: 291, column: 33, scope: !726)
!798 = !DILocation(line: 58, column: 87, scope: !799, inlinedAt: !801)
!799 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !800, file: !800, line: 58, scopeLine: 58, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!800 = !DIFile(filename: "base64.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/encoding")
!801 = !DILocation(line: 291, column: 17, scope: !726)
!802 = !DILocation(line: 292, column: 3, scope: !726)
!803 = !DILocation(line: 292, column: 10, scope: !804)
!804 = distinct !DILexicalBlock(scope: !726, file: !2, line: 292, column: 3)
!805 = !DILocation(line: 294, column: 24, scope: !806)
!806 = distinct !DILexicalBlock(scope: !804, file: !2, line: 293, column: 3)
!807 = !DILocation(line: 294, column: 41, scope: !806)
!808 = !DILocation(line: 294, column: 53, scope: !806)
!809 = !DILocation(line: 294, column: 58, scope: !806)
!810 = !DILocation(line: 294, column: 63, scope: !806)
!811 = !DILocation(line: 294, column: 4, scope: !806)
!812 = !DILocation(line: 295, column: 11, scope: !806)
!813 = !DILocation(line: 295, column: 28, scope: !806)
!814 = !DILocation(line: 295, column: 33, scope: !806)
!815 = !DILocation(line: 295, column: 41, scope: !806)
!816 = !DILocation(line: 297, column: 66, scope: !726)
!817 = !DILocation(line: 297, column: 75, scope: !726)
!818 = !DILocation(line: 297, column: 3, scope: !726)
!819 = !DILocation(line: 682, column: 23, scope: !820, inlinedAt: !722)
!820 = distinct !DILexicalBlock(scope: !720, file: !122, line: 681, column: 2)
!821 = !DILocation(line: 682, column: 3, scope: !820, inlinedAt: !722)
!822 = !DILocation(line: 300, column: 9, scope: !694)
!823 = !DILocation(line: 300, column: 22, scope: !694)
!824 = !DILocation(line: 300, column: 29, scope: !694)
!825 = !DILocation(line: 300, column: 59, scope: !694)
!826 = !DILocation(line: 300, column: 46, scope: !694)
!827 = distinct !DISubprogram(name: "encode", linkageName: "std.encoding.pem.encode", scope: !2, file: !2, line: 310, type: !828, scopeLine: 310, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !30, retainedNodes: !73)
!828 = !DISubroutineType(types: !829)
!829 = !{!4, !38, !4, !3, !201, !338}
!830 = !DILocalVariable(name: "allocator", arg: 1, scope: !827, file: !2, line: 310, type: !38)
!831 = !DILocation(line: 310, column: 29, scope: !827)
!832 = !DILocalVariable(name: "data", arg: 2, scope: !827, file: !2, line: 310, type: !4)
!833 = !DILocation(line: 310, column: 47, scope: !827)
!834 = !DILocalVariable(name: "tag", arg: 3, scope: !827, file: !2, line: 310, type: !3)
!835 = !DILocation(line: 310, column: 60, scope: !827)
!836 = !DILocalVariable(name: "headers", arg: 4, scope: !827, file: !2, line: 310, type: !216)
!837 = !DILocation(line: 310, column: 78, scope: !827)
!838 = !DILocalVariable(name: "use_crlf", arg: 5, scope: !827, file: !2, line: 310, type: !338)
!839 = !DILocation(line: 310, column: 92, scope: !827)
!840 = !DILocalVariable(name: "state", scope: !841, file: !2, line: 679, type: !319, align: 64)
!841 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !122, file: !122, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!842 = !DILocation(line: 679, column: 12, scope: !841, inlinedAt: !843)
!843 = !DILocation(line: 310, column: 113, scope: !827)
!844 = !DILocation(line: 679, column: 41, scope: !841, inlinedAt: !843)
!845 = !DILocation(line: 679, column: 20, scope: !841, inlinedAt: !843)
!846 = !DILocation(line: 312, column: 6, scope: !847)
!847 = distinct !DILexicalBlock(scope: !827, file: !2, line: 311, column: 1)
!848 = !DILocation(line: 682, column: 23, scope: !849, inlinedAt: !843)
!849 = distinct !DILexicalBlock(scope: !841, file: !122, line: 681, column: 2)
!850 = !DILocation(line: 682, column: 3, scope: !849, inlinedAt: !843)
!851 = !DILocation(line: 313, column: 27, scope: !847)
!852 = !DILocation(line: 313, column: 20, scope: !847)
!853 = !DILocation(line: 313, column: 9, scope: !847)
!854 = !DILocation(line: 682, column: 23, scope: !855, inlinedAt: !843)
!855 = distinct !DILexicalBlock(scope: !841, file: !122, line: 681, column: 2)
!856 = !DILocation(line: 682, column: 3, scope: !855, inlinedAt: !843)
!857 = !DILocation(line: 682, column: 23, scope: !858, inlinedAt: !843)
!858 = distinct !DILexicalBlock(scope: !841, file: !122, line: 681, column: 2)
!859 = !DILocation(line: 682, column: 3, scope: !858, inlinedAt: !843)
!860 = distinct !DISubprogram(name: "encode_many", linkageName: "std.encoding.pem.encode_many", scope: !2, file: !2, line: 327, type: !861, scopeLine: 327, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !30, retainedNodes: !73)
!861 = !DISubroutineType(types: !862)
!862 = !{!4, !38, !863, !361, !868, !338}
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[][]", size: 128, align: 64, elements: !864, identifier: "char[][]")
!864 = !{!865, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !863, baseType: !866, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !863, baseType: !10, size: 64, align: 64, offset: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[2][][]", size: 128, align: 64, elements: !869, identifier: "String[2][][]")
!869 = !{!870, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !868, baseType: !871, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64, dwarfAddressSpace: 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !868, baseType: !10, size: 64, align: 64, offset: 64)
!873 = !DILocalVariable(name: "allocator", arg: 1, scope: !860, file: !2, line: 327, type: !38)
!874 = !DILocation(line: 327, column: 34, scope: !860)
!875 = !DILocalVariable(name: "bodies", arg: 2, scope: !860, file: !2, line: 327, type: !863)
!876 = !DILocation(line: 327, column: 54, scope: !860)
!877 = !DILocalVariable(name: "tags", arg: 3, scope: !860, file: !2, line: 327, type: !361)
!878 = !DILocation(line: 327, column: 71, scope: !860)
!879 = !DILocalVariable(name: "pem_headers", arg: 4, scope: !860, file: !2, line: 327, type: !880)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "PemHeader[][]", size: 128, align: 64, elements: !881, identifier: "PemHeader[][]")
!881 = !{!882, !884}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !880, baseType: !883, size: 64, align: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64, dwarfAddressSpace: 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !880, baseType: !10, size: 64, align: 64, offset: 64)
!885 = !DILocation(line: 327, column: 92, scope: !860)
!886 = !DILocalVariable(name: "use_crlf", arg: 5, scope: !860, file: !2, line: 327, type: !338)
!887 = !DILocation(line: 327, column: 110, scope: !860)
!888 = !DILocalVariable(name: "entries", scope: !860, file: !2, line: 329, type: !10, align: 64)
!889 = !DILocation(line: 329, column: 6, scope: !860)
!890 = !DILocation(line: 329, column: 20, scope: !860)
!891 = !DILocation(line: 329, column: 32, scope: !860)
!892 = !DILocation(line: 329, column: 42, scope: !860)
!893 = !DILocalVariable(name: "result", scope: !894, file: !2, line: 118, type: !10, align: 64)
!894 = distinct !DISubprogram(name: "max", linkageName: "max", scope: !287, file: !287, line: 113, scopeLine: 113, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30, retainedNodes: !73)
!895 = !DILocation(line: 118, column: 7, scope: !894, inlinedAt: !896)
!896 = !DILocation(line: 329, column: 16, scope: !860)
!897 = !DILocation(line: 118, column: 16, scope: !894, inlinedAt: !896)
!898 = !DILocation(line: 47, column: 10, scope: !899, inlinedAt: !900)
!899 = distinct !DISubprogram(name: "greater", linkageName: "greater", scope: !287, file: !287, line: 39, scopeLine: 39, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!900 = !DILocation(line: 120, column: 8, scope: !894, inlinedAt: !896)
!901 = !DILocation(line: 47, column: 14, scope: !899, inlinedAt: !900)
!902 = !DILocation(line: 122, column: 15, scope: !903, inlinedAt: !896)
!903 = distinct !DILexicalBlock(scope: !894, file: !287, line: 121, column: 4)
!904 = !DILocation(line: 47, column: 10, scope: !905, inlinedAt: !900)
!905 = distinct !DISubprogram(name: "greater", linkageName: "greater", scope: !287, file: !287, line: 39, scopeLine: 39, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !30)
!906 = !DILocation(line: 47, column: 14, scope: !905, inlinedAt: !900)
!907 = !DILocation(line: 122, column: 15, scope: !908, inlinedAt: !896)
!908 = distinct !DILexicalBlock(scope: !894, file: !287, line: 121, column: 4)
!909 = !DILocation(line: 125, column: 10, scope: !894, inlinedAt: !896)
!910 = !DILocation(line: 332, column: 8, scope: !911)
!911 = distinct !DILexicalBlock(scope: !860, file: !2, line: 330, column: 2)
!912 = !DILocation(line: 332, column: 21, scope: !911)
!913 = !DILocation(line: 332, column: 37, scope: !914)
!914 = distinct !DILexicalBlock(scope: !911, file: !2, line: 332, column: 30)
!915 = !DILocation(line: 333, column: 8, scope: !911)
!916 = !DILocation(line: 333, column: 19, scope: !911)
!917 = !DILocation(line: 333, column: 35, scope: !918)
!918 = distinct !DILexicalBlock(scope: !911, file: !2, line: 333, column: 28)
!919 = !DILocation(line: 334, column: 8, scope: !911)
!920 = !DILocation(line: 334, column: 31, scope: !911)
!921 = !DILocation(line: 334, column: 49, scope: !911)
!922 = !DILocation(line: 334, column: 65, scope: !923)
!923 = distinct !DILexicalBlock(scope: !911, file: !2, line: 334, column: 58)
!924 = !DILocalVariable(name: "out", scope: !860, file: !2, line: 337, type: !708, align: 64)
!925 = !DILocation(line: 337, column: 10, scope: !860)
!926 = !DILocation(line: 36, column: 12, scope: !860)
!927 = !DILocation(line: 36, column: 11, scope: !860)
!928 = !DILocation(line: 338, column: 2, scope: !860)
!929 = !DILocation(line: 340, column: 6, scope: !860)
!930 = !DILocation(line: 342, column: 22, scope: !931)
!931 = distinct !DILexicalBlock(scope: !932, file: !2, line: 342, column: 3)
!932 = distinct !DILexicalBlock(scope: !860, file: !2, line: 341, column: 2)
!933 = !DILocalVariable(name: ".temp", scope: !931, file: !2, line: 342, type: !10, align: 64)
!934 = !DILocation(line: 342, column: 12, scope: !931)
!935 = !DILocalVariable(name: "x", scope: !936, file: !2, line: 342, type: !10, align: 64)
!936 = distinct !DILexicalBlock(scope: !931, file: !2, line: 342, column: 30)
