; ModuleID = 'std::compression::deflate'
source_filename = "std::compression::deflate"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%Huffman = type { [16 x i16], [288 x i16] }
%any = type { ptr, i64 }
%Token = type { i16, i16 }
%"any[]" = type { ptr, i64 }
%StreamBitReader = type { %any, %"char[]", i64, i64, i64, i32, ptr }
%IndexMap = type { i64, i32 }
%"uint[]" = type { ptr, i64 }
%ByteReader = type { %"char[]", i64 }
%ByteWriter = type { %"char[]", i64, %any }
%BitWriter = type { %"char[]", i64, i64, i32, %any }
%"Token[]" = type { ptr, i64 }
%"List{Token}" = type { i64, i64, %any, ptr }
%Code = type { i16, i16 }
%"List{IndexMap}" = type { i64, i64, %any, ptr }
%"IndexMap[]" = type { ptr, i64 }
%"ulong[]" = type { ptr, i64 }

@"$ct.std.compression.deflate.Inflater" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 67848, i64 0, i64 22, [0 x i64] zeroinitializer }, align 8
@"$ct.std.compression.deflate.StreamBitReader" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 72, i64 0, i64 7, [0 x i64] zeroinitializer }, align 8
@"$ct.std.compression.deflate.BitWriter" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 56, i64 0, i64 5, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "lit_fixed_global", linkageName: "std.compression.deflate.lit_fixed_global", scope: !2, file: !2, line: 483, type: !3, isLocal: true, isDefinition: true, align: 16)
!2 = !DIFile(filename: "deflate.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/compression")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Huffman", scope: !2, file: !2, line: 627, size: 4864, align: 16, elements: !4, identifier: "std.compression.deflate.Huffman")
!4 = !{!5, !10}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "counts", scope: !3, file: !2, line: 629, baseType: !6, size: 256, align: 16)
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, align: 16, elements: !8)
!7 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!8 = !{!9}
!9 = !DISubrange(count: 16, lowerBound: 0)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !3, file: !2, line: 630, baseType: !11, size: 4608, align: 16, offset: 256)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 4608, align: 16, elements: !12)
!12 = !{!13}
!13 = !DISubrange(count: 288, lowerBound: 0)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "dist_fixed_global", linkageName: "std.compression.deflate.dist_fixed_global", scope: !2, file: !2, line: 484, type: !3, isLocal: true, isDefinition: true, align: 16)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "LENGTH_BASE", linkageName: "std.compression.deflate.LENGTH_BASE", scope: !2, file: !2, line: 1087, type: !18, isLocal: true, isDefinition: true, align: 16)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 496, align: 16, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 31, lowerBound: 0)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "LENGTH_EXTRA", linkageName: "std.compression.deflate.LENGTH_EXTRA", scope: !2, file: !2, line: 1092, type: !23, isLocal: true, isDefinition: true, align: 8)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 248, align: 8, elements: !19)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "DIST_BASE", linkageName: "std.compression.deflate.DIST_BASE", scope: !2, file: !2, line: 1097, type: !27, isLocal: true, isDefinition: true, align: 16)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, align: 16, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 32, lowerBound: 0)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "DIST_EXTRA", linkageName: "std.compression.deflate.DIST_EXTRA", scope: !2, file: !2, line: 1103, type: !32, isLocal: true, isDefinition: true, align: 8)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, align: 8, elements: !28)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "ORDER", linkageName: "std.compression.deflate.ORDER", scope: !2, file: !2, line: 1108, type: !35, isLocal: true, isDefinition: true, align: 32)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 608, align: 32, elements: !37)
!36 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!37 = !{!38}
!38 = !DISubrange(count: 19, lowerBound: 0)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "MIN_MATCH", linkageName: "compress.MIN_MATCH", scope: !2, file: !2, line: 166, type: !36, isLocal: true, isDefinition: true, align: 32)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "MAX_MATCH", linkageName: "compress.MAX_MATCH", scope: !2, file: !2, line: 167, type: !36, isLocal: true, isDefinition: true, align: 32)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "WINDOW_SIZE", linkageName: "compress.WINDOW_SIZE", scope: !2, file: !2, line: 168, type: !36, isLocal: true, isDefinition: true, align: 32)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "HASH_SIZE", linkageName: "compress.HASH_SIZE", scope: !2, file: !2, line: 169, type: !36, isLocal: true, isDefinition: true, align: 32)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "HASH_MASK", linkageName: "compress.HASH_MASK", scope: !2, file: !2, line: 170, type: !36, isLocal: true, isDefinition: true, align: 32)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "MAX_CHAIN", linkageName: "compress.MAX_CHAIN", scope: !2, file: !2, line: 171, type: !36, isLocal: true, isDefinition: true, align: 32)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "GOOD_MATCH", linkageName: "compress.GOOD_MATCH", scope: !2, file: !2, line: 172, type: !36, isLocal: true, isDefinition: true, align: 32)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "NICE_MATCH", linkageName: "compress.NICE_MATCH", scope: !2, file: !2, line: 173, type: !36, isLocal: true, isDefinition: true, align: 32)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "run_once", linkageName: "init.run_once", scope: !2, file: !2, line: 53, type: !57, isLocal: true, isDefinition: true, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "OnceFlag", scope: !2, file: !2, line: 17, baseType: !58, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_once_t", scope: !2, file: !2, line: 98, baseType: !59, align: 64)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, align: 64, elements: !61)
!60 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!61 = !{!62}
!62 = !DISubrange(count: 2, lowerBound: 0)
!63 = !{i32 2, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{i32 2, !"wchar_size", i32 4}
!66 = !{i32 4, !"PIC Level", i32 2}
!67 = !{i32 1, !"uwtable", i32 1}
!68 = !{i32 2, !"frame-pointer", i32 1}
!69 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, globals: !148, splitDebugInlining: false)
!70 = !{!71, !77}
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SeekOrigin", scope: !2, file: !2, line: 14, baseType: !72, size: 32, align: 32, elements: !73)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !{!74, !75, !76}
!74 = !DIEnumerator(name: "FROM_START", value: 0)
!75 = !DIEnumerator(name: "FROM_CURSOR", value: 1)
!76 = !DIEnumerator(name: "FROM_END", value: 2)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InflaterState", scope: !78, file: !2, line: 498, baseType: !72, size: 32, align: 32, elements: !137)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inflater", scope: !2, file: !2, line: 20, size: 542784, align: 64, elements: !79, identifier: "std.compression.deflate.Inflater")
!79 = !{!80, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !118, !119, !123, !124, !125, !127, !128, !130, !134, !135, !136}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !78, file: !2, line: 22, baseType: !81, size: 576, align: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "StreamBitReader", scope: !78, file: !2, line: 487, size: 576, align: 64, elements: !82, identifier: "std.compression.deflate.StreamBitReader")
!82 = !{!83, !90, !97, !98, !99, !100, !101}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !81, file: !2, line: 489, baseType: !84, size: 128, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !85, identifier: "InStream")
!85 = !{!86, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !84, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !81, file: !2, line: 490, baseType: !91, size: 128, align: 64, offset: 128)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !92, identifier: "char[]")
!92 = !{!93, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !91, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !91, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !60)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "buf_pos", scope: !81, file: !2, line: 491, baseType: !96, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !81, file: !2, line: 492, baseType: !96, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !81, file: !2, line: 493, baseType: !60, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !81, file: !2, line: 494, baseType: !36, size: 32, align: 32, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "set_cursor_fn", scope: !81, file: !2, line: 495, baseType: !102, size: 64, align: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "SetCursorFn", scope: !2, file: !2, line: 6, baseType: !103, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64, dwarfAddressSpace: 0)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !87, !106, !71}
!106 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !78, file: !2, line: 23, baseType: !77, size: 32, align: 32, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "hlit", scope: !78, file: !2, line: 24, baseType: !36, size: 32, align: 32, offset: 608)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hdist", scope: !78, file: !2, line: 24, baseType: !36, size: 32, align: 32, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "hclen", scope: !78, file: !2, line: 24, baseType: !36, size: 32, align: 32, offset: 672)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_i", scope: !78, file: !2, line: 25, baseType: !36, size: 32, align: 32, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_num_lengths", scope: !78, file: !2, line: 26, baseType: !36, size: 32, align: 32, offset: 736)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "stored_len", scope: !78, file: !2, line: 27, baseType: !36, size: 32, align: 32, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "match_len", scope: !78, file: !2, line: 28, baseType: !36, size: 32, align: 32, offset: 800)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "match_dist", scope: !78, file: !2, line: 29, baseType: !36, size: 32, align: 32, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !78, file: !2, line: 30, baseType: !117, size: 8, align: 8, offset: 864)
!117 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !78, file: !2, line: 31, baseType: !117, size: 8, align: 8, offset: 872)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !78, file: !2, line: 33, baseType: !120, size: 524288, align: 8, offset: 880)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 524288, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 65536, lowerBound: 0)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !78, file: !2, line: 34, baseType: !60, size: 64, align: 64, offset: 525184)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !78, file: !2, line: 35, baseType: !60, size: 64, align: 64, offset: 525248)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "lit_ptr", scope: !78, file: !2, line: 37, baseType: !126, size: 64, align: 64, offset: 525312)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dist_ptr", scope: !78, file: !2, line: 38, baseType: !126, size: 64, align: 64, offset: 525376)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "code_lengths", scope: !78, file: !2, line: 40, baseType: !129, size: 152, align: 8, offset: 525440)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 152, align: 8, elements: !37)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lit_dist_lengths", scope: !78, file: !2, line: 41, baseType: !131, size: 2560, align: 8, offset: 525592)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2560, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 320, lowerBound: 0)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_lit", scope: !78, file: !2, line: 43, baseType: !3, size: 4864, align: 16, offset: 528160)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_dist", scope: !78, file: !2, line: 44, baseType: !3, size: 4864, align: 16, offset: 533024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_code_huff", scope: !78, file: !2, line: 45, baseType: !3, size: 4864, align: 16, offset: 537888)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!138 = !DIEnumerator(name: "START_BLOCK", value: 0)
!139 = !DIEnumerator(name: "READ_STORED_LEN", value: 1)
!140 = !DIEnumerator(name: "COPY_STORED", value: 2)
!141 = !DIEnumerator(name: "READ_DYN_COUNTS", value: 3)
!142 = !DIEnumerator(name: "READ_DYN_CODELENS", value: 4)
!143 = !DIEnumerator(name: "READ_DYN_TREES", value: 5)
!144 = !DIEnumerator(name: "DECODE_SYMBOL", value: 6)
!145 = !DIEnumerator(name: "READ_DIST_SYM", value: 7)
!146 = !DIEnumerator(name: "COPY_MATCH", value: 8)
!147 = !DIEnumerator(name: "DONE", value: 9)
!148 = !{!0, !14, !16, !21, !25, !30, !33, !39, !41, !43, !45, !47, !49, !51, !53, !55}
!149 = distinct !DISubprogram(name: "init", linkageName: "std.compression.deflate.Inflater.init", scope: !2, file: !2, line: 48, type: !150, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152, !84, !91}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !{}
!154 = !DILocation(line: 49, column: 1, scope: !149)
!155 = !DILocalVariable(name: "self", arg: 1, scope: !149, file: !2, line: 48, type: !152)
!156 = !DILocation(line: 48, column: 23, scope: !149)
!157 = !DILocalVariable(name: "input", arg: 2, scope: !149, file: !2, line: 48, type: !84)
!158 = !DILocation(line: 48, column: 39, scope: !149)
!159 = !DILocalVariable(name: "bit_reader_buf", arg: 3, scope: !149, file: !2, line: 48, type: !91)
!160 = !DILocation(line: 48, column: 53, scope: !149)
!161 = !DILocation(line: 50, column: 3, scope: !149)
!162 = !DILocation(line: 51, column: 2, scope: !149)
!163 = !DILocation(line: 51, column: 26, scope: !149)
!164 = !DILocation(line: 52, column: 2, scope: !149)
!165 = !DILocation(line: 114, column: 26, scope: !166, inlinedAt: !169)
!166 = distinct !DILexicalBlock(scope: !168, file: !167, line: 114, column: 49)
!167 = !DIFile(filename: "thread.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/threads")
!168 = distinct !DISubprogram(name: "call", linkageName: "call", scope: !167, file: !167, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!169 = !DILocation(line: 54, column: 5, scope: !149)
!170 = !DILocation(line: 114, column: 91, scope: !168, inlinedAt: !169)
!171 = !DILocation(line: 114, column: 97, scope: !168, inlinedAt: !169)
!172 = !DILocation(line: 114, column: 49, scope: !168, inlinedAt: !169)
!173 = distinct !DISubprogram(name: "read", linkageName: "std.compression.deflate.Inflater.read", scope: !2, file: !2, line: 59, type: !174, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!174 = !DISubroutineType(types: !175)
!175 = !{!60, !152, !91}
!176 = !DILocation(line: 60, column: 1, scope: !173)
!177 = !DILocalVariable(name: "self", arg: 1, scope: !173, file: !2, line: 59, type: !152)
!178 = !DILocation(line: 59, column: 23, scope: !173)
!179 = !DILocalVariable(name: "buffer", arg: 2, scope: !173, file: !2, line: 59, type: !91)
!180 = !DILocation(line: 59, column: 37, scope: !173)
!181 = !DILocation(line: 61, column: 6, scope: !173)
!182 = !DILocation(line: 61, column: 19, scope: !173)
!183 = !DILocation(line: 61, column: 31, scope: !173)
!184 = !DILocation(line: 61, column: 53, scope: !173)
!185 = !DILocalVariable(name: "total_out", scope: !173, file: !2, line: 63, type: !96, align: 64)
!186 = !DILocation(line: 63, column: 6, scope: !173)
!187 = !DILocation(line: 63, column: 18, scope: !173)
!188 = !DILocation(line: 64, column: 2, scope: !173)
!189 = !DILocation(line: 64, column: 9, scope: !190)
!190 = distinct !DILexicalBlock(scope: !173, file: !2, line: 64, column: 2)
!191 = !DILocation(line: 64, column: 21, scope: !190)
!192 = !DILocation(line: 66, column: 7, scope: !193)
!193 = distinct !DILexicalBlock(scope: !190, file: !2, line: 65, column: 2)
!194 = !DILocation(line: 66, column: 23, scope: !193)
!195 = !DILocalVariable(name: "to_copy", scope: !196, file: !2, line: 68, type: !60, align: 64)
!196 = distinct !DILexicalBlock(scope: !193, file: !2, line: 67, column: 3)
!197 = !DILocation(line: 68, column: 10, scope: !196)
!198 = !DILocation(line: 68, column: 38, scope: !196)
!199 = !DILocation(line: 68, column: 51, scope: !196)
!200 = !DILocation(line: 68, column: 30, scope: !196)
!201 = !DILocation(line: 68, column: 63, scope: !196)
!202 = !DILocation(line: 68, column: 74, scope: !196)
!203 = !DILocation(line: 440, column: 16, scope: !204, inlinedAt: !206)
!204 = distinct !DISubprogram(name: "min", linkageName: "min", scope: !205, file: !205, line: 437, scopeLine: 437, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!205 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!206 = !DILocation(line: 68, column: 20, scope: !196)
!207 = !DILocation(line: 440, column: 19, scope: !204, inlinedAt: !206)
!208 = !DILocalVariable(name: "start_idx", scope: !196, file: !2, line: 70, type: !60, align: 64)
!209 = !DILocation(line: 70, column: 10, scope: !196)
!210 = !DILocation(line: 70, column: 22, scope: !196)
!211 = !DILocalVariable(name: "len", scope: !196, file: !2, line: 71, type: !60, align: 64)
!212 = !DILocation(line: 71, column: 10, scope: !196)
!213 = !DILocation(line: 71, column: 44, scope: !196)
!214 = !DILocation(line: 71, column: 35, scope: !196)
!215 = !DILocation(line: 440, column: 16, scope: !216, inlinedAt: !217)
!216 = distinct !DISubprogram(name: "min", linkageName: "min", scope: !205, file: !205, line: 437, scopeLine: 437, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!217 = !DILocation(line: 71, column: 16, scope: !196)
!218 = !DILocation(line: 440, column: 19, scope: !216, inlinedAt: !217)
!219 = !DILocation(line: 73, column: 28, scope: !196)
!220 = !DILocation(line: 73, column: 40, scope: !196)
!221 = !DILocation(line: 73, column: 50, scope: !196)
!222 = !DILocation(line: 73, column: 4, scope: !196)
!223 = !DILocation(line: 73, column: 11, scope: !196)
!224 = !DILocation(line: 73, column: 21, scope: !196)
!225 = !DILocation(line: 75, column: 8, scope: !196)
!226 = !DILocation(line: 75, column: 30, scope: !196)
!227 = !DILocalVariable(name: "res", scope: !228, file: !2, line: 1189, type: !60, align: 64)
!228 = distinct !DISubprogram(name: "overflow_add_helper", linkageName: "overflow_add_helper", scope: !205, file: !205, line: 1187, scopeLine: 1187, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69, retainedNodes: !153)
!229 = !DILocation(line: 1189, column: 13, scope: !228, inlinedAt: !230)
!230 = !DILocation(line: 967, column: 54, scope: !231, inlinedAt: !232)
!231 = distinct !DISubprogram(name: "overflow_add", linkageName: "overflow_add", scope: !205, file: !205, line: 967, scopeLine: 967, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!232 = !DILocation(line: 76, column: 16, scope: !196)
!233 = !DILocation(line: 1190, column: 21, scope: !228, inlinedAt: !230)
!234 = !DILocation(line: 1190, column: 24, scope: !228, inlinedAt: !230)
!235 = !DILocation(line: 1190, column: 28, scope: !228, inlinedAt: !230)
!236 = !DILocation(line: 1190, column: 41, scope: !228, inlinedAt: !230)
!237 = !DILocation(line: 1191, column: 9, scope: !228, inlinedAt: !230)
!238 = !DILocation(line: 76, column: 52, scope: !196)
!239 = !DILocation(line: 77, column: 4, scope: !196)
!240 = !DILocation(line: 77, column: 21, scope: !196)
!241 = !DILocation(line: 79, column: 8, scope: !196)
!242 = !DILocation(line: 79, column: 14, scope: !196)
!243 = !DILocation(line: 81, column: 39, scope: !244)
!244 = distinct !DILexicalBlock(scope: !196, file: !2, line: 80, column: 4)
!245 = !DILocation(line: 81, column: 52, scope: !244)
!246 = !DILocation(line: 81, column: 62, scope: !244)
!247 = !DILocation(line: 81, column: 5, scope: !244)
!248 = !DILocation(line: 81, column: 12, scope: !244)
!249 = !DILocation(line: 81, column: 22, scope: !244)
!250 = !DILocation(line: 81, column: 32, scope: !244)
!251 = !DILocation(line: 83, column: 5, scope: !244)
!252 = !DILocation(line: 83, column: 24, scope: !244)
!253 = !DILocation(line: 83, column: 34, scope: !244)
!254 = !DILocation(line: 83, column: 18, scope: !244)
!255 = !DILocation(line: 84, column: 5, scope: !244)
!256 = !DILocation(line: 84, column: 22, scope: !244)
!257 = !DILocation(line: 84, column: 32, scope: !244)
!258 = !DILocation(line: 86, column: 4, scope: !196)
!259 = !DILocation(line: 89, column: 7, scope: !193)
!260 = !DILocation(line: 89, column: 18, scope: !193)
!261 = !DILocation(line: 91, column: 7, scope: !193)
!262 = !DILocation(line: 91, column: 18, scope: !193)
!263 = !DILocation(line: 91, column: 43, scope: !193)
!264 = !DILocation(line: 93, column: 17, scope: !193)
!265 = !DILocation(line: 93, column: 3, scope: !193)
!266 = !DILocation(line: 96, column: 9, scope: !173)
!267 = distinct !DISubprogram(name: "read_byte", linkageName: "std.compression.deflate.Inflater.read_byte", scope: !2, file: !2, line: 99, type: !268, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!268 = !DISubroutineType(types: !269)
!269 = !{!24, !152}
!270 = !DILocation(line: 100, column: 1, scope: !267)
!271 = !DILocalVariable(name: "self", arg: 1, scope: !267, file: !2, line: 99, type: !152)
!272 = !DILocation(line: 99, column: 29, scope: !267)
!273 = !DILocalVariable(name: "b", scope: !267, file: !2, line: 101, type: !274, align: 8)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, align: 8, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 1, lowerBound: 0)
!277 = !DILocation(line: 101, column: 10, scope: !267)
!278 = !DILocalVariable(name: "n", scope: !267, file: !2, line: 102, type: !96, align: 64)
!279 = !DILocation(line: 102, column: 10, scope: !267)
!280 = !DILocation(line: 102, column: 25, scope: !267)
!281 = !DILocation(line: 102, column: 14, scope: !267)
!282 = !DILocation(line: 102, column: 31, scope: !267)
!283 = !DILocation(line: 104, column: 12, scope: !284)
!284 = distinct !DILexicalBlock(scope: !267, file: !2, line: 103, column: 2)
!285 = !DILocation(line: 106, column: 9, scope: !267)
!286 = distinct !DISubprogram(name: "init", linkageName: "std.compression.deflate.StreamBitReader.init", scope: !2, file: !2, line: 512, type: !287, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289, !84, !91}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!290 = !DILocation(line: 513, column: 1, scope: !286)
!291 = !DILocalVariable(name: "self", arg: 1, scope: !286, file: !2, line: 512, type: !289)
!292 = !DILocation(line: 512, column: 30, scope: !286)
!293 = !DILocalVariable(name: "reader", arg: 2, scope: !286, file: !2, line: 512, type: !84)
!294 = !DILocation(line: 512, column: 46, scope: !286)
!295 = !DILocalVariable(name: "buffer", arg: 3, scope: !286, file: !2, line: 512, type: !91)
!296 = !DILocation(line: 512, column: 61, scope: !286)
!297 = !DILocation(line: 514, column: 22, scope: !286)
!298 = !DILocation(line: 514, column: 40, scope: !286)
!299 = !DILocation(line: 514, column: 66, scope: !286)
!300 = !DILocation(line: 514, column: 3, scope: !286)
!301 = distinct !DISubprogram(name: "close", linkageName: "std.compression.deflate.StreamBitReader.close", scope: !2, file: !2, line: 516, type: !302, scopeLine: 516, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !289}
!304 = !DILocation(line: 517, column: 1, scope: !301)
!305 = !DILocalVariable(name: "self", arg: 1, scope: !301, file: !2, line: 516, type: !289)
!306 = !DILocation(line: 516, column: 31, scope: !301)
!307 = !DILocation(line: 518, column: 6, scope: !301)
!308 = !DILocation(line: 518, column: 22, scope: !301)
!309 = !DILocation(line: 518, column: 38, scope: !301)
!310 = !DILocation(line: 518, column: 54, scope: !301)
!311 = !DILocation(line: 520, column: 9, scope: !312)
!312 = distinct !DILexicalBlock(scope: !301, file: !2, line: 519, column: 2)
!313 = !DILocation(line: 520, column: 28, scope: !312)
!314 = !DILocation(line: 520, column: 47, scope: !312)
!315 = !DILocation(line: 520, column: 68, scope: !312)
!316 = !DILocation(line: 520, column: 41, scope: !312)
!317 = !DILocation(line: 520, column: 82, scope: !312)
!318 = !DILocation(line: 520, column: 3, scope: !312)
!319 = distinct !DISubprogram(name: "refill", linkageName: "std.compression.deflate.StreamBitReader.refill", scope: !2, file: !2, line: 524, type: !302, scopeLine: 524, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!320 = !DILocation(line: 525, column: 1, scope: !319)
!321 = !DILocalVariable(name: "self", arg: 1, scope: !319, file: !2, line: 524, type: !289)
!322 = !DILocation(line: 524, column: 33, scope: !319)
!323 = !DILocation(line: 526, column: 6, scope: !319)
!324 = !DILocation(line: 526, column: 22, scope: !319)
!325 = !DILocalVariable(name: "n", scope: !326, file: !2, line: 528, type: !96, align: 64)
!326 = distinct !DILexicalBlock(scope: !319, file: !2, line: 527, column: 2)
!327 = !DILocation(line: 528, column: 7, scope: !326)
!328 = !DILocation(line: 528, column: 11, scope: !326)
!329 = !DILocation(line: 528, column: 28, scope: !326)
!330 = !DILocation(line: 529, column: 7, scope: !326)
!331 = !DILocation(line: 529, column: 18, scope: !326)
!332 = !DILocation(line: 530, column: 3, scope: !326)
!333 = !DILocation(line: 531, column: 3, scope: !326)
!334 = distinct !DISubprogram(name: "read_bits", linkageName: "std.compression.deflate.StreamBitReader.read_bits", scope: !2, file: !2, line: 535, type: !335, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!335 = !DISubroutineType(types: !336)
!336 = !{!36, !289, !36}
!337 = !DILocation(line: 536, column: 1, scope: !334)
!338 = !DILocalVariable(name: "self", arg: 1, scope: !334, file: !2, line: 535, type: !289)
!339 = !DILocation(line: 535, column: 36, scope: !334)
!340 = !DILocalVariable(name: "count", arg: 2, scope: !334, file: !2, line: 535, type: !36)
!341 = !DILocation(line: 535, column: 48, scope: !334)
!342 = !DILocation(line: 537, column: 6, scope: !334)
!343 = !DILocation(line: 537, column: 25, scope: !334)
!344 = !DILocation(line: 538, column: 6, scope: !334)
!345 = !DILocation(line: 538, column: 19, scope: !334)
!346 = !DILocation(line: 540, column: 3, scope: !347)
!347 = distinct !DILexicalBlock(scope: !334, file: !2, line: 539, column: 2)
!348 = !DILocation(line: 540, column: 10, scope: !349)
!349 = distinct !DILexicalBlock(scope: !347, file: !2, line: 540, column: 3)
!350 = !DILocation(line: 542, column: 8, scope: !351)
!351 = distinct !DILexicalBlock(scope: !349, file: !2, line: 541, column: 3)
!352 = !DILocation(line: 542, column: 24, scope: !351)
!353 = !DILocalVariable(name: "f", scope: !354, file: !2, line: 517, type: !356, align: 64)
!354 = distinct !DISubprogram(name: "@catch", linkageName: "@catch", scope: !355, file: !355, line: 515, scopeLine: 515, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69, retainedNodes: !153)
!355 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !106)
!357 = !DILocation(line: 517, column: 12, scope: !354, inlinedAt: !358)
!358 = !DILocation(line: 544, column: 9, scope: !359)
!359 = distinct !DILexicalBlock(scope: !351, file: !2, line: 543, column: 4)
!360 = !DILocation(line: 544, column: 16, scope: !354, inlinedAt: !358)
!361 = !DILocation(line: 517, column: 16, scope: !354, inlinedAt: !358)
!362 = !DILocation(line: 517, column: 30, scope: !354, inlinedAt: !358)
!363 = !DILocation(line: 518, column: 9, scope: !354, inlinedAt: !358)
!364 = !DILocation(line: 544, column: 32, scope: !359)
!365 = !DILocation(line: 546, column: 4, scope: !351)
!366 = !DILocation(line: 546, column: 27, scope: !351)
!367 = !DILocation(line: 546, column: 39, scope: !351)
!368 = !DILocation(line: 546, column: 58, scope: !351)
!369 = !DILocation(line: 546, column: 20, scope: !351)
!370 = !DILocation(line: 547, column: 4, scope: !351)
!371 = !DILocation(line: 550, column: 6, scope: !334)
!372 = !DILocation(line: 550, column: 19, scope: !334)
!373 = !DILocation(line: 550, column: 33, scope: !334)
!374 = !DILocalVariable(name: "value", scope: !334, file: !2, line: 551, type: !36, align: 32)
!375 = !DILocation(line: 551, column: 7, scope: !334)
!376 = !DILocation(line: 551, column: 22, scope: !334)
!377 = !DILocation(line: 551, column: 46, scope: !334)
!378 = !DILocation(line: 551, column: 39, scope: !334)
!379 = !DILocation(line: 551, column: 38, scope: !334)
!380 = !DILocation(line: 551, column: 15, scope: !334)
!381 = !DILocation(line: 552, column: 2, scope: !334)
!382 = !DILocation(line: 552, column: 19, scope: !334)
!383 = !DILocation(line: 553, column: 2, scope: !334)
!384 = !DILocation(line: 553, column: 16, scope: !334)
!385 = !DILocation(line: 554, column: 9, scope: !334)
!386 = distinct !DISubprogram(name: "align", linkageName: "std.compression.deflate.StreamBitReader.align", scope: !2, file: !2, line: 557, type: !302, scopeLine: 557, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!387 = !DILocation(line: 558, column: 1, scope: !386)
!388 = !DILocalVariable(name: "self", arg: 1, scope: !386, file: !2, line: 557, type: !289)
!389 = !DILocation(line: 557, column: 31, scope: !386)
!390 = !DILocalVariable(name: "skip", scope: !386, file: !2, line: 559, type: !36, align: 32)
!391 = !DILocation(line: 559, column: 7, scope: !386)
!392 = !DILocation(line: 559, column: 14, scope: !386)
!393 = !DILocation(line: 560, column: 2, scope: !386)
!394 = !DILocation(line: 560, column: 19, scope: !386)
!395 = !DILocation(line: 561, column: 2, scope: !386)
!396 = !DILocation(line: 561, column: 16, scope: !386)
!397 = distinct !DISubprogram(name: "init", linkageName: "std.compression.deflate.BitWriter.init", scope: !2, file: !2, line: 573, type: !398, scopeLine: 573, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !400, !408, !60}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64, dwarfAddressSpace: 0)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "BitWriter", scope: !2, file: !2, line: 564, size: 448, align: 64, elements: !402, identifier: "std.compression.deflate.BitWriter")
!402 = !{!403, !404, !405, !406, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !401, file: !2, line: 566, baseType: !91, size: 128, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !401, file: !2, line: 567, baseType: !96, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !401, file: !2, line: 568, baseType: !60, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !401, file: !2, line: 569, baseType: !36, size: 32, align: 32, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !401, file: !2, line: 570, baseType: !408, size: 128, align: 64, offset: 320)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !409, identifier: "Allocator")
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !408, baseType: !87, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !408, baseType: !89, size: 64, align: 64, offset: 64)
!412 = !DILocation(line: 574, column: 1, scope: !397)
!413 = !DILocalVariable(name: "self", arg: 1, scope: !397, file: !2, line: 573, type: !400)
!414 = !DILocation(line: 573, column: 24, scope: !397)
!415 = !DILocalVariable(name: "allocator", arg: 2, scope: !397, file: !2, line: 573, type: !408)
!416 = !DILocation(line: 573, column: 41, scope: !397)
!417 = !DILocalVariable(name: "initial_cap", arg: 3, scope: !397, file: !2, line: 573, type: !96)
!418 = !DILocation(line: 573, column: 56, scope: !397)
!419 = !DILocation(line: 575, column: 2, scope: !397)
!420 = !DILocation(line: 304, column: 55, scope: !421, inlinedAt: !423)
!421 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !422, file: !422, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!422 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!423 = !DILocation(line: 287, column: 9, scope: !424, inlinedAt: !425)
!424 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !422, file: !422, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!425 = !DILocation(line: 576, column: 14, scope: !397)
!426 = !DILocation(line: 304, column: 40, scope: !421, inlinedAt: !423)
!427 = !DILocation(line: 80, column: 6, scope: !428, inlinedAt: !429)
!428 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !422, file: !422, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!429 = !DILocation(line: 304, column: 18, scope: !421, inlinedAt: !423)
!430 = !DILocation(line: 80, column: 20, scope: !428, inlinedAt: !429)
!431 = !DILocation(line: 86, column: 28, scope: !428, inlinedAt: !429)
!432 = !DILocation(line: 38, column: 12, scope: !428, inlinedAt: !429)
!433 = !DILocation(line: 1039, column: 9, scope: !434, inlinedAt: !435)
!434 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!435 = !DILocation(line: 38, column: 26, scope: !428, inlinedAt: !429)
!436 = !DILocation(line: 1039, column: 20, scope: !434, inlinedAt: !435)
!437 = !DILocation(line: 1039, column: 25, scope: !434, inlinedAt: !435)
!438 = !DILocation(line: 1039, column: 19, scope: !434, inlinedAt: !435)
!439 = !DILocation(line: 86, column: 10, scope: !428, inlinedAt: !429)
!440 = !DILocation(line: 304, column: 67, scope: !421, inlinedAt: !423)
!441 = !DILocation(line: 304, column: 9, scope: !421, inlinedAt: !423)
!442 = !DILocation(line: 576, column: 2, scope: !397)
!443 = !DILocation(line: 577, column: 2, scope: !397)
!444 = !DILocation(line: 578, column: 2, scope: !397)
!445 = !DILocation(line: 579, column: 2, scope: !397)
!446 = distinct !DISubprogram(name: "write_bits", linkageName: "std.compression.deflate.BitWriter.write_bits", scope: !2, file: !2, line: 582, type: !447, scopeLine: 582, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !400, !36, !36}
!449 = !DILocation(line: 583, column: 1, scope: !446)
!450 = !DILocalVariable(name: "self", arg: 1, scope: !446, file: !2, line: 582, type: !400)
!451 = !DILocation(line: 582, column: 30, scope: !446)
!452 = !DILocalVariable(name: "value", arg: 2, scope: !446, file: !2, line: 582, type: !36)
!453 = !DILocation(line: 582, column: 42, scope: !446)
!454 = !DILocalVariable(name: "count", arg: 3, scope: !446, file: !2, line: 582, type: !36)
!455 = !DILocation(line: 582, column: 54, scope: !446)
!456 = !DILocation(line: 584, column: 2, scope: !446)
!457 = !DILocation(line: 584, column: 25, scope: !446)
!458 = !DILocation(line: 584, column: 40, scope: !446)
!459 = !DILocation(line: 584, column: 35, scope: !446)
!460 = !DILocation(line: 584, column: 34, scope: !446)
!461 = !DILocation(line: 584, column: 17, scope: !446)
!462 = !DILocation(line: 584, column: 56, scope: !446)
!463 = !DILocation(line: 585, column: 2, scope: !446)
!464 = !DILocation(line: 585, column: 16, scope: !446)
!465 = !DILocation(line: 586, column: 2, scope: !446)
!466 = !DILocation(line: 586, column: 9, scope: !467)
!467 = distinct !DILexicalBlock(scope: !446, file: !2, line: 586, column: 2)
!468 = !DILocation(line: 588, column: 7, scope: !469)
!469 = distinct !DILexicalBlock(scope: !467, file: !2, line: 587, column: 2)
!470 = !DILocation(line: 588, column: 19, scope: !469)
!471 = !DILocalVariable(name: "new_cap", scope: !472, file: !2, line: 590, type: !96, align: 64)
!472 = distinct !DILexicalBlock(scope: !469, file: !2, line: 589, column: 3)
!473 = !DILocation(line: 590, column: 8, scope: !472)
!474 = !DILocation(line: 590, column: 18, scope: !472)
!475 = !DILocation(line: 591, column: 8, scope: !472)
!476 = !DILocation(line: 591, column: 34, scope: !472)
!477 = !DILocation(line: 592, column: 4, scope: !472)
!478 = !DILocation(line: 592, column: 11, scope: !479)
!479 = distinct !DILexicalBlock(scope: !472, file: !2, line: 592, column: 4)
!480 = !DILocation(line: 592, column: 22, scope: !479)
!481 = !DILocation(line: 594, column: 9, scope: !482)
!482 = distinct !DILexicalBlock(scope: !479, file: !2, line: 593, column: 4)
!483 = !DILocation(line: 594, column: 44, scope: !484)
!484 = distinct !DILexicalBlock(scope: !482, file: !2, line: 594, column: 32)
!485 = !DILocation(line: 594, column: 58, scope: !484)
!486 = !DILocation(line: 595, column: 5, scope: !482)
!487 = !DILocation(line: 597, column: 41, scope: !472)
!488 = !DILocation(line: 597, column: 57, scope: !472)
!489 = !DILocation(line: 329, column: 61, scope: !490, inlinedAt: !491)
!490 = distinct !DISubprogram(name: "realloc_array_try", linkageName: "realloc_array_try", scope: !422, file: !422, line: 327, scopeLine: 327, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!491 = !DILocation(line: 312, column: 9, scope: !492, inlinedAt: !493)
!492 = distinct !DISubprogram(name: "realloc_array", linkageName: "realloc_array", scope: !422, file: !422, line: 310, scopeLine: 310, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!493 = !DILocation(line: 597, column: 16, scope: !472)
!494 = !DILocation(line: 329, column: 46, scope: !490, inlinedAt: !491)
!495 = !DILocation(line: 108, column: 6, scope: !496, inlinedAt: !497)
!496 = distinct !DISubprogram(name: "realloc_try", linkageName: "realloc_try", scope: !422, file: !422, line: 106, scopeLine: 106, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!497 = !DILocation(line: 329, column: 18, scope: !490, inlinedAt: !491)
!498 = !DILocation(line: 119, column: 6, scope: !499, inlinedAt: !500)
!499 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !422, file: !422, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!500 = !DILocation(line: 110, column: 3, scope: !501, inlinedAt: !497)
!501 = distinct !DILexicalBlock(scope: !496, file: !422, line: 109, column: 2)
!502 = !DILocation(line: 119, column: 18, scope: !499, inlinedAt: !500)
!503 = !DILocation(line: 123, column: 20, scope: !499, inlinedAt: !500)
!504 = !DILocation(line: 123, column: 2, scope: !499, inlinedAt: !500)
!505 = !DILocation(line: 111, column: 10, scope: !501, inlinedAt: !497)
!506 = !DILocation(line: 113, column: 6, scope: !496, inlinedAt: !497)
!507 = !DILocation(line: 113, column: 37, scope: !496, inlinedAt: !497)
!508 = !DILocation(line: 38, column: 12, scope: !496, inlinedAt: !497)
!509 = !DILocation(line: 1039, column: 9, scope: !510, inlinedAt: !511)
!510 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!511 = !DILocation(line: 38, column: 26, scope: !496, inlinedAt: !497)
!512 = !DILocation(line: 1039, column: 20, scope: !510, inlinedAt: !511)
!513 = !DILocation(line: 1039, column: 25, scope: !510, inlinedAt: !511)
!514 = !DILocation(line: 1039, column: 19, scope: !510, inlinedAt: !511)
!515 = !DILocation(line: 113, column: 19, scope: !496, inlinedAt: !497)
!516 = !DILocation(line: 114, column: 26, scope: !496, inlinedAt: !497)
!517 = !DILocation(line: 114, column: 31, scope: !496, inlinedAt: !497)
!518 = !DILocation(line: 48, column: 12, scope: !496, inlinedAt: !497)
!519 = !DILocation(line: 1039, column: 9, scope: !520, inlinedAt: !521)
!520 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!521 = !DILocation(line: 48, column: 26, scope: !496, inlinedAt: !497)
!522 = !DILocation(line: 1039, column: 20, scope: !520, inlinedAt: !521)
!523 = !DILocation(line: 1039, column: 25, scope: !520, inlinedAt: !521)
!524 = !DILocation(line: 1039, column: 19, scope: !520, inlinedAt: !521)
!525 = !DILocation(line: 114, column: 9, scope: !496, inlinedAt: !497)
!526 = !DILocation(line: 329, column: 73, scope: !490, inlinedAt: !491)
!527 = !DILocation(line: 329, column: 9, scope: !490, inlinedAt: !491)
!528 = !DILocation(line: 597, column: 4, scope: !472)
!529 = !DILocation(line: 599, column: 34, scope: !469)
!530 = !DILocation(line: 599, column: 27, scope: !469)
!531 = !DILocation(line: 599, column: 3, scope: !469)
!532 = !DILocation(line: 599, column: 13, scope: !469)
!533 = !DILocation(line: 600, column: 3, scope: !469)
!534 = !DILocation(line: 601, column: 3, scope: !469)
!535 = distinct !DISubprogram(name: "write_huffman", linkageName: "std.compression.deflate.BitWriter.write_huffman", scope: !2, file: !2, line: 605, type: !447, scopeLine: 605, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!536 = !DILocation(line: 606, column: 1, scope: !535)
!537 = !DILocalVariable(name: "self", arg: 1, scope: !535, file: !2, line: 605, type: !400)
!538 = !DILocation(line: 605, column: 33, scope: !535)
!539 = !DILocalVariable(name: "code", arg: 2, scope: !535, file: !2, line: 605, type: !36)
!540 = !DILocation(line: 605, column: 45, scope: !535)
!541 = !DILocalVariable(name: "len", arg: 3, scope: !535, file: !2, line: 605, type: !36)
!542 = !DILocation(line: 605, column: 56, scope: !535)
!543 = !DILocalVariable(name: "rev", scope: !535, file: !2, line: 607, type: !36, align: 32)
!544 = !DILocation(line: 607, column: 7, scope: !535)
!545 = !DILocation(line: 607, column: 27, scope: !535)
!546 = !DILocation(line: 607, column: 41, scope: !535)
!547 = !DILocation(line: 607, column: 36, scope: !535)
!548 = !DILocation(line: 6, column: 34, scope: !549, inlinedAt: !551)
!549 = distinct !DISubprogram(name: "reverse", linkageName: "reverse", scope: !550, file: !550, line: 6, scopeLine: 6, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!550 = !DIFile(filename: "bits.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std")
!551 = !DILocation(line: 607, column: 13, scope: !535)
!552 = !DILocation(line: 608, column: 23, scope: !535)
!553 = !DILocation(line: 608, column: 2, scope: !535)
!554 = distinct !DISubprogram(name: "finish", linkageName: "std.compression.deflate.BitWriter.finish", scope: !2, file: !2, line: 611, type: !555, scopeLine: 611, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!555 = !DISubroutineType(types: !556)
!556 = !{!91, !400}
!557 = !DILocation(line: 612, column: 1, scope: !554)
!558 = !DILocalVariable(name: "self", arg: 1, scope: !554, file: !2, line: 611, type: !400)
!559 = !DILocation(line: 611, column: 28, scope: !554)
!560 = !DILocation(line: 613, column: 6, scope: !554)
!561 = !DILocation(line: 615, column: 7, scope: !562)
!562 = distinct !DILexicalBlock(scope: !554, file: !2, line: 614, column: 2)
!563 = !DILocation(line: 615, column: 19, scope: !562)
!564 = !DILocalVariable(name: "new_cap", scope: !565, file: !2, line: 617, type: !96, align: 64)
!565 = distinct !DILexicalBlock(scope: !562, file: !2, line: 616, column: 3)
!566 = !DILocation(line: 617, column: 8, scope: !565)
!567 = !DILocation(line: 617, column: 18, scope: !565)
!568 = !DILocation(line: 618, column: 41, scope: !565)
!569 = !DILocation(line: 618, column: 57, scope: !565)
!570 = !DILocation(line: 329, column: 61, scope: !571, inlinedAt: !572)
!571 = distinct !DISubprogram(name: "realloc_array_try", linkageName: "realloc_array_try", scope: !422, file: !422, line: 327, scopeLine: 327, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!572 = !DILocation(line: 312, column: 9, scope: !573, inlinedAt: !574)
!573 = distinct !DISubprogram(name: "realloc_array", linkageName: "realloc_array", scope: !422, file: !422, line: 310, scopeLine: 310, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!574 = !DILocation(line: 618, column: 16, scope: !565)
!575 = !DILocation(line: 329, column: 46, scope: !571, inlinedAt: !572)
!576 = !DILocation(line: 108, column: 6, scope: !577, inlinedAt: !578)
!577 = distinct !DISubprogram(name: "realloc_try", linkageName: "realloc_try", scope: !422, file: !422, line: 106, scopeLine: 106, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!578 = !DILocation(line: 329, column: 18, scope: !571, inlinedAt: !572)
!579 = !DILocation(line: 119, column: 6, scope: !580, inlinedAt: !581)
!580 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !422, file: !422, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!581 = !DILocation(line: 110, column: 3, scope: !582, inlinedAt: !578)
!582 = distinct !DILexicalBlock(scope: !577, file: !422, line: 109, column: 2)
!583 = !DILocation(line: 119, column: 18, scope: !580, inlinedAt: !581)
!584 = !DILocation(line: 123, column: 20, scope: !580, inlinedAt: !581)
!585 = !DILocation(line: 123, column: 2, scope: !580, inlinedAt: !581)
!586 = !DILocation(line: 111, column: 10, scope: !582, inlinedAt: !578)
!587 = !DILocation(line: 113, column: 6, scope: !577, inlinedAt: !578)
!588 = !DILocation(line: 113, column: 37, scope: !577, inlinedAt: !578)
!589 = !DILocation(line: 38, column: 12, scope: !577, inlinedAt: !578)
!590 = !DILocation(line: 1039, column: 9, scope: !591, inlinedAt: !592)
!591 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!592 = !DILocation(line: 38, column: 26, scope: !577, inlinedAt: !578)
!593 = !DILocation(line: 1039, column: 20, scope: !591, inlinedAt: !592)
!594 = !DILocation(line: 1039, column: 25, scope: !591, inlinedAt: !592)
!595 = !DILocation(line: 1039, column: 19, scope: !591, inlinedAt: !592)
!596 = !DILocation(line: 113, column: 19, scope: !577, inlinedAt: !578)
!597 = !DILocation(line: 114, column: 26, scope: !577, inlinedAt: !578)
!598 = !DILocation(line: 114, column: 31, scope: !577, inlinedAt: !578)
!599 = !DILocation(line: 48, column: 12, scope: !577, inlinedAt: !578)
!600 = !DILocation(line: 1039, column: 9, scope: !601, inlinedAt: !602)
!601 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!602 = !DILocation(line: 48, column: 26, scope: !577, inlinedAt: !578)
!603 = !DILocation(line: 1039, column: 20, scope: !601, inlinedAt: !602)
!604 = !DILocation(line: 1039, column: 25, scope: !601, inlinedAt: !602)
!605 = !DILocation(line: 1039, column: 19, scope: !601, inlinedAt: !602)
!606 = !DILocation(line: 114, column: 9, scope: !577, inlinedAt: !578)
!607 = !DILocation(line: 329, column: 73, scope: !571, inlinedAt: !572)
!608 = !DILocation(line: 329, column: 9, scope: !571, inlinedAt: !572)
!609 = !DILocation(line: 618, column: 4, scope: !565)
!610 = !DILocation(line: 620, column: 34, scope: !562)
!611 = !DILocation(line: 620, column: 27, scope: !562)
!612 = !DILocation(line: 620, column: 3, scope: !562)
!613 = !DILocation(line: 620, column: 13, scope: !562)
!614 = !DILocation(line: 621, column: 3, scope: !562)
!615 = !DILocation(line: 622, column: 3, scope: !562)
!616 = !DILocation(line: 624, column: 9, scope: !554)
!617 = !DILocation(line: 624, column: 19, scope: !554)
!618 = !DILocation(line: 624, column: 20, scope: !554)
!619 = distinct !DISubprogram(name: "build", linkageName: "std.compression.deflate.Huffman.build", scope: !2, file: !2, line: 633, type: !620, scopeLine: 633, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !126, !91}
!622 = !DILocation(line: 634, column: 1, scope: !619)
!623 = !DILocalVariable(name: "self", arg: 1, scope: !619, file: !2, line: 633, type: !126)
!624 = !DILocation(line: 633, column: 23, scope: !619)
!625 = !DILocalVariable(name: "lengths", arg: 2, scope: !619, file: !2, line: 633, type: !91)
!626 = !DILocation(line: 633, column: 37, scope: !619)
!627 = !DILocalVariable(name: "offsets", scope: !619, file: !2, line: 635, type: !6, align: 16)
!628 = !DILocation(line: 635, column: 13, scope: !619)
!629 = !DILocation(line: 636, column: 2, scope: !619)
!630 = !DILocation(line: 637, column: 17, scope: !631)
!631 = distinct !DILexicalBlock(scope: !619, file: !2, line: 637, column: 2)
!632 = !DILocalVariable(name: ".temp", scope: !631, file: !2, line: 637, type: !96, align: 64)
!633 = !DILocalVariable(name: "len", scope: !634, file: !2, line: 637, type: !24, align: 8)
!634 = distinct !DILexicalBlock(scope: !631, file: !2, line: 638, column: 2)
!635 = !DILocation(line: 637, column: 11, scope: !634)
!636 = !DILocation(line: 637, column: 17, scope: !634)
!637 = !DILocation(line: 639, column: 7, scope: !638)
!638 = distinct !DILexicalBlock(scope: !634, file: !2, line: 638, column: 2)
!639 = !DILocation(line: 639, column: 18, scope: !638)
!640 = !DILocation(line: 639, column: 28, scope: !638)
!641 = !DILocation(line: 639, column: 40, scope: !638)
!642 = !DILocalVariable(name: "offset", scope: !619, file: !2, line: 642, type: !7, align: 16)
!643 = !DILocation(line: 642, column: 9, scope: !619)
!644 = !DILocation(line: 642, column: 18, scope: !619)
!645 = !DILocalVariable(name: "i", scope: !646, file: !2, line: 643, type: !36, align: 32)
!646 = distinct !DILexicalBlock(scope: !619, file: !2, line: 643, column: 2)
!647 = !DILocation(line: 643, column: 12, scope: !646)
!648 = !DILocation(line: 643, column: 16, scope: !646)
!649 = !DILocation(line: 643, column: 19, scope: !646)
!650 = !DILocation(line: 645, column: 11, scope: !651)
!651 = distinct !DILexicalBlock(scope: !646, file: !2, line: 644, column: 2)
!652 = !DILocation(line: 646, column: 3, scope: !651)
!653 = !DILocation(line: 646, column: 13, scope: !651)
!654 = !DILocation(line: 646, column: 25, scope: !651)
!655 = !DILocation(line: 643, column: 27, scope: !646)
!656 = !DILocation(line: 649, column: 25, scope: !657)
!657 = distinct !DILexicalBlock(scope: !619, file: !2, line: 649, column: 2)
!658 = !DILocalVariable(name: ".temp", scope: !657, file: !2, line: 649, type: !96, align: 64)
!659 = !DILocation(line: 649, column: 16, scope: !657)
!660 = !DILocalVariable(name: "i", scope: !661, file: !2, line: 649, type: !36, align: 32)
!661 = distinct !DILexicalBlock(scope: !657, file: !2, line: 650, column: 2)
!662 = !DILocation(line: 649, column: 16, scope: !661)
!663 = !DILocalVariable(name: "len", scope: !661, file: !2, line: 649, type: !24, align: 8)
!664 = !DILocation(line: 649, column: 19, scope: !661)
!665 = !DILocation(line: 649, column: 25, scope: !661)
!666 = !DILocation(line: 651, column: 7, scope: !667)
!667 = distinct !DILexicalBlock(scope: !661, file: !2, line: 650, column: 2)
!668 = !DILocation(line: 651, column: 18, scope: !667)
!669 = !DILocalVariable(name: "sym_idx", scope: !670, file: !2, line: 653, type: !7, align: 16)
!670 = distinct !DILexicalBlock(scope: !667, file: !2, line: 652, column: 3)
!671 = !DILocation(line: 653, column: 11, scope: !670)
!672 = !DILocation(line: 653, column: 29, scope: !670)
!673 = !DILocation(line: 653, column: 21, scope: !670)
!674 = !DILocation(line: 654, column: 8, scope: !670)
!675 = !DILocation(line: 656, column: 29, scope: !676)
!676 = distinct !DILexicalBlock(scope: !670, file: !2, line: 655, column: 4)
!677 = !DILocation(line: 656, column: 5, scope: !676)
!678 = !DILocation(line: 656, column: 18, scope: !676)
!679 = distinct !DISubprogram(name: "less", linkageName: "std.compression.deflate.IndexMap.less", scope: !2, file: !2, line: 673, type: !680, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!680 = !DISubroutineType(types: !681)
!681 = !{!117, !682, !683}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64, align: 64, dwarfAddressSpace: 0)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "IndexMap", scope: !2, file: !2, line: 668, size: 128, align: 64, elements: !684, identifier: "std.compression.deflate.IndexMap")
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !683, file: !2, line: 670, baseType: !96, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !683, file: !2, line: 671, baseType: !36, size: 32, align: 32, offset: 64)
!687 = !DILocation(line: 673, column: 49, scope: !679)
!688 = !DILocalVariable(name: "self", arg: 1, scope: !679, file: !2, line: 673, type: !682)
!689 = !DILocation(line: 673, column: 23, scope: !679)
!690 = !DILocalVariable(name: "other", arg: 2, scope: !679, file: !2, line: 673, type: !683)
!691 = !DILocation(line: 673, column: 39, scope: !679)
!692 = !DILocation(line: 673, column: 61, scope: !679)
!693 = distinct !DISubprogram(name: "get_lengths", linkageName: "std.compression.deflate.Huffman.get_lengths", scope: !2, file: !2, line: 808, type: !694, scopeLine: 808, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!694 = !DISubroutineType(types: !695)
!695 = !{!91, !126, !60}
!696 = !DILocation(line: 809, column: 1, scope: !693)
!697 = !DILocalVariable(name: "self", arg: 1, scope: !693, file: !2, line: 808, type: !126)
!698 = !DILocation(line: 808, column: 31, scope: !693)
!699 = !DILocalVariable(name: "max_sym", arg: 2, scope: !693, file: !2, line: 808, type: !96)
!700 = !DILocation(line: 808, column: 42, scope: !693)
!701 = !DILocalVariable(name: "blen", scope: !693, file: !2, line: 810, type: !91, align: 64)
!702 = !DILocation(line: 810, column: 9, scope: !693)
!703 = !DILocation(line: 810, column: 37, scope: !693)
!704 = !DILocation(line: 810, column: 49, scope: !693)
!705 = !DILocation(line: 270, column: 55, scope: !706, inlinedAt: !707)
!706 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !422, file: !422, line: 268, scopeLine: 268, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!707 = !DILocation(line: 262, column: 9, scope: !708, inlinedAt: !709)
!708 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !422, file: !422, line: 260, scopeLine: 260, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!709 = !DILocation(line: 810, column: 16, scope: !693)
!710 = !DILocation(line: 270, column: 40, scope: !706, inlinedAt: !707)
!711 = !DILocation(line: 97, column: 6, scope: !712, inlinedAt: !713)
!712 = distinct !DISubprogram(name: "calloc_try", linkageName: "calloc_try", scope: !422, file: !422, line: 95, scopeLine: 95, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!713 = !DILocation(line: 270, column: 18, scope: !706, inlinedAt: !707)
!714 = !DILocation(line: 97, column: 20, scope: !712, inlinedAt: !713)
!715 = !DILocation(line: 98, column: 27, scope: !712, inlinedAt: !713)
!716 = !DILocation(line: 38, column: 12, scope: !712, inlinedAt: !713)
!717 = !DILocation(line: 1039, column: 9, scope: !718, inlinedAt: !719)
!718 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!719 = !DILocation(line: 38, column: 26, scope: !712, inlinedAt: !713)
!720 = !DILocation(line: 1039, column: 20, scope: !718, inlinedAt: !719)
!721 = !DILocation(line: 1039, column: 25, scope: !718, inlinedAt: !719)
!722 = !DILocation(line: 1039, column: 19, scope: !718, inlinedAt: !719)
!723 = !DILocation(line: 98, column: 9, scope: !712, inlinedAt: !713)
!724 = !DILocation(line: 270, column: 67, scope: !706, inlinedAt: !707)
!725 = !DILocation(line: 270, column: 9, scope: !706, inlinedAt: !707)
!726 = !DILocalVariable(name: "index", scope: !693, file: !2, line: 812, type: !7, align: 16)
!727 = !DILocation(line: 812, column: 9, scope: !693)
!728 = !DILocation(line: 812, column: 17, scope: !693)
!729 = !DILocalVariable(name: "len", scope: !730, file: !2, line: 813, type: !36, align: 32)
!730 = distinct !DILexicalBlock(scope: !693, file: !2, line: 813, column: 2)
!731 = !DILocation(line: 813, column: 12, scope: !730)
!732 = !DILocation(line: 813, column: 18, scope: !730)
!733 = !DILocation(line: 813, column: 21, scope: !730)
!734 = !DILocalVariable(name: "count", scope: !735, file: !2, line: 815, type: !36, align: 32)
!735 = distinct !DILexicalBlock(scope: !730, file: !2, line: 814, column: 2)
!736 = !DILocation(line: 815, column: 8, scope: !735)
!737 = !DILocation(line: 815, column: 16, scope: !735)
!738 = !DILocation(line: 815, column: 28, scope: !735)
!739 = !DILocalVariable(name: "i", scope: !740, file: !2, line: 816, type: !36, align: 32)
!740 = distinct !DILexicalBlock(scope: !735, file: !2, line: 816, column: 3)
!741 = !DILocation(line: 816, column: 13, scope: !740)
!742 = !DILocation(line: 816, column: 17, scope: !740)
!743 = !DILocation(line: 816, column: 20, scope: !740)
!744 = !DILocation(line: 816, column: 24, scope: !740)
!745 = !DILocation(line: 818, column: 34, scope: !746)
!746 = distinct !DILexicalBlock(scope: !740, file: !2, line: 817, column: 3)
!747 = !DILocation(line: 818, column: 4, scope: !746)
!748 = !DILocation(line: 818, column: 9, scope: !746)
!749 = !DILocation(line: 818, column: 22, scope: !746)
!750 = !DILocation(line: 816, column: 31, scope: !740)
!751 = !DILocation(line: 813, column: 31, scope: !730)
!752 = !DILocation(line: 821, column: 9, scope: !693)
!753 = distinct !DISubprogram(name: "build_from_freqs", linkageName: "std.compression.deflate.Huffman.build_from_freqs", scope: !2, file: !2, line: 824, type: !754, scopeLine: 824, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !126, !756, !36}
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "uint[]", size: 128, align: 64, elements: !757, identifier: "uint[]")
!757 = !{!758, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !756, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !756, baseType: !96, size: 64, align: 64, offset: 64)
!761 = !DILocation(line: 824, column: 73, scope: !753)
!762 = !DILocalVariable(name: "self", arg: 1, scope: !753, file: !2, line: 824, type: !126)
!763 = !DILocation(line: 824, column: 34, scope: !753)
!764 = !DILocalVariable(name: "freqs", arg: 2, scope: !753, file: !2, line: 824, type: !756)
!765 = !DILocation(line: 824, column: 48, scope: !753)
!766 = !DILocalVariable(name: "max_bits", arg: 3, scope: !753, file: !2, line: 824, type: !36)
!767 = !DILocation(line: 824, column: 60, scope: !753)
!768 = !DILocalVariable(name: "state", scope: !769, file: !2, line: 679, type: !771, align: 64)
!769 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !770, file: !770, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69, retainedNodes: !153)
!770 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 496, baseType: !772, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64, align: 64, dwarfAddressSpace: 0)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !774, identifier: "std.core.mem.allocator.TempAllocator")
!774 = !{!775, !776, !788, !789, !790, !791, !792, !793, !794, !795, !796}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !773, file: !2, line: 33, baseType: !408, size: 128, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !773, file: !2, line: 34, baseType: !777, size: 64, align: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64, dwarfAddressSpace: 0)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !779, identifier: "std.core.mem.allocator.TempAllocatorPage")
!779 = !{!780, !781, !782, !783, !784}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !778, file: !2, line: 56, baseType: !777, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !778, file: !2, line: 57, baseType: !87, size: 64, align: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !778, file: !2, line: 58, baseType: !96, size: 64, align: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !778, file: !2, line: 59, baseType: !96, size: 64, align: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !778, file: !2, line: 60, baseType: !785, align: 8, offset: 256)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, align: 8, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 0, lowerBound: 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !773, file: !2, line: 35, baseType: !772, size: 64, align: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !773, file: !2, line: 36, baseType: !117, size: 8, align: 8, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !773, file: !2, line: 37, baseType: !96, size: 64, align: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !773, file: !2, line: 38, baseType: !96, size: 64, align: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !773, file: !2, line: 39, baseType: !96, size: 64, align: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !773, file: !2, line: 40, baseType: !96, size: 64, align: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !773, file: !2, line: 41, baseType: !96, size: 64, align: 64, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !773, file: !2, line: 42, baseType: !96, size: 64, align: 64, offset: 640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !773, file: !2, line: 43, baseType: !785, align: 8, offset: 704)
!797 = !DILocation(line: 679, column: 12, scope: !769, inlinedAt: !761)
!798 = !DILocation(line: 679, column: 41, scope: !769, inlinedAt: !761)
!799 = !DILocation(line: 679, column: 20, scope: !769, inlinedAt: !761)
!800 = !DILocalVariable(name: "blen", scope: !801, file: !2, line: 826, type: !91, align: 64)
!801 = distinct !DILexicalBlock(scope: !753, file: !2, line: 825, column: 1)
!802 = !DILocation(line: 826, column: 9, scope: !801)
!803 = !DILocation(line: 826, column: 26, scope: !801)
!804 = !DILocation(line: 826, column: 39, scope: !801)
!805 = !DILocation(line: 826, column: 16, scope: !801)
!806 = !DILocation(line: 827, column: 13, scope: !801)
!807 = !DILocation(line: 827, column: 2, scope: !801)
!808 = !DILocation(line: 682, column: 23, scope: !809, inlinedAt: !761)
!809 = distinct !DILexicalBlock(scope: !769, file: !770, line: 681, column: 2)
!810 = !DILocation(line: 682, column: 3, scope: !809, inlinedAt: !761)
!811 = distinct !DISubprogram(name: "decode_stream", linkageName: "std.compression.deflate.Huffman.decode_stream", scope: !2, file: !2, line: 925, type: !812, scopeLine: 925, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!812 = !DISubroutineType(types: !813)
!813 = !{!7, !126, !289}
!814 = !DILocation(line: 926, column: 1, scope: !811)
!815 = !DILocalVariable(name: "self", arg: 1, scope: !811, file: !2, line: 925, type: !126)
!816 = !DILocation(line: 925, column: 34, scope: !811)
!817 = !DILocalVariable(name: "reader", arg: 2, scope: !811, file: !2, line: 925, type: !289)
!818 = !DILocation(line: 925, column: 58, scope: !811)
!819 = !DILocalVariable(name: "code", scope: !811, file: !2, line: 927, type: !36, align: 32)
!820 = !DILocation(line: 927, column: 7, scope: !811)
!821 = !DILocation(line: 927, column: 14, scope: !811)
!822 = !DILocalVariable(name: "first", scope: !811, file: !2, line: 928, type: !36, align: 32)
!823 = !DILocation(line: 928, column: 7, scope: !811)
!824 = !DILocation(line: 928, column: 15, scope: !811)
!825 = !DILocalVariable(name: "index", scope: !811, file: !2, line: 929, type: !36, align: 32)
!826 = !DILocation(line: 929, column: 7, scope: !811)
!827 = !DILocation(line: 929, column: 15, scope: !811)
!828 = !DILocalVariable(name: "len", scope: !829, file: !2, line: 930, type: !36, align: 32)
!829 = distinct !DILexicalBlock(scope: !811, file: !2, line: 930, column: 2)
!830 = !DILocation(line: 930, column: 12, scope: !829)
!831 = !DILocation(line: 930, column: 18, scope: !829)
!832 = !DILocation(line: 930, column: 21, scope: !829)
!833 = !DILocation(line: 932, column: 3, scope: !834)
!834 = distinct !DILexicalBlock(scope: !829, file: !2, line: 931, column: 2)
!835 = !DILocation(line: 932, column: 11, scope: !834)
!836 = !DILocalVariable(name: "count", scope: !834, file: !2, line: 933, type: !36, align: 32)
!837 = !DILocation(line: 933, column: 8, scope: !834)
!838 = !DILocation(line: 933, column: 16, scope: !834)
!839 = !DILocation(line: 933, column: 28, scope: !834)
!840 = !DILocation(line: 934, column: 7, scope: !834)
!841 = !DILocation(line: 934, column: 14, scope: !834)
!842 = !DILocation(line: 934, column: 22, scope: !834)
!843 = !DILocation(line: 936, column: 11, scope: !844)
!844 = distinct !DILexicalBlock(scope: !834, file: !2, line: 935, column: 3)
!845 = !DILocation(line: 936, column: 24, scope: !844)
!846 = !DILocation(line: 936, column: 33, scope: !844)
!847 = !DILocation(line: 936, column: 40, scope: !844)
!848 = !DILocation(line: 938, column: 3, scope: !834)
!849 = !DILocation(line: 938, column: 12, scope: !834)
!850 = !DILocation(line: 939, column: 3, scope: !834)
!851 = !DILocation(line: 939, column: 12, scope: !834)
!852 = !DILocation(line: 940, column: 3, scope: !834)
!853 = !DILocation(line: 941, column: 3, scope: !834)
!854 = !DILocation(line: 930, column: 31, scope: !829)
!855 = !DILocation(line: 943, column: 9, scope: !811)
!856 = distinct !DISubprogram(name: "decompress", linkageName: "std.compression.deflate.decompress", scope: !2, file: !2, line: 109, type: !857, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!857 = !DISubroutineType(types: !858)
!858 = !{!91, !408, !91}
!859 = !DILocalVariable(name: "allocator", arg: 1, scope: !856, file: !2, line: 109, type: !408)
!860 = !DILocation(line: 109, column: 33, scope: !856)
!861 = !DILocalVariable(name: "input", arg: 2, scope: !856, file: !2, line: 109, type: !91)
!862 = !DILocation(line: 109, column: 51, scope: !856)
!863 = !DILocalVariable(name: "state", scope: !864, file: !2, line: 679, type: !771, align: 64)
!864 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !770, file: !770, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69, retainedNodes: !153)
!865 = !DILocation(line: 679, column: 12, scope: !864, inlinedAt: !866)
!866 = !DILocation(line: 109, column: 61, scope: !856)
!867 = !DILocation(line: 679, column: 41, scope: !864, inlinedAt: !866)
!868 = !DILocation(line: 679, column: 20, scope: !864, inlinedAt: !866)
!869 = !DILocation(line: 111, column: 6, scope: !870)
!870 = distinct !DILexicalBlock(scope: !856, file: !2, line: 110, column: 1)
!871 = !DILocation(line: 270, column: 55, scope: !872, inlinedAt: !873)
!872 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !422, file: !422, line: 268, scopeLine: 268, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!873 = !DILocation(line: 262, column: 9, scope: !874, inlinedAt: !875)
!874 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !422, file: !422, line: 260, scopeLine: 260, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!875 = !DILocation(line: 111, column: 25, scope: !870)
!876 = !DILocation(line: 270, column: 40, scope: !872, inlinedAt: !873)
!877 = !DILocation(line: 97, column: 6, scope: !878, inlinedAt: !879)
!878 = distinct !DISubprogram(name: "calloc_try", linkageName: "calloc_try", scope: !422, file: !422, line: 95, scopeLine: 95, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!879 = !DILocation(line: 270, column: 18, scope: !872, inlinedAt: !873)
!880 = !DILocation(line: 97, column: 20, scope: !878, inlinedAt: !879)
!881 = !DILocation(line: 98, column: 27, scope: !878, inlinedAt: !879)
!882 = !DILocation(line: 38, column: 12, scope: !878, inlinedAt: !879)
!883 = !DILocation(line: 1039, column: 9, scope: !884, inlinedAt: !885)
!884 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!885 = !DILocation(line: 38, column: 26, scope: !878, inlinedAt: !879)
!886 = !DILocation(line: 1039, column: 20, scope: !884, inlinedAt: !885)
!887 = !DILocation(line: 1039, column: 25, scope: !884, inlinedAt: !885)
!888 = !DILocation(line: 1039, column: 19, scope: !884, inlinedAt: !885)
!889 = !DILocation(line: 98, column: 9, scope: !878, inlinedAt: !879)
!890 = !DILocation(line: 270, column: 67, scope: !872, inlinedAt: !873)
!891 = !DILocation(line: 270, column: 9, scope: !872, inlinedAt: !873)
!892 = !DILocation(line: 682, column: 23, scope: !893, inlinedAt: !866)
!893 = distinct !DILexicalBlock(scope: !864, file: !770, line: 681, column: 2)
!894 = !DILocation(line: 682, column: 3, scope: !893, inlinedAt: !866)
!895 = !DILocalVariable(name: "mem_stream", scope: !870, file: !2, line: 113, type: !896, align: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteReader", scope: !2, file: !2, line: 3, size: 192, align: 64, elements: !897, identifier: "std.io.ByteReader")
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !896, file: !2, line: 5, baseType: !91, size: 128, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !896, file: !2, line: 6, baseType: !96, size: 64, align: 64, offset: 128)
!900 = !DILocation(line: 113, column: 13, scope: !870)
!901 = !DILocation(line: 114, column: 18, scope: !870)
!902 = !DILocation(line: 114, column: 2, scope: !870)
!903 = !DILocalVariable(name: "inflater", scope: !870, file: !2, line: 116, type: !152, align: 64)
!904 = !DILocation(line: 116, column: 12, scope: !870)
!905 = !DILocation(line: 116, column: 38, scope: !870)
!906 = !DILocation(line: 97, column: 6, scope: !907, inlinedAt: !908)
!907 = distinct !DISubprogram(name: "calloc_try", linkageName: "calloc_try", scope: !422, file: !422, line: 95, scopeLine: 95, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!908 = !DILocation(line: 92, column: 9, scope: !909, inlinedAt: !910)
!909 = distinct !DISubprogram(name: "calloc", linkageName: "calloc", scope: !422, file: !422, line: 90, scopeLine: 90, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!910 = !DILocation(line: 175, column: 18, scope: !911, inlinedAt: !912)
!911 = distinct !DISubprogram(name: "new", linkageName: "new", scope: !422, file: !422, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!912 = !DILocation(line: 116, column: 23, scope: !870)
!913 = !DILocation(line: 97, column: 20, scope: !907, inlinedAt: !908)
!914 = !DILocation(line: 98, column: 27, scope: !907, inlinedAt: !908)
!915 = !DILocation(line: 38, column: 12, scope: !907, inlinedAt: !908)
!916 = !DILocation(line: 1039, column: 9, scope: !917, inlinedAt: !918)
!917 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!918 = !DILocation(line: 38, column: 26, scope: !907, inlinedAt: !908)
!919 = !DILocation(line: 1039, column: 20, scope: !917, inlinedAt: !918)
!920 = !DILocation(line: 1039, column: 25, scope: !917, inlinedAt: !918)
!921 = !DILocation(line: 1039, column: 19, scope: !917, inlinedAt: !918)
!922 = !DILocation(line: 98, column: 9, scope: !907, inlinedAt: !908)
!923 = !DILocalVariable(name: "tmp_bit_buf", scope: !870, file: !2, line: 117, type: !924, align: 8)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32768, align: 8, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 4096, lowerBound: 0)
!927 = !DILocation(line: 117, column: 13, scope: !870)
!928 = !DILocation(line: 118, column: 16, scope: !870)
!929 = !DILocation(line: 118, column: 30, scope: !870)
!930 = !DILocation(line: 118, column: 2, scope: !870)
!931 = !DILocalVariable(name: "out_cap", scope: !870, file: !2, line: 120, type: !96, align: 64)
!932 = !DILocation(line: 120, column: 6, scope: !870)
!933 = !DILocation(line: 120, column: 16, scope: !870)
!934 = !DILocation(line: 121, column: 6, scope: !870)
!935 = !DILocation(line: 121, column: 32, scope: !870)
!936 = !DILocalVariable(name: "writer", scope: !870, file: !2, line: 123, type: !937, align: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteWriter", scope: !2, file: !2, line: 4, size: 320, align: 64, elements: !938, identifier: "std.io.ByteWriter")
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !937, file: !2, line: 6, baseType: !91, size: 128, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !937, file: !2, line: 7, baseType: !96, size: 64, align: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !937, file: !2, line: 8, baseType: !408, size: 128, align: 64, offset: 192)
!942 = !DILocation(line: 123, column: 13, scope: !870)
!943 = !DILocation(line: 25, column: 11, scope: !870)
!944 = !DILocation(line: 124, column: 2, scope: !870)
!945 = !DILocation(line: 125, column: 25, scope: !870)
!946 = !DILocation(line: 125, column: 2, scope: !870)
!947 = !DILocation(line: 682, column: 23, scope: !948, inlinedAt: !866)
!948 = distinct !DILexicalBlock(scope: !864, file: !770, line: 681, column: 2)
!949 = !DILocation(line: 682, column: 3, scope: !948, inlinedAt: !866)
!950 = !DILocalVariable(name: "out_len", scope: !870, file: !2, line: 127, type: !96, align: 64)
!951 = !DILocation(line: 127, column: 6, scope: !870)
!952 = !DILocation(line: 127, column: 28, scope: !870)
!953 = !DILocation(line: 127, column: 38, scope: !870)
!954 = !DILocation(line: 127, column: 16, scope: !870)
!955 = !DILocation(line: 682, column: 23, scope: !956, inlinedAt: !866)
!956 = distinct !DILexicalBlock(scope: !864, file: !770, line: 681, column: 2)
!957 = !DILocation(line: 682, column: 3, scope: !956, inlinedAt: !866)
!958 = !DILocation(line: 128, column: 6, scope: !870)
!959 = !DILocation(line: 270, column: 55, scope: !960, inlinedAt: !961)
!960 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !422, file: !422, line: 268, scopeLine: 268, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!961 = !DILocation(line: 262, column: 9, scope: !962, inlinedAt: !963)
!962 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !422, file: !422, line: 260, scopeLine: 260, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!963 = !DILocation(line: 128, column: 27, scope: !870)
!964 = !DILocation(line: 270, column: 40, scope: !960, inlinedAt: !961)
!965 = !DILocation(line: 97, column: 6, scope: !966, inlinedAt: !967)
!966 = distinct !DISubprogram(name: "calloc_try", linkageName: "calloc_try", scope: !422, file: !422, line: 95, scopeLine: 95, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!967 = !DILocation(line: 270, column: 18, scope: !960, inlinedAt: !961)
!968 = !DILocation(line: 97, column: 20, scope: !966, inlinedAt: !967)
!969 = !DILocation(line: 98, column: 27, scope: !966, inlinedAt: !967)
!970 = !DILocation(line: 38, column: 12, scope: !966, inlinedAt: !967)
!971 = !DILocation(line: 1039, column: 9, scope: !972, inlinedAt: !973)
!972 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!973 = !DILocation(line: 38, column: 26, scope: !966, inlinedAt: !967)
!974 = !DILocation(line: 1039, column: 20, scope: !972, inlinedAt: !973)
!975 = !DILocation(line: 1039, column: 25, scope: !972, inlinedAt: !973)
!976 = !DILocation(line: 1039, column: 19, scope: !972, inlinedAt: !973)
!977 = !DILocation(line: 98, column: 9, scope: !966, inlinedAt: !967)
!978 = !DILocation(line: 270, column: 67, scope: !960, inlinedAt: !961)
!979 = !DILocation(line: 270, column: 9, scope: !960, inlinedAt: !961)
!980 = !DILocation(line: 682, column: 23, scope: !981, inlinedAt: !866)
!981 = distinct !DILexicalBlock(scope: !864, file: !770, line: 681, column: 2)
!982 = !DILocation(line: 682, column: 3, scope: !981, inlinedAt: !866)
!983 = !DILocalVariable(name: "result", scope: !870, file: !2, line: 130, type: !91, align: 64)
!984 = !DILocation(line: 130, column: 9, scope: !870)
!985 = !DILocation(line: 304, column: 55, scope: !986, inlinedAt: !987)
!986 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !422, file: !422, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!987 = !DILocation(line: 287, column: 9, scope: !988, inlinedAt: !989)
!988 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !422, file: !422, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!989 = !DILocation(line: 130, column: 18, scope: !870)
!990 = !DILocation(line: 304, column: 40, scope: !986, inlinedAt: !987)
!991 = !DILocation(line: 80, column: 6, scope: !992, inlinedAt: !993)
!992 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !422, file: !422, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!993 = !DILocation(line: 304, column: 18, scope: !986, inlinedAt: !987)
!994 = !DILocation(line: 80, column: 20, scope: !992, inlinedAt: !993)
!995 = !DILocation(line: 86, column: 28, scope: !992, inlinedAt: !993)
!996 = !DILocation(line: 38, column: 12, scope: !992, inlinedAt: !993)
!997 = !DILocation(line: 1039, column: 9, scope: !998, inlinedAt: !999)
!998 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!999 = !DILocation(line: 38, column: 26, scope: !992, inlinedAt: !993)
!1000 = !DILocation(line: 1039, column: 20, scope: !998, inlinedAt: !999)
!1001 = !DILocation(line: 1039, column: 25, scope: !998, inlinedAt: !999)
!1002 = !DILocation(line: 1039, column: 19, scope: !998, inlinedAt: !999)
!1003 = !DILocation(line: 86, column: 10, scope: !992, inlinedAt: !993)
!1004 = !DILocation(line: 304, column: 67, scope: !986, inlinedAt: !987)
!1005 = !DILocation(line: 304, column: 9, scope: !986, inlinedAt: !987)
!1006 = !DILocation(line: 131, column: 15, scope: !870)
!1007 = !DILocation(line: 131, column: 35, scope: !870)
!1008 = !DILocation(line: 131, column: 36, scope: !870)
!1009 = !DILocation(line: 131, column: 2, scope: !870)
!1010 = !DILocation(line: 131, column: 9, scope: !870)
!1011 = !DILocation(line: 132, column: 9, scope: !870)
!1012 = !DILocation(line: 682, column: 23, scope: !1013, inlinedAt: !866)
!1013 = distinct !DILexicalBlock(scope: !864, file: !770, line: 681, column: 2)
!1014 = !DILocation(line: 682, column: 3, scope: !1013, inlinedAt: !866)
!1015 = distinct !DISubprogram(name: "decompress_stream", linkageName: "std.compression.deflate.decompress_stream", scope: !2, file: !2, line: 140, type: !1016, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{null, !84, !1018}
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "OutStream", size: 128, align: 64, elements: !1019, identifier: "OutStream")
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1018, baseType: !87, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1018, baseType: !89, size: 64, align: 64, offset: 64)
!1022 = !DILocalVariable(name: "input", arg: 1, scope: !1015, file: !2, line: 140, type: !84)
!1023 = !DILocation(line: 140, column: 37, scope: !1015)
!1024 = !DILocalVariable(name: "output", arg: 2, scope: !1015, file: !2, line: 140, type: !1018)
!1025 = !DILocation(line: 140, column: 54, scope: !1015)
!1026 = !DILocalVariable(name: "state", scope: !1027, file: !2, line: 679, type: !771, align: 64)
!1027 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !770, file: !770, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69, retainedNodes: !153)
!1028 = !DILocation(line: 679, column: 12, scope: !1027, inlinedAt: !1029)
!1029 = !DILocation(line: 140, column: 65, scope: !1015)
!1030 = !DILocation(line: 679, column: 41, scope: !1027, inlinedAt: !1029)
!1031 = !DILocation(line: 679, column: 20, scope: !1027, inlinedAt: !1029)
!1032 = !DILocalVariable(name: "inflater", scope: !1033, file: !2, line: 142, type: !152, align: 64)
!1033 = distinct !DILexicalBlock(scope: !1015, file: !2, line: 141, column: 1)
!1034 = !DILocation(line: 142, column: 12, scope: !1033)
!1035 = !DILocation(line: 892, column: 18, scope: !1036, inlinedAt: !1037)
!1036 = distinct !DISubprogram(name: "tnew", linkageName: "tnew", scope: !770, file: !770, line: 885, scopeLine: 885, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1037 = !DILocation(line: 142, column: 23, scope: !1033)
!1038 = !DILocalVariable(name: "bit_buf", scope: !1033, file: !2, line: 143, type: !91, align: 64)
!1039 = !DILocation(line: 143, column: 9, scope: !1033)
!1040 = !DILocation(line: 892, column: 18, scope: !1041, inlinedAt: !1042)
!1041 = distinct !DISubprogram(name: "tnew", linkageName: "tnew", scope: !770, file: !770, line: 885, scopeLine: 885, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1042 = !DILocation(line: 143, column: 19, scope: !1033)
!1043 = !DILocation(line: 144, column: 23, scope: !1033)
!1044 = !DILocation(line: 144, column: 2, scope: !1033)
!1045 = !DILocation(line: 145, column: 14, scope: !1033)
!1046 = !DILocation(line: 145, column: 2, scope: !1033)
!1047 = !DILocation(line: 682, column: 23, scope: !1048, inlinedAt: !1029)
!1048 = distinct !DILexicalBlock(scope: !1027, file: !770, line: 681, column: 2)
!1049 = !DILocation(line: 682, column: 3, scope: !1048, inlinedAt: !1029)
!1050 = !DILocation(line: 682, column: 23, scope: !1051, inlinedAt: !1029)
!1051 = distinct !DILexicalBlock(scope: !1027, file: !770, line: 681, column: 2)
!1052 = !DILocation(line: 682, column: 3, scope: !1051, inlinedAt: !1029)
!1053 = distinct !DISubprogram(name: "compress", linkageName: "std.compression.deflate.compress", scope: !2, file: !2, line: 154, type: !857, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !69, retainedNodes: !153)
!1054 = !DILocalVariable(name: "allocator", arg: 1, scope: !1053, file: !2, line: 154, type: !408)
!1055 = !DILocation(line: 154, column: 31, scope: !1053)
!1056 = !DILocalVariable(name: "input", arg: 2, scope: !1053, file: !2, line: 154, type: !91)
!1057 = !DILocation(line: 154, column: 49, scope: !1053)
!1058 = !DILocalVariable(name: "state", scope: !1059, file: !2, line: 679, type: !771, align: 64)
!1059 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !770, file: !770, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69, retainedNodes: !153)
!1060 = !DILocation(line: 679, column: 12, scope: !1059, inlinedAt: !1061)
!1061 = !DILocation(line: 154, column: 59, scope: !1053)
!1062 = !DILocation(line: 679, column: 41, scope: !1059, inlinedAt: !1061)
!1063 = !DILocation(line: 679, column: 20, scope: !1059, inlinedAt: !1061)
!1064 = !DILocation(line: 156, column: 6, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1053, file: !2, line: 155, column: 1)
!1066 = !DILocalVariable(name: "writer", scope: !1067, file: !2, line: 158, type: !401, align: 64)
!1067 = distinct !DILexicalBlock(scope: !1065, file: !2, line: 157, column: 2)
!1068 = !DILocation(line: 158, column: 13, scope: !1067)
!1069 = !DILocation(line: 159, column: 26, scope: !1067)
!1070 = !DILocation(line: 159, column: 3, scope: !1067)
!1071 = !DILocation(line: 160, column: 3, scope: !1067)
!1072 = !DILocation(line: 161, column: 3, scope: !1067)
!1073 = !DILocation(line: 162, column: 3, scope: !1067)
!1074 = !DILocation(line: 163, column: 10, scope: !1067)
!1075 = !DILocation(line: 682, column: 23, scope: !1076, inlinedAt: !1061)
!1076 = distinct !DILexicalBlock(scope: !1059, file: !770, line: 681, column: 2)
!1077 = !DILocation(line: 682, column: 3, scope: !1076, inlinedAt: !1061)
!1078 = !DILocalVariable(name: "head", scope: !1065, file: !2, line: 175, type: !756, align: 64)
!1079 = !DILocation(line: 175, column: 9, scope: !1065)
!1080 = !DILocation(line: 175, column: 39, scope: !1065)
!1081 = !DILocation(line: 304, column: 55, scope: !1082, inlinedAt: !1083)
!1082 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !422, file: !422, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1083 = !DILocation(line: 287, column: 9, scope: !1084, inlinedAt: !1085)
!1084 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !422, file: !422, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1085 = !DILocation(line: 175, column: 16, scope: !1065)
!1086 = !DILocation(line: 304, column: 40, scope: !1082, inlinedAt: !1083)
!1087 = !DILocation(line: 80, column: 6, scope: !1088, inlinedAt: !1089)
!1088 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !422, file: !422, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1089 = !DILocation(line: 304, column: 18, scope: !1082, inlinedAt: !1083)
!1090 = !DILocation(line: 80, column: 20, scope: !1088, inlinedAt: !1089)
!1091 = !DILocation(line: 86, column: 28, scope: !1088, inlinedAt: !1089)
!1092 = !DILocation(line: 38, column: 12, scope: !1088, inlinedAt: !1089)
!1093 = !DILocation(line: 1039, column: 9, scope: !1094, inlinedAt: !1095)
!1094 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1095 = !DILocation(line: 38, column: 26, scope: !1088, inlinedAt: !1089)
!1096 = !DILocation(line: 1039, column: 20, scope: !1094, inlinedAt: !1095)
!1097 = !DILocation(line: 1039, column: 25, scope: !1094, inlinedAt: !1095)
!1098 = !DILocation(line: 1039, column: 19, scope: !1094, inlinedAt: !1095)
!1099 = !DILocation(line: 86, column: 10, scope: !1088, inlinedAt: !1089)
!1100 = !DILocation(line: 304, column: 67, scope: !1082, inlinedAt: !1083)
!1101 = !DILocation(line: 304, column: 9, scope: !1082, inlinedAt: !1083)
!1102 = !DILocation(line: 176, column: 2, scope: !1065)
!1103 = !DILocation(line: 176, column: 7, scope: !1065)
!1104 = !DILocalVariable(name: "prev", scope: !1065, file: !2, line: 178, type: !756, align: 64)
!1105 = !DILocation(line: 178, column: 9, scope: !1065)
!1106 = !DILocation(line: 178, column: 39, scope: !1065)
!1107 = !DILocation(line: 304, column: 55, scope: !1108, inlinedAt: !1109)
!1108 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !422, file: !422, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1109 = !DILocation(line: 287, column: 9, scope: !1110, inlinedAt: !1111)
!1110 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !422, file: !422, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1111 = !DILocation(line: 178, column: 16, scope: !1065)
!1112 = !DILocation(line: 304, column: 40, scope: !1108, inlinedAt: !1109)
!1113 = !DILocation(line: 80, column: 6, scope: !1114, inlinedAt: !1115)
!1114 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !422, file: !422, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1115 = !DILocation(line: 304, column: 18, scope: !1108, inlinedAt: !1109)
!1116 = !DILocation(line: 80, column: 20, scope: !1114, inlinedAt: !1115)
!1117 = !DILocation(line: 86, column: 28, scope: !1114, inlinedAt: !1115)
!1118 = !DILocation(line: 38, column: 12, scope: !1114, inlinedAt: !1115)
!1119 = !DILocation(line: 1039, column: 9, scope: !1120, inlinedAt: !1121)
!1120 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1121 = !DILocation(line: 38, column: 26, scope: !1114, inlinedAt: !1115)
!1122 = !DILocation(line: 1039, column: 20, scope: !1120, inlinedAt: !1121)
!1123 = !DILocation(line: 1039, column: 25, scope: !1120, inlinedAt: !1121)
!1124 = !DILocation(line: 1039, column: 19, scope: !1120, inlinedAt: !1121)
!1125 = !DILocation(line: 86, column: 10, scope: !1114, inlinedAt: !1115)
!1126 = !DILocation(line: 304, column: 67, scope: !1108, inlinedAt: !1109)
!1127 = !DILocation(line: 304, column: 9, scope: !1108, inlinedAt: !1109)
!1128 = !DILocalVariable(name: "lit_freqs", scope: !1065, file: !2, line: 180, type: !756, align: 64)
!1129 = !DILocation(line: 180, column: 9, scope: !1065)
!1130 = !DILocation(line: 979, column: 41, scope: !1131, inlinedAt: !1132)
!1131 = distinct !DISubprogram(name: "temp_array", linkageName: "temp_array", scope: !770, file: !770, line: 977, scopeLine: 977, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1132 = !DILocation(line: 180, column: 21, scope: !1065)
!1133 = !DILocation(line: 979, column: 26, scope: !1131, inlinedAt: !1132)
!1134 = !DILocation(line: 979, column: 18, scope: !1131, inlinedAt: !1132)
!1135 = !DILocation(line: 979, column: 68, scope: !1131, inlinedAt: !1132)
!1136 = !DILocation(line: 979, column: 9, scope: !1131, inlinedAt: !1132)
!1137 = !DILocalVariable(name: "dist_freqs", scope: !1065, file: !2, line: 181, type: !756, align: 64)
!1138 = !DILocation(line: 181, column: 9, scope: !1065)
!1139 = !DILocation(line: 979, column: 41, scope: !1140, inlinedAt: !1141)
!1140 = distinct !DISubprogram(name: "temp_array", linkageName: "temp_array", scope: !770, file: !770, line: 977, scopeLine: 977, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1141 = !DILocation(line: 181, column: 22, scope: !1065)
!1142 = !DILocation(line: 979, column: 26, scope: !1140, inlinedAt: !1141)
!1143 = !DILocation(line: 979, column: 18, scope: !1140, inlinedAt: !1141)
!1144 = !DILocation(line: 979, column: 68, scope: !1140, inlinedAt: !1141)
!1145 = !DILocation(line: 979, column: 9, scope: !1140, inlinedAt: !1141)
!1146 = !DILocalVariable(name: "tokens", scope: !1065, file: !2, line: 182, type: !1147, align: 64)
!1147 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token[]", size: 128, align: 64, elements: !1148, identifier: "Token[]")
!1148 = !{!1149, !1155}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1147, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64, dwarfAddressSpace: 0)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "Token", scope: !2, file: !2, line: 662, size: 32, align: 16, elements: !1152, identifier: "std.compression.deflate.Token")
!1152 = !{!1153, !1154}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1151, file: !2, line: 664, baseType: !7, size: 16, align: 16)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1151, file: !2, line: 665, baseType: !7, size: 16, align: 16, offset: 16)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1147, baseType: !96, size: 64, align: 64, offset: 64)
!1156 = !DILocation(line: 182, column: 10, scope: !1065)
!1157 = !DILocation(line: 182, column: 42, scope: !1065)
!1158 = !DILocation(line: 182, column: 55, scope: !1065)
!1159 = !DILocation(line: 304, column: 55, scope: !1160, inlinedAt: !1161)
!1160 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !422, file: !422, line: 302, scopeLine: 302, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1161 = !DILocation(line: 287, column: 9, scope: !1162, inlinedAt: !1163)
!1162 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !422, file: !422, line: 285, scopeLine: 285, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1163 = !DILocation(line: 182, column: 19, scope: !1065)
!1164 = !DILocation(line: 304, column: 40, scope: !1160, inlinedAt: !1161)
!1165 = !DILocation(line: 80, column: 6, scope: !1166, inlinedAt: !1167)
!1166 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !422, file: !422, line: 78, scopeLine: 78, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1167 = !DILocation(line: 304, column: 18, scope: !1160, inlinedAt: !1161)
!1168 = !DILocation(line: 80, column: 20, scope: !1166, inlinedAt: !1167)
!1169 = !DILocation(line: 86, column: 28, scope: !1166, inlinedAt: !1167)
!1170 = !DILocation(line: 38, column: 12, scope: !1166, inlinedAt: !1167)
!1171 = !DILocation(line: 1039, column: 9, scope: !1172, inlinedAt: !1173)
!1172 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !205, file: !205, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !69)
!1173 = !DILocation(line: 38, column: 26, scope: !1166, inlinedAt: !1167)
!1174 = !DILocation(line: 1039, column: 20, scope: !1172, inlinedAt: !1173)
!1175 = !DILocation(line: 1039, column: 25, scope: !1172, inlinedAt: !1173)
!1176 = !DILocation(line: 1039, column: 19, scope: !1172, inlinedAt: !1173)
!1177 = !DILocation(line: 86, column: 10, scope: !1166, inlinedAt: !1167)
!1178 = !DILocation(line: 304, column: 67, scope: !1160, inlinedAt: !1161)
!1179 = !DILocation(line: 304, column: 9, scope: !1160, inlinedAt: !1161)
!1180 = !DILocalVariable(name: "token_count", scope: !1065, file: !2, line: 183, type: !96, align: 64)
!1181 = !DILocation(line: 183, column: 6, scope: !1065)
!1182 = !DILocation(line: 183, column: 20, scope: !1065)
!1183 = !DILocalVariable(name: "hash", scope: !1065, file: !2, line: 185, type: !36, align: 32)
!1184 = !DILocation(line: 185, column: 7, scope: !1065)
!1185 = !DILocation(line: 185, column: 14, scope: !1065)
!1186 = !DILocation(line: 186, column: 6, scope: !1065)
!1187 = !DILocation(line: 188, column: 17, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1065, file: !2, line: 187, column: 2)
!1189 = !DILocation(line: 188, column: 23, scope: !1188)
!1190 = !DILocation(line: 188, column: 11, scope: !1188)
!1191 = !DILocation(line: 188, column: 40, scope: !1188)
!1192 = !DILocation(line: 188, column: 46, scope: !1188)
!1193 = !DILocation(line: 188, column: 10, scope: !1188)
!1194 = !DILocalVariable(name: "pos", scope: !1065, file: !2, line: 191, type: !96, align: 64)
!1195 = !DILocation(line: 191, column: 6, scope: !1065)
!1196 = !DILocation(line: 191, column: 12, scope: !1065)
!1197 = !DILocation(line: 192, column: 2, scope: !1065)
