; ModuleID = 'std::os::backtrace'
source_filename = "std::os::backtrace"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }

@"$ct.std.os.backtrace.Backtrace" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 88, i64 0, i64 7, [0 x i64] zeroinitializer }, align 8
@.emptystr = internal constant [1 x i8] zeroinitializer, align 1
@"$ct.void" = linkonce global %.introspect { i8 0, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@std.os.backtrace.BACKTRACE_UNKNOWN = weak local_unnamed_addr constant %Backtrace { i64 0, %"char[]" { ptr @.emptystr, i64 0 }, %"char[]" { ptr @.emptystr, i64 0 }, %"char[]" { ptr @.emptystr, i64 0 }, i32 0, %any { ptr null, i64 ptrtoint (ptr @"$ct.void" to i64) }, i8 0 }, align 8, !dbg !0
@"$ct.long" = linkonce global %.introspect { i8 2, i64 0, ptr null, i64 8, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@.panic_msg = internal constant [62 x i8] c"Index exceeds array length (array had size %d, index was %d).\00", align 1
@.file = internal constant [13 x i8] c"backtrace.c3\00", align 1
@.func = internal constant [16 x i8] c"capture_current\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BACKTRACE_UNKNOWN", linkageName: "std.os.backtrace.BACKTRACE_UNKNOWN", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 64)
!2 = !DIFile(filename: "backtrace.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/os")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 9, size: 704, align: 64, elements: !4, identifier: "std.os.backtrace.Backtrace")
!4 = !{!5, !8, !17, !18, !19, !21, !28}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3, file: !2, line: 11, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !7)
!7 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !3, file: !2, line: 12, baseType: !9, size: 128, align: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !10)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !11, identifier: "char[]")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !10, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !10, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !7)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !3, file: !2, line: 13, baseType: !9, size: 128, align: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !3, file: !2, line: 14, baseType: !9, size: 128, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !3, file: !2, line: 15, baseType: !20, size: 32, align: 32, offset: 448)
!20 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 16, baseType: !22, size: 128, align: 64, offset: 512)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !23, identifier: "Allocator")
!23 = !{!24, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !3, file: !2, line: 17, baseType: !29, size: 8, align: 8, offset: 640)
!29 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!30 = !{i32 2, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 2, !"wchar_size", i32 4}
!33 = !{i32 4, !"PIC Level", i32 2}
!34 = !{i32 1, !"uwtable", i32 1}
!35 = !{i32 2, !"frame-pointer", i32 1}
!36 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !37, splitDebugInlining: false)
!37 = !{!0}
!38 = distinct !DISubprogram(name: "has_file", linkageName: "std.os.backtrace.Backtrace.has_file", scope: !2, file: !2, line: 21, type: !39, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!39 = !DISubroutineType(types: !40)
!40 = !{!29, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !{}
!43 = !DILocation(line: 22, column: 1, scope: !38)
!44 = !DILocalVariable(name: "self", arg: 1, scope: !38, file: !2, line: 21, type: !41)
!45 = !DILocation(line: 21, column: 28, scope: !38)
!46 = !DILocation(line: 23, column: 9, scope: !38)
!47 = distinct !DISubprogram(name: "is_unknown", linkageName: "std.os.backtrace.Backtrace.is_unknown", scope: !2, file: !2, line: 26, type: !39, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!48 = !DILocation(line: 27, column: 1, scope: !47)
!49 = !DILocalVariable(name: "self", arg: 1, scope: !47, file: !2, line: 26, type: !41)
!50 = !DILocation(line: 26, column: 30, scope: !47)
!51 = !DILocation(line: 28, column: 10, scope: !47)
!52 = distinct !DISubprogram(name: "to_format", linkageName: "std.os.backtrace.Backtrace.to_format", scope: !2, file: !2, line: 31, type: !53, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!53 = !DISubroutineType(types: !54)
!54 = !{!7, !41, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64, dwarfAddressSpace: 0)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 65, size: 320, align: 64, elements: !57, identifier: "std.io.Formatter")
!57 = !{!58, !59, !64}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !2, line: 67, baseType: !25, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !56, file: !2, line: 68, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 18, baseType: !61, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !25, !14}
!64 = !DIDerivedType(tag: DW_TAG_member, scope: !56, file: !2, line: 69, baseType: !65, size: 192, align: 64, offset: 128)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter.$anon", scope: !56, file: !2, line: 69, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !2, line: 71, baseType: !20, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !65, file: !2, line: 72, baseType: !20, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !65, file: !2, line: 73, baseType: !20, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !65, file: !2, line: 74, baseType: !71, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault", baseType: !72)
!72 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!73 = !DILocation(line: 32, column: 1, scope: !52)
!74 = !DILocalVariable(name: "self", arg: 1, scope: !52, file: !2, line: 31, type: !41)
!75 = !DILocation(line: 31, column: 29, scope: !52)
!76 = !DILocalVariable(name: "formatter", arg: 2, scope: !52, file: !2, line: 31, type: !55)
!77 = !DILocation(line: 31, column: 47, scope: !52)
!78 = !DILocalVariable(name: "inline_suffix", scope: !52, file: !2, line: 33, type: !9, align: 64)
!79 = !DILocation(line: 33, column: 9, scope: !52)
!80 = !DILocation(line: 33, column: 25, scope: !52)
!81 = !DILocation(line: 33, column: 56, scope: !52)
!82 = !DILocation(line: 34, column: 6, scope: !52)
!83 = !DILocation(line: 36, column: 51, scope: !84)
!84 = distinct !DILexicalBlock(scope: !52, file: !2, line: 35, column: 2)
!85 = !DILocation(line: 36, column: 66, scope: !84)
!86 = !DILocation(line: 36, column: 84, scope: !84)
!87 = !DILocation(line: 36, column: 95, scope: !84)
!88 = !DILocation(line: 36, column: 106, scope: !84)
!89 = !DILocation(line: 36, column: 10, scope: !84)
!90 = !DILocation(line: 38, column: 6, scope: !52)
!91 = !DILocation(line: 40, column: 49, scope: !92)
!92 = distinct !DILexicalBlock(scope: !52, file: !2, line: 39, column: 2)
!93 = !DILocation(line: 40, column: 10, scope: !92)
!94 = !DILocation(line: 42, column: 63, scope: !52)
!95 = !DILocation(line: 42, column: 78, scope: !52)
!96 = !DILocation(line: 42, column: 96, scope: !52)
!97 = !DILocation(line: 42, column: 9, scope: !52)
!98 = distinct !DISubprogram(name: "free", linkageName: "std.os.backtrace.Backtrace.free", scope: !2, file: !2, line: 44, type: !99, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !41}
!101 = !DILocation(line: 45, column: 1, scope: !98)
!102 = !DILocalVariable(name: "self", arg: 1, scope: !98, file: !2, line: 44, type: !41)
!103 = !DILocation(line: 44, column: 24, scope: !98)
!104 = !DILocation(line: 46, column: 7, scope: !98)
!105 = !DILocation(line: 46, column: 29, scope: !98)
!106 = !DILocation(line: 47, column: 18, scope: !98)
!107 = !DILocation(line: 47, column: 34, scope: !98)
!108 = !DILocation(line: 119, column: 6, scope: !109, inlinedAt: !111)
!109 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !110, file: !110, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!110 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!111 = !DILocation(line: 47, column: 2, scope: !98)
!112 = !DILocation(line: 119, column: 18, scope: !109, inlinedAt: !111)
!113 = !DILocation(line: 123, column: 20, scope: !109, inlinedAt: !111)
!114 = !DILocation(line: 123, column: 2, scope: !109, inlinedAt: !111)
!115 = !DILocation(line: 48, column: 18, scope: !98)
!116 = !DILocation(line: 48, column: 34, scope: !98)
!117 = !DILocation(line: 119, column: 6, scope: !118, inlinedAt: !119)
!118 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !110, file: !110, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!119 = !DILocation(line: 48, column: 2, scope: !98)
!120 = !DILocation(line: 119, column: 18, scope: !118, inlinedAt: !119)
!121 = !DILocation(line: 123, column: 20, scope: !118, inlinedAt: !119)
!122 = !DILocation(line: 123, column: 2, scope: !118, inlinedAt: !119)
!123 = !DILocation(line: 49, column: 18, scope: !98)
!124 = !DILocation(line: 49, column: 34, scope: !98)
!125 = !DILocation(line: 119, column: 6, scope: !126, inlinedAt: !127)
!126 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !110, file: !110, line: 117, scopeLine: 117, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!127 = !DILocation(line: 49, column: 2, scope: !98)
!128 = !DILocation(line: 119, column: 18, scope: !126, inlinedAt: !127)
!129 = !DILocation(line: 123, column: 20, scope: !126, inlinedAt: !127)
!130 = !DILocation(line: 123, column: 2, scope: !126, inlinedAt: !127)
!131 = distinct !DISubprogram(name: "init", linkageName: "std.os.backtrace.Backtrace.init", scope: !2, file: !2, line: 52, type: !132, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!132 = !DISubroutineType(types: !133)
!133 = !{!41, !41, !22, !7, !9, !9, !9, !20}
!134 = !DILocation(line: 53, column: 1, scope: !131)
!135 = !DILocalVariable(name: "self", arg: 1, scope: !131, file: !2, line: 52, type: !41)
!136 = !DILocation(line: 52, column: 30, scope: !131)
!137 = !DILocalVariable(name: "allocator", arg: 2, scope: !131, file: !2, line: 52, type: !22)
!138 = !DILocation(line: 52, column: 47, scope: !131)
!139 = !DILocalVariable(name: "offset", arg: 3, scope: !131, file: !2, line: 52, type: !6)
!140 = !DILocation(line: 52, column: 63, scope: !131)
!141 = !DILocalVariable(name: "function", arg: 4, scope: !131, file: !2, line: 52, type: !9)
!142 = !DILocation(line: 52, column: 78, scope: !131)
!143 = !DILocalVariable(name: "object_file", arg: 5, scope: !131, file: !2, line: 52, type: !9)
!144 = !DILocation(line: 52, column: 95, scope: !131)
!145 = !DILocalVariable(name: "file", arg: 6, scope: !131, file: !2, line: 52, type: !9)
!146 = !DILocation(line: 52, column: 115, scope: !131)
!147 = !DILocalVariable(name: "line", arg: 7, scope: !131, file: !2, line: 52, type: !20)
!148 = !DILocation(line: 52, column: 131, scope: !131)
!149 = !DILocation(line: 54, column: 6, scope: !131)
!150 = !DILocation(line: 56, column: 3, scope: !151)
!151 = distinct !DILexicalBlock(scope: !131, file: !2, line: 55, column: 2)
!152 = !DILocation(line: 57, column: 3, scope: !151)
!153 = !DILocation(line: 58, column: 3, scope: !151)
!154 = !DILocation(line: 59, column: 3, scope: !151)
!155 = !DILocation(line: 60, column: 3, scope: !151)
!156 = !DILocation(line: 61, column: 3, scope: !151)
!157 = !DILocation(line: 62, column: 10, scope: !151)
!158 = !DILocation(line: 64, column: 2, scope: !131)
!159 = !DILocation(line: 65, column: 32, scope: !131)
!160 = !DILocation(line: 65, column: 18, scope: !131)
!161 = !DILocation(line: 65, column: 2, scope: !131)
!162 = !DILocation(line: 66, column: 38, scope: !131)
!163 = !DILocation(line: 66, column: 21, scope: !131)
!164 = !DILocation(line: 66, column: 2, scope: !131)
!165 = !DILocation(line: 67, column: 24, scope: !131)
!166 = !DILocation(line: 67, column: 14, scope: !131)
!167 = !DILocation(line: 67, column: 2, scope: !131)
!168 = !DILocation(line: 68, column: 2, scope: !131)
!169 = !DILocation(line: 69, column: 2, scope: !131)
!170 = !DILocation(line: 70, column: 9, scope: !131)
!171 = distinct !DISubprogram(name: "capture_current", linkageName: "std.os.backtrace.capture_current", scope: !2, file: !2, line: 73, type: !172, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !174}
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !175, identifier: "void*[]")
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !174, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !174, baseType: !16, size: 64, align: 64, offset: 64)
!179 = !DILocalVariable(name: "buffer", arg: 1, scope: !171, file: !2, line: 73, type: !174)
!180 = !DILocation(line: 73, column: 36, scope: !171)
!181 = !DILocation(line: 75, column: 6, scope: !171)
!182 = !DILocation(line: 75, column: 26, scope: !171)
!183 = !DILocalVariable(name: "len", scope: !171, file: !2, line: 78, type: !184, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 23, baseType: !185, align: 32)
!185 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!186 = !DILocation(line: 78, column: 9, scope: !171)
!187 = !DILocation(line: 78, column: 44, scope: !171)
!188 = !DILocation(line: 78, column: 15, scope: !171)
!189 = !DILocation(line: 79, column: 11, scope: !171)
!190 = !DILocation(line: 79, column: 18, scope: !171)
!191 = !DILocation(line: 79, column: 19, scope: !171)
