; ModuleID = 'std::encoding::json'
source_filename = "std::encoding::json"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%ByteReader = type { %"char[]", i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%JsonContext = type { i32, %any, %any, i32, ptr, double, i8, i32, i8 }
%"any[]" = type { ptr, i64 }

@"$ct.std.encoding.json.JsonContext.12806" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 80, i64 0, i64 9, [0 x i64] zeroinitializer }, align 8
@.enum.NO_TOKEN = internal constant [9 x i8] c"NO_TOKEN\00", align 1
@.enum.LBRACE = internal constant [7 x i8] c"LBRACE\00", align 1
@.enum.LBRACKET = internal constant [9 x i8] c"LBRACKET\00", align 1
@.enum.COMMA = internal constant [6 x i8] c"COMMA\00", align 1
@.enum.COLON = internal constant [6 x i8] c"COLON\00", align 1
@.enum.RBRACE = internal constant [7 x i8] c"RBRACE\00", align 1
@.enum.RBRACKET = internal constant [9 x i8] c"RBRACKET\00", align 1
@.enum.STRING = internal constant [7 x i8] c"STRING\00", align 1
@.enum.NUMBER = internal constant [7 x i8] c"NUMBER\00", align 1
@.enum.TRUE = internal constant [5 x i8] c"TRUE\00", align 1
@.enum.FALSE = internal constant [6 x i8] c"FALSE\00", align 1
@.enum.NULL = internal constant [5 x i8] c"NULL\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "max_depth", linkageName: "std.encoding.json.max_depth", scope: !2, file: !2, line: 10, type: !3, isLocal: false, isDefinition: true, align: 32)
!2 = !DIFile(filename: "json.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/encoding")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !{i32 2, !"Dwarf Version", i32 4}
!5 = !{i32 2, !"Debug Info Version", i32 3}
!6 = !{i32 2, !"wchar_size", i32 4}
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 1, !"uwtable", i32 1}
!9 = !{i32 2, !"frame-pointer", i32 1}
!10 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !54, splitDebugInlining: false)
!11 = !{!12}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "JsonTokenType", scope: !13, file: !2, line: 41, baseType: !3, size: 32, align: 32, elements: !40)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "JsonContext", scope: !2, file: !2, line: 58, size: 640, align: 64, elements: !14, identifier: "std.encoding.json.JsonContext.12806")
!14 = !{!15, !17, !24, !29, !30, !34, !36, !38, !39}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !13, file: !2, line: 60, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !13, file: !2, line: 61, baseType: !18, size: 128, align: 64, offset: 64)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !19, identifier: "InStream")
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !18, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !18, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !13, file: !2, line: 62, baseType: !25, size: 128, align: 64, offset: 192)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !26, identifier: "Allocator")
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !25, baseType: !21, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, baseType: !23, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !13, file: !2, line: 63, baseType: !12, size: 32, align: 32, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "last_string", scope: !13, file: !2, line: 64, baseType: !31, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 7, baseType: !32, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 8, baseType: null, align: 8)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "last_number", scope: !13, file: !2, line: 65, baseType: !35, size: 64, align: 64, offset: 448)
!35 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !13, file: !2, line: 66, baseType: !37, size: 8, align: 8, offset: 512)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !13, file: !2, line: 67, baseType: !3, size: 32, align: 32, offset: 544)
!39 = !DIDerivedType(tag: DW_TAG_member, scope: !13, file: !2, line: 68, baseType: !37, size: 8, align: 8, offset: 576)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!41 = !DIEnumerator(name: "NO_TOKEN", value: 0)
!42 = !DIEnumerator(name: "LBRACE", value: 1)
!43 = !DIEnumerator(name: "LBRACKET", value: 2)
!44 = !DIEnumerator(name: "COMMA", value: 3)
!45 = !DIEnumerator(name: "COLON", value: 4)
!46 = !DIEnumerator(name: "RBRACE", value: 5)
!47 = !DIEnumerator(name: "RBRACKET", value: 6)
!48 = !DIEnumerator(name: "STRING", value: 7)
!49 = !DIEnumerator(name: "NUMBER", value: 8)
!50 = !DIEnumerator(name: "TRUE", value: 9)
!51 = !DIEnumerator(name: "FALSE", value: 10)
!52 = !DIEnumerator(name: "NULL", value: 11)
!53 = !DIEnumerator(name: "EOF", value: 12)
!54 = !{!0}
!55 = distinct !DISubprogram(name: "parse_string", linkageName: "std.encoding.json.parse_string", scope: !2, file: !2, line: 12, type: !56, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !112)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !25, !72}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !2, file: !2, line: 11, size: 640, align: 128, elements: !60, identifier: "std.collections.object.Object")
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !2, line: 13, baseType: !23, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !59, file: !2, line: 14, baseType: !25, size: 128, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, scope: !59, file: !2, line: 15, baseType: !64, size: 384, align: 128, offset: 256)
!64 = !DICompositeType(tag: DW_TAG_union_type, scope: !59, file: !2, line: 15, size: 384, align: 128, elements: !65)
!65 = !{!66, !68, !69, !71, !80, !81, !90}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !64, file: !2, line: 17, baseType: !67, size: 128, align: 128)
!67 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !64, file: !2, line: 18, baseType: !35, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !64, file: !2, line: 19, baseType: !70, size: 8, align: 8)
!70 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !64, file: !2, line: 20, baseType: !72, size: 128, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !74, identifier: "char[]")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !73, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !79)
!79 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !64, file: !2, line: 21, baseType: !21, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !64, file: !2, line: 22, baseType: !82, size: 320, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !2, file: !2, line: 465, baseType: !83, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "List{Object*}", scope: !2, file: !2, line: 18, size: 320, align: 64, elements: !84, identifier: "std.collections.list.List$p$std.collections.object.Object$")
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !2, line: 20, baseType: !78, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !83, file: !2, line: 21, baseType: !78, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !83, file: !2, line: 22, baseType: !25, size: 128, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !83, file: !2, line: 23, baseType: !89, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !64, file: !2, line: 23, baseType: !91, size: 384, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !2, file: !2, line: 464, baseType: !92, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap{String, Object*}", scope: !2, file: !2, line: 29, size: 384, align: 64, elements: !93, identifier: "std.collections.map.HashMap$String$p$std.collections.object.Object$")
!93 = !{!94, !107, !108, !109, !110}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !92, file: !2, line: 31, baseType: !95, size: 128, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{String, Object*}*[]", size: 128, align: 64, elements: !96, identifier: "Entry{String, Object*}*[]")
!96 = !{!97, !106}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !95, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry{String, Object*}", scope: !2, file: !2, line: 21, size: 320, align: 64, elements: !101, identifier: "std.collections.map.Entry$String$p$std.collections.object.Object$")
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !100, file: !2, line: 23, baseType: !16, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !100, file: !2, line: 24, baseType: !72, size: 128, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !2, line: 25, baseType: !58, size: 64, align: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !2, line: 26, baseType: !99, size: 64, align: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !95, baseType: !78, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !92, file: !2, line: 32, baseType: !25, size: 128, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !92, file: !2, line: 34, baseType: !16, size: 32, align: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !92, file: !2, line: 36, baseType: !16, size: 32, align: 32, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !92, file: !2, line: 37, baseType: !111, size: 32, align: 32, offset: 320)
!111 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!112 = !{}
!113 = !DILocalVariable(name: "allocator", arg: 1, scope: !55, file: !2, line: 12, type: !25)
!114 = !DILocation(line: 12, column: 36, scope: !55)
!115 = !DILocalVariable(name: "s", arg: 2, scope: !55, file: !2, line: 12, type: !72)
!116 = !DILocation(line: 12, column: 54, scope: !55)
!117 = !DILocation(line: 14, column: 46, scope: !55)
!118 = !DILocation(line: 14, column: 26, scope: !55)
!119 = !DILocation(line: 14, column: 9, scope: !55)
!120 = distinct !DISubprogram(name: "tparse_string", linkageName: "std.encoding.json.tparse_string", scope: !2, file: !2, line: 17, type: !121, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !112)
!121 = !DISubroutineType(types: !122)
!122 = !{!58, !72}
!123 = !DILocalVariable(name: "s", arg: 1, scope: !120, file: !2, line: 17, type: !72)
!124 = !DILocation(line: 17, column: 34, scope: !120)
!125 = !DILocation(line: 19, column: 15, scope: !120)
!126 = !DILocation(line: 19, column: 41, scope: !120)
!127 = !DILocation(line: 19, column: 21, scope: !120)
!128 = !DILocation(line: 19, column: 9, scope: !120)
!129 = distinct !DISubprogram(name: "parse", linkageName: "std.encoding.json.parse", scope: !2, file: !2, line: 22, type: !130, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !112)
!130 = !DISubroutineType(types: !131)
!131 = !{!58, !25, !18}
!132 = !DILocalVariable(name: "allocator", arg: 1, scope: !129, file: !2, line: 22, type: !25)
!133 = !DILocation(line: 22, column: 29, scope: !129)
!134 = !DILocalVariable(name: "s", arg: 2, scope: !129, file: !2, line: 22, type: !18)
!135 = !DILocation(line: 22, column: 49, scope: !129)
!136 = !DILocalVariable(name: "buffer", scope: !137, file: !2, line: 610, type: !139, align: 8)
!137 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !138, file: !138, line: 608, scopeLine: 608, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !112)
!138 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 4096, align: 8, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 512, lowerBound: 0)
!142 = !DILocation(line: 610, column: 14, scope: !137, inlinedAt: !143)
!143 = !DILocation(line: 24, column: 2, scope: !129)
!144 = !DILocalVariable(name: "allocator", scope: !137, file: !2, line: 611, type: !145, align: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 12, size: 384, align: 64, elements: !146, identifier: "std.core.mem.allocator.OnStackAllocator")
!146 = !{!147, !148, !149, !150}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !145, file: !2, line: 14, baseType: !25, size: 128, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !145, file: !2, line: 15, baseType: !73, size: 128, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !145, file: !2, line: 16, baseType: !78, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !145, file: !2, line: 17, baseType: !151, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64, dwarfAddressSpace: 0)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !153, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk.7818")
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !152, file: !2, line: 22, baseType: !70, size: 8, align: 8)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !2, line: 23, baseType: !151, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !2, line: 24, baseType: !21, size: 64, align: 64, offset: 128)
!157 = !DILocation(line: 611, column: 19, scope: !137, inlinedAt: !143)
!158 = !DILocation(line: 612, column: 18, scope: !137, inlinedAt: !143)
!159 = !DILocation(line: 612, column: 26, scope: !137, inlinedAt: !143)
!160 = !DILocation(line: 612, column: 2, scope: !137, inlinedAt: !143)
!161 = !DILocalVariable(name: "smem", scope: !129, file: !2, line: 24, type: !25, align: 64)
!162 = !DILocation(line: 24, column: 28, scope: !129)
!163 = !DILocation(line: 614, column: 8, scope: !164, inlinedAt: !143)
!164 = distinct !DILexicalBlock(scope: !137, file: !138, line: 614, column: 2)
!165 = !DILocalVariable(name: "context", scope: !166, file: !2, line: 26, type: !13, align: 64)
!166 = distinct !DILexicalBlock(scope: !129, file: !2, line: 25, column: 2)
!167 = !DILocation(line: 26, column: 15, scope: !166)
!168 = !DILocation(line: 26, column: 75, scope: !166)
!169 = !DILocation(line: 26, column: 42, scope: !166)
!170 = !DILocation(line: 26, column: 90, scope: !166)
!171 = !DILocation(line: 26, column: 106, scope: !166)
!172 = !DILocalVariable(name: "state", scope: !173, file: !2, line: 679, type: !174, align: 64)
!173 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !138, file: !138, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !112)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !2, file: !2, line: 496, baseType: !175, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64, dwarfAddressSpace: 0)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 31, size: 704, align: 64, elements: !177, identifier: "std.core.mem.allocator.TempAllocator")
!177 = !{!178, !179, !191, !192, !193, !194, !195, !196, !197, !198, !199}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !176, file: !2, line: 33, baseType: !25, size: 128, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !176, file: !2, line: 34, baseType: !180, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64, dwarfAddressSpace: 0)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 54, size: 256, align: 64, elements: !182, identifier: "std.core.mem.allocator.TempAllocatorPage")
!182 = !{!183, !184, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !181, file: !2, line: 56, baseType: !180, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !181, file: !2, line: 57, baseType: !21, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !181, file: !2, line: 58, baseType: !78, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !181, file: !2, line: 59, baseType: !78, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !2, line: 60, baseType: !188, align: 8, offset: 256)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, align: 8, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 0, lowerBound: 0)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !176, file: !2, line: 35, baseType: !175, size: 64, align: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !176, file: !2, line: 36, baseType: !70, size: 8, align: 8, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !176, file: !2, line: 37, baseType: !78, size: 64, align: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !176, file: !2, line: 38, baseType: !78, size: 64, align: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !176, file: !2, line: 39, baseType: !78, size: 64, align: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !176, file: !2, line: 40, baseType: !78, size: 64, align: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !176, file: !2, line: 41, baseType: !78, size: 64, align: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !176, file: !2, line: 42, baseType: !78, size: 64, align: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !176, file: !2, line: 43, baseType: !188, align: 8, offset: 704)
!200 = !DILocation(line: 679, column: 12, scope: !173, inlinedAt: !201)
!201 = !DILocation(line: 27, column: 3, scope: !166)
!202 = !DILocation(line: 679, column: 41, scope: !173, inlinedAt: !201)
!203 = !DILocation(line: 679, column: 20, scope: !173, inlinedAt: !201)
!204 = !DILocation(line: 29, column: 11, scope: !205)
!205 = distinct !DILexicalBlock(scope: !166, file: !2, line: 28, column: 3)
!206 = !DILocation(line: 682, column: 23, scope: !207, inlinedAt: !201)
!207 = distinct !DILexicalBlock(scope: !173, file: !138, line: 681, column: 2)
!208 = !DILocation(line: 682, column: 3, scope: !207, inlinedAt: !201)
!209 = !DILocation(line: 613, column: 8, scope: !210, inlinedAt: !143)
!210 = distinct !DILexicalBlock(scope: !137, file: !138, line: 613, column: 8)
!211 = !DILocation(line: 682, column: 23, scope: !212, inlinedAt: !201)
!212 = distinct !DILexicalBlock(scope: !173, file: !138, line: 681, column: 2)
!213 = !DILocation(line: 682, column: 3, scope: !212, inlinedAt: !201)
!214 = !DILocation(line: 613, column: 8, scope: !215, inlinedAt: !143)
!215 = distinct !DILexicalBlock(scope: !137, file: !138, line: 613, column: 8)
!216 = distinct !DISubprogram(name: "tparse", linkageName: "std.encoding.json.tparse", scope: !2, file: !2, line: 34, type: !217, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !112)
!217 = !DISubroutineType(types: !218)
!218 = !{!58, !18}
!219 = !DILocalVariable(name: "s", arg: 1, scope: !216, file: !2, line: 34, type: !18)
!220 = !DILocation(line: 34, column: 29, scope: !216)
!221 = !DILocation(line: 36, column: 15, scope: !216)
!222 = !DILocation(line: 36, column: 9, scope: !216)
!223 = distinct !DISubprogram(name: "parse_from_token", linkageName: "std.encoding.json.parse_from_token.12819", scope: !2, file: !2, line: 78, type: !224, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !112)
!224 = !DISubroutineType(types: !225)
!225 = !{!58, !226, !12}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!227 = !DILocalVariable(name: "context", arg: 1, scope: !223, file: !2, line: 78, type: !226)
!228 = !DILocation(line: 78, column: 43, scope: !223)
!229 = !DILocalVariable(name: "token", arg: 2, scope: !223, file: !2, line: 78, type: !12)
!230 = !DILocation(line: 78, column: 66, scope: !223)
!231 = !DILocation(line: 286, column: 33, scope: !232, inlinedAt: !234)
!232 = distinct !DISubprogram(name: "unreachable", linkageName: "unreachable", scope: !233, file: !233, line: 283, scopeLine: 283, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!233 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!234 = !DILocation(line: 82, column: 18, scope: !235)
!235 = distinct !DILexicalBlock(scope: !236, file: !2, line: 82, column: 18)
!236 = distinct !DILexicalBlock(scope: !223, file: !2, line: 80, column: 2)
!237 = !DILocation(line: 286, column: 2, scope: !232, inlinedAt: !234)
!238 = !DILocation(line: 83, column: 23, scope: !239)
!239 = distinct !DILexicalBlock(scope: !236, file: !2, line: 83, column: 16)
!240 = !DILocation(line: 84, column: 25, scope: !241)
!241 = distinct !DILexicalBlock(scope: !236, file: !2, line: 84, column: 18)
!242 = !DILocation(line: 88, column: 22, scope: !243)
!243 = distinct !DILexicalBlock(scope: !236, file: !2, line: 88, column: 15)
!244 = !DILocation(line: 89, column: 42, scope: !245)
!245 = distinct !DILexicalBlock(scope: !236, file: !2, line: 89, column: 16)
!246 = !DILocation(line: 89, column: 74, scope: !245)
!247 = !DILocation(line: 89, column: 23, scope: !245)
!248 = !DILocation(line: 90, column: 41, scope: !249)
!249 = distinct !DILexicalBlock(scope: !236, file: !2, line: 90, column: 16)
!250 = !DILocation(line: 90, column: 62, scope: !249)
