; ModuleID = 'std::core::mem::mempool'
source_filename = "std::core::mem::mempool"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

@"$ct.std.core.mem.mempool.FixedBlockPoolNode" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 3, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.mem.mempool.FixedBlockPoolEntry" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 8, i64 0, i64 1, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.mem.mempool.FixedBlockPool" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 120, i64 0, i64 12, [0 x i64] zeroinitializer }, align 8
@std.core.mem.mempool.INITIAL_CAPACITY = weak local_unnamed_addr constant i32 0, align 4, !dbg !0
@.panic_msg = internal constant [76 x i8] c"@require \22self.initialized\22 violated: 'The block pool must be initialized'.\00", align 1
@.file = internal constant [15 x i8] c"mem_mempool.c3\00", align 1
@.func = internal constant [25 x i8] c"fixedblockpool_check_ptr\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@.panic_msg.1 = internal constant [77 x i8] c"@require \22self.grow_capacity > 0\22 violated: 'How many blocks will it store'.\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "INITIAL_CAPACITY", linkageName: "std.core.mem.mempool.INITIAL_CAPACITY", scope: !2, file: !2, line: 5, type: !3, isLocal: false, isDefinition: true, align: 32)
!2 = !DIFile(filename: "mem_mempool.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !{i32 2, !"Dwarf Version", i32 4}
!5 = !{i32 2, !"Debug Info Version", i32 3}
!6 = !{i32 2, !"wchar_size", i32 4}
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 1, !"uwtable", i32 1}
!9 = !{i32 2, !"frame-pointer", i32 1}
!10 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !11, splitDebugInlining: false)
!11 = !{!0}
!12 = distinct !DISubprogram(name: "init", linkageName: "std.core.mem.mempool.FixedBlockPool.init", scope: !2, file: !2, line: 57, type: !13, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !45)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !15, !19, !33, !33, !33}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedBlockPool", scope: !2, file: !2, line: 28, size: 960, align: 64, elements: !17, identifier: "std.core.mem.mempool.FixedBlockPool")
!17 = !{!18, !25, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !16, file: !2, line: 30, baseType: !19, size: 128, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !20, identifier: "Allocator")
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !19, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !19, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !16, file: !2, line: 31, baseType: !26, size: 192, align: 64, offset: 128)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedBlockPoolNode", scope: !16, file: !2, line: 7, size: 192, align: 64, elements: !27, identifier: "std.core.mem.mempool.FixedBlockPoolNode")
!27 = !{!28, !29, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !26, file: !2, line: 9, baseType: !22, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !26, file: !2, line: 10, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !26, file: !2, line: 11, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !33)
!33 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !16, file: !2, line: 32, baseType: !30, size: 64, align: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !16, file: !2, line: 33, baseType: !22, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !16, file: !2, line: 34, baseType: !22, size: 64, align: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !16, file: !2, line: 35, baseType: !32, size: 64, align: 64, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "grow_capacity", scope: !16, file: !2, line: 36, baseType: !32, size: 64, align: 64, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !16, file: !2, line: 37, baseType: !32, size: 64, align: 64, offset: 640)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !16, file: !2, line: 38, baseType: !32, size: 64, align: 64, offset: 704)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !16, file: !2, line: 39, baseType: !32, size: 64, align: 64, offset: 768)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !16, file: !2, line: 40, baseType: !32, size: 64, align: 64, offset: 832)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !16, file: !2, line: 41, baseType: !44, size: 8, align: 8, offset: 896)
!44 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!45 = !{}
!46 = !DILocation(line: 58, column: 1, scope: !12)
!47 = !DILocalVariable(name: "self", arg: 1, scope: !12, file: !2, line: 57, type: !15)
!48 = !DILocation(line: 57, column: 40, scope: !12)
!49 = !DILocalVariable(name: "allocator", arg: 2, scope: !12, file: !2, line: 57, type: !19)
!50 = !DILocation(line: 57, column: 57, scope: !12)
!51 = !DILocalVariable(name: "block_size", arg: 3, scope: !12, file: !2, line: 57, type: !32)
!52 = !DILocation(line: 57, column: 72, scope: !12)
!53 = !DILocalVariable(name: "capacity", arg: 4, scope: !12, file: !2, line: 57, type: !32)
!54 = !DILocation(line: 57, column: 88, scope: !12)
!55 = !DILocalVariable(name: "alignment", arg: 5, scope: !12, file: !2, line: 57, type: !32)
!56 = !DILocation(line: 57, column: 121, scope: !12)
!57 = !DILocation(line: 51, column: 11, scope: !58)
!58 = distinct !DILexicalBlock(scope: !12, file: !2, line: 58, column: 1)
!59 = !DILocation(line: 1039, column: 9, scope: !60, inlinedAt: !62)
!60 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !61, file: !61, line: 1037, scopeLine: 1037, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!61 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/math")
!62 = !DILocation(line: 51, column: 25, scope: !58)
!63 = !DILocation(line: 1039, column: 20, scope: !60, inlinedAt: !62)
!64 = !DILocation(line: 1039, column: 25, scope: !60, inlinedAt: !62)
!65 = !DILocation(line: 1039, column: 19, scope: !60, inlinedAt: !62)
!66 = !DILocation(line: 52, column: 12, scope: !58)
!67 = !DILocation(line: 52, column: 11, scope: !58)
!68 = !DILocation(line: 53, column: 11, scope: !58)
!69 = !DILocation(line: 249, column: 6, scope: !70, inlinedAt: !71)
!70 = distinct !DISubprogram(name: "calculate_actual_capacity", linkageName: "calculate_actual_capacity", scope: !2, file: !2, line: 246, scopeLine: 246, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!71 = !DILocation(line: 54, column: 11, scope: !58)
!72 = !DILocation(line: 249, column: 23, scope: !70, inlinedAt: !71)
!73 = !DILocation(line: 250, column: 14, scope: !70, inlinedAt: !71)
!74 = !DILocation(line: 250, column: 42, scope: !70, inlinedAt: !71)
!75 = !DILocation(line: 250, column: 13, scope: !70, inlinedAt: !71)
!76 = !DILocation(line: 251, column: 9, scope: !70, inlinedAt: !71)
!77 = !DILocation(line: 251, column: 21, scope: !70, inlinedAt: !71)
!78 = !DILocation(line: 54, column: 61, scope: !58)
!79 = !DILocation(line: 54, column: 75, scope: !58)
!80 = !DILocation(line: 59, column: 2, scope: !12)
!81 = !DILocation(line: 60, column: 15, scope: !12)
!82 = !DILocation(line: 60, column: 2, scope: !12)
!83 = !DILocation(line: 61, column: 2, scope: !12)
!84 = !DILocation(line: 423, column: 16, scope: !85, inlinedAt: !86)
!85 = distinct !DISubprogram(name: "max", linkageName: "max", scope: !61, file: !61, line: 420, scopeLine: 420, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!86 = !DILocation(line: 62, column: 20, scope: !12)
!87 = !DILocation(line: 423, column: 19, scope: !85, inlinedAt: !86)
!88 = !DILocation(line: 62, column: 2, scope: !12)
!89 = !DILocation(line: 63, column: 49, scope: !12)
!90 = !DILocation(line: 249, column: 6, scope: !91, inlinedAt: !92)
!91 = distinct !DISubprogram(name: "calculate_actual_capacity", linkageName: "calculate_actual_capacity", scope: !2, file: !2, line: 246, scopeLine: 246, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10)
!92 = !DILocation(line: 63, column: 13, scope: !12)
!93 = !DILocation(line: 249, column: 23, scope: !91, inlinedAt: !92)
!94 = !DILocation(line: 250, column: 14, scope: !91, inlinedAt: !92)
!95 = !DILocation(line: 250, column: 42, scope: !91, inlinedAt: !92)
