; ModuleID = 'std::io::file'
source_filename = "std::io::file"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%File = type { ptr }
%FileMmap = type { %File, %VirtualMemory, i64, i64 }
%VirtualMemory = type { ptr, i64, i32 }
%"any[]" = type { ptr, i64 }
%PathImp = type { %"char[]", i32, %any }

@std.core.mem.OUT_OF_MEMORY = linkonce constant %"char[]" { ptr @std.core.mem.OUT_OF_MEMORY.nameof, i64 18 }, align 8
@std.core.mem.OUT_OF_MEMORY.nameof = internal constant [19 x i8] c"mem::OUT_OF_MEMORY\00", align 1
@.panic_msg = internal constant [34 x i8] c"@require \22mode.len > 0\22 violated.\00", align 1
@.file = internal constant [8 x i8] c"file.c3\00", align 1
@.func = internal constant [5 x i8] c"open\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@.panic_msg.1 = internal constant [38 x i8] c"@require \22filename.len > 0\22 violated.\00", align 1
@.func.2 = internal constant [10 x i8] c"open_path\00", align 1
@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@std.io.OVERFLOW = linkonce constant %"char[]" { ptr @std.io.OVERFLOW.nameof, i64 12 }, align 8
@std.io.OVERFLOW.nameof = internal constant [13 x i8] c"io::OVERFLOW\00", align 1

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "file_mmap.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io")
!8 = !{!9, !20, !26, !31}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VirtualMemoryAccess", scope: !7, file: !7, line: 20, baseType: !10, size: 32, align: 32, elements: !11)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19}
!12 = !DIEnumerator(name: "PROTECTED", value: 0)
!13 = !DIEnumerator(name: "READ", value: 1)
!14 = !DIEnumerator(name: "WRITE", value: 2)
!15 = !DIEnumerator(name: "READWRITE", value: 3)
!16 = !DIEnumerator(name: "EXEC", value: 4)
!17 = !DIEnumerator(name: "EXECREAD", value: 5)
!18 = !DIEnumerator(name: "EXECWRITE", value: 6)
!19 = !DIEnumerator(name: "ANY", value: 7)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !21, file: !21, line: 7, baseType: !10, size: 32, align: 32, elements: !22)
!21 = !DIFile(filename: "file.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/io")
!22 = !{!23, !24, !25}
!23 = !DIEnumerator(name: "SET", value: 0)
!24 = !DIEnumerator(name: "CURSOR", value: 1)
!25 = !DIEnumerator(name: "END", value: 2)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SeekOrigin", scope: !21, file: !21, line: 14, baseType: !10, size: 32, align: 32, elements: !27)
!27 = !{!28, !29, !30}
!28 = !DIEnumerator(name: "FROM_START", value: 0)
!29 = !DIEnumerator(name: "FROM_CURSOR", value: 1)
!30 = !DIEnumerator(name: "FROM_END", value: 2)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !32, file: !21, line: 23, baseType: !10, size: 32, align: 32, elements: !52)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !21, file: !21, line: 16, size: 320, align: 64, elements: !33, identifier: "std.io.path.PathImp")
!33 = !{!34, !44, !45}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !32, file: !21, line: 18, baseType: !35, size: 128, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !37, identifier: "char[]")
!37 = !{!38, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !36, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !43)
!43 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !32, file: !21, line: 19, baseType: !31, size: 32, align: 32, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !32, file: !21, line: 20, baseType: !46, size: 128, align: 64, offset: 192)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !47, identifier: "Allocator")
!47 = !{!48, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !46, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!52 = !{!53, !54}
!53 = !DIEnumerator(name: "WIN32", value: 0)
!54 = !DIEnumerator(name: "POSIX", value: 1)
!55 = distinct !DISubprogram(name: "mmap_file", linkageName: "std.io.file.mmap_file", scope: !7, file: !7, line: 44, type: !56, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !61, !43, !43, !9, !73}
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileMmap", scope: !7, file: !7, line: 4, size: 384, align: 64, elements: !59, identifier: "std.io.file.mmap.FileMmap")
!59 = !{!60, !65, !71, !72}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !58, file: !7, line: 6, baseType: !61, size: 64, align: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !7, file: !7, line: 4, size: 64, align: 64, elements: !62, identifier: "std.io.File")
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !61, file: !7, line: 6, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !7, file: !7, line: 362, baseType: !49, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "vm", scope: !58, file: !7, line: 7, baseType: !66, size: 192, align: 64, offset: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "VirtualMemory", scope: !58, file: !7, line: 11, size: 192, align: 64, elements: !67, identifier: "std.core.mem.vm.VirtualMemory")
!67 = !{!68, !69, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !66, file: !7, line: 13, baseType: !49, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !66, file: !7, line: 14, baseType: !42, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "default_access", scope: !66, file: !7, line: 15, baseType: !9, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !58, file: !7, line: 8, baseType: !42, size: 64, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !58, file: !7, line: 9, baseType: !42, size: 64, align: 64, offset: 320)
!73 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!74 = !{}
!75 = !DILocalVariable(name: "file", arg: 1, scope: !55, file: !7, line: 44, type: !61)
!76 = !DILocation(line: 44, column: 29, scope: !55)
!77 = !DILocalVariable(name: "offset", arg: 2, scope: !55, file: !7, line: 44, type: !42)
!78 = !DILocation(line: 44, column: 39, scope: !55)
!79 = !DILocalVariable(name: "len", arg: 3, scope: !55, file: !7, line: 44, type: !42)
!80 = !DILocation(line: 44, column: 55, scope: !55)
!81 = !DILocalVariable(name: "access", arg: 4, scope: !55, file: !7, line: 44, type: !9)
!82 = !DILocation(line: 44, column: 84, scope: !55)
!83 = !DILocalVariable(name: "shared", arg: 5, scope: !55, file: !7, line: 44, type: !73)
!84 = !DILocation(line: 44, column: 104, scope: !55)
!85 = !DILocation(line: 46, column: 6, scope: !55)
!86 = !DILocalVariable(name: "new_len", scope: !87, file: !7, line: 48, type: !43, align: 64)
!87 = distinct !DILexicalBlock(scope: !55, file: !7, line: 47, column: 2)
!88 = !DILocation(line: 48, column: 9, scope: !87)
!89 = !DILocation(line: 48, column: 19, scope: !87)
!90 = !DILocation(line: 48, column: 34, scope: !87)
!91 = !DILocation(line: 49, column: 7, scope: !87)
!92 = !DILocation(line: 49, column: 40, scope: !87)
!93 = !DILocation(line: 50, column: 9, scope: !87)
!94 = !DILocalVariable(name: "page_size", scope: !55, file: !7, line: 54, type: !42, align: 64)
!95 = !DILocation(line: 54, column: 6, scope: !55)
!96 = !DILocation(line: 54, column: 18, scope: !55)
!97 = !DILocalVariable(name: "page_offset", scope: !55, file: !7, line: 57, type: !42, align: 64)
!98 = !DILocation(line: 57, column: 6, scope: !55)
!99 = !DILocation(line: 57, column: 20, scope: !55)
!100 = !DILocation(line: 57, column: 30, scope: !55)
!101 = !DILocalVariable(name: "map_offset", scope: !55, file: !7, line: 58, type: !42, align: 64)
!102 = !DILocation(line: 58, column: 6, scope: !55)
!103 = !DILocation(line: 58, column: 19, scope: !55)
!104 = !DILocation(line: 58, column: 28, scope: !55)
!105 = !DILocalVariable(name: "map_len", scope: !55, file: !7, line: 61, type: !42, align: 64)
!106 = !DILocation(line: 61, column: 6, scope: !55)
!107 = !DILocation(line: 61, column: 16, scope: !55)
!108 = !DILocation(line: 61, column: 22, scope: !55)
!109 = !DILocation(line: 62, column: 35, scope: !55)
!110 = !DILocation(line: 62, column: 12, scope: !55)
!111 = !DILocalVariable(name: "ptr", scope: !55, file: !7, line: 64, type: !49, align: 64)
!112 = !DILocation(line: 64, column: 8, scope: !55)
!113 = !DILocation(line: 64, column: 28, scope: !55)
!114 = !DILocation(line: 64, column: 14, scope: !55)
!115 = !DILocation(line: 67, column: 15, scope: !55)
!116 = !DILocation(line: 67, column: 20, scope: !55)
!117 = !DILocation(line: 67, column: 29, scope: !55)
!118 = !DILocation(line: 67, column: 38, scope: !55)
!119 = !DILocation(line: 67, column: 51, scope: !55)
!120 = distinct !DISubprogram(name: "mmap_open", linkageName: "std.io.file.mmap_open", scope: !7, file: !7, line: 80, type: !121, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!121 = !DISubroutineType(types: !122)
!122 = !{!58, !35, !35, !43, !43, !9, !73}
!123 = !DILocalVariable(name: "filename", arg: 1, scope: !120, file: !7, line: 80, type: !35)
!124 = !DILocation(line: 80, column: 31, scope: !120)
!125 = !DILocalVariable(name: "mode", arg: 2, scope: !120, file: !7, line: 80, type: !35)
!126 = !DILocation(line: 80, column: 48, scope: !120)
!127 = !DILocalVariable(name: "offset", arg: 3, scope: !120, file: !7, line: 80, type: !42)
!128 = !DILocation(line: 80, column: 58, scope: !120)
!129 = !DILocalVariable(name: "len", arg: 4, scope: !120, file: !7, line: 80, type: !42)
!130 = !DILocation(line: 80, column: 74, scope: !120)
!131 = !DILocalVariable(name: "access", arg: 5, scope: !120, file: !7, line: 80, type: !9)
!132 = !DILocation(line: 80, column: 103, scope: !120)
!133 = !DILocalVariable(name: "shared", arg: 6, scope: !120, file: !7, line: 80, type: !73)
!134 = !DILocation(line: 80, column: 123, scope: !120)
!135 = !DILocalVariable(name: "file", scope: !120, file: !7, line: 82, type: !61, align: 64)
!136 = !DILocation(line: 82, column: 7, scope: !120)
!137 = !DILocation(line: 82, column: 14, scope: !120)
!138 = !DILocalVariable(name: "mm", scope: !120, file: !7, line: 84, type: !58, align: 64)
!139 = !DILocation(line: 84, column: 11, scope: !120)
!140 = !DILocation(line: 84, column: 16, scope: !120)
!141 = !DILocation(line: 83, column: 14, scope: !142)
!142 = distinct !DILexicalBlock(scope: !120, file: !7, line: 83, column: 14)
!143 = !DILocation(line: 87, column: 2, scope: !120)
!144 = !DILocation(line: 89, column: 9, scope: !120)
!145 = distinct !DISubprogram(name: "reopen", linkageName: "std.io.File.reopen", scope: !21, file: !21, line: 61, type: !146, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148, !35, !35}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DILocation(line: 62, column: 1, scope: !145)
!150 = !DILocalVariable(name: "self", arg: 1, scope: !145, file: !21, line: 61, type: !148)
!151 = !DILocation(line: 61, column: 22, scope: !145)
!152 = !DILocalVariable(name: "filename", arg: 2, scope: !145, file: !21, line: 61, type: !35)
!153 = !DILocation(line: 61, column: 36, scope: !145)
!154 = !DILocalVariable(name: "mode", arg: 3, scope: !145, file: !21, line: 61, type: !35)
!155 = !DILocation(line: 61, column: 53, scope: !145)
!156 = !DILocation(line: 59, column: 11, scope: !157)
!157 = distinct !DILexicalBlock(scope: !145, file: !21, line: 62, column: 1)
!158 = !DILocation(line: 63, column: 33, scope: !145)
!159 = !DILocation(line: 63, column: 44, scope: !145)
!160 = !DILocation(line: 63, column: 54, scope: !145)
!161 = !DILocation(line: 39, column: 11, scope: !145)
!162 = !DILocation(line: 63, column: 14, scope: !145)
!163 = !DILocation(line: 40, column: 11, scope: !145)
!164 = !DILocation(line: 63, column: 2, scope: !145)
!165 = distinct !DISubprogram(name: "seek", linkageName: "std.io.File.seek", scope: !21, file: !21, line: 69, type: !166, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!166 = !DISubroutineType(types: !167)
!167 = !{!43, !148, !168, !20}
!168 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!169 = !DILocation(line: 70, column: 1, scope: !165)
!170 = !DILocalVariable(name: "self", arg: 1, scope: !165, file: !21, line: 69, type: !148)
!171 = !DILocation(line: 69, column: 19, scope: !165)
!172 = !DILocalVariable(name: "offset", arg: 2, scope: !165, file: !21, line: 69, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !168)
!174 = !DILocation(line: 69, column: 30, scope: !165)
!175 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !165, file: !21, line: 69, type: !20)
!176 = !DILocation(line: 69, column: 43, scope: !165)
!177 = !DILocation(line: 67, column: 11, scope: !178)
!178 = distinct !DILexicalBlock(scope: !165, file: !21, line: 70, column: 1)
!179 = !DILocation(line: 71, column: 19, scope: !165)
!180 = !DILocation(line: 71, column: 38, scope: !165)
!181 = !DILocation(line: 71, column: 2, scope: !165)
!182 = !DILocation(line: 72, column: 31, scope: !165)
!183 = !DILocation(line: 72, column: 9, scope: !165)
!184 = distinct !DISubprogram(name: "set_cursor", linkageName: "std.io.File.set_cursor", scope: !21, file: !21, line: 78, type: !185, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !148, !168, !26}
!187 = !DILocation(line: 79, column: 1, scope: !184)
!188 = !DILocalVariable(name: "self", arg: 1, scope: !184, file: !21, line: 78, type: !148)
!189 = !DILocation(line: 78, column: 26, scope: !184)
!190 = !DILocalVariable(name: "offset", arg: 2, scope: !184, file: !21, line: 78, type: !168)
!191 = !DILocation(line: 78, column: 38, scope: !184)
!192 = !DILocalVariable(name: "whence", arg: 3, scope: !184, file: !21, line: 78, type: !26)
!193 = !DILocation(line: 78, column: 57, scope: !184)
!194 = !DILocation(line: 76, column: 11, scope: !195)
!195 = distinct !DILexicalBlock(scope: !184, file: !21, line: 79, column: 1)
!196 = !DILocation(line: 80, column: 26, scope: !184)
!197 = !DILocation(line: 80, column: 45, scope: !184)
!198 = !DILocation(line: 80, column: 9, scope: !184)
!199 = distinct !DISubprogram(name: "cursor", linkageName: "std.io.File.cursor", scope: !21, file: !21, line: 86, type: !200, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!200 = !DISubroutineType(types: !201)
!201 = !{!168, !148}
!202 = !DILocation(line: 87, column: 1, scope: !199)
!203 = !DILocalVariable(name: "self", arg: 1, scope: !199, file: !21, line: 86, type: !148)
!204 = !DILocation(line: 86, column: 22, scope: !199)
!205 = !DILocation(line: 84, column: 11, scope: !206)
!206 = distinct !DILexicalBlock(scope: !199, file: !21, line: 87, column: 1)
!207 = !DILocation(line: 88, column: 26, scope: !199)
!208 = !DILocation(line: 88, column: 9, scope: !199)
!209 = distinct !DISubprogram(name: "write_byte", linkageName: "std.io.File.write_byte", scope: !21, file: !21, line: 110, type: !210, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !148, !40}
!212 = !DILocation(line: 111, column: 1, scope: !209)
!213 = !DILocalVariable(name: "self", arg: 1, scope: !209, file: !21, line: 110, type: !148)
!214 = !DILocation(line: 110, column: 26, scope: !209)
!215 = !DILocalVariable(name: "c", arg: 2, scope: !209, file: !21, line: 110, type: !40)
!216 = !DILocation(line: 110, column: 38, scope: !209)
!217 = !DILocation(line: 108, column: 11, scope: !218)
!218 = distinct !DILexicalBlock(scope: !209, file: !21, line: 111, column: 1)
!219 = !DILocation(line: 112, column: 26, scope: !209)
!220 = !DILocation(line: 112, column: 29, scope: !209)
!221 = !DILocation(line: 112, column: 9, scope: !209)
!222 = distinct !DISubprogram(name: "close", linkageName: "std.io.File.close", scope: !21, file: !21, line: 118, type: !223, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !148}
!225 = !DILocation(line: 119, column: 1, scope: !222)
!226 = !DILocalVariable(name: "self", arg: 1, scope: !222, file: !21, line: 118, type: !148)
!227 = !DILocation(line: 118, column: 21, scope: !222)
!228 = !DILocation(line: 120, column: 6, scope: !222)
!229 = !DILocation(line: 120, column: 32, scope: !222)
!230 = !DILocation(line: 120, column: 19, scope: !222)
!231 = !DILocation(line: 122, column: 11, scope: !232)
!232 = distinct !DILexicalBlock(scope: !233, file: !21, line: 122, column: 3)
!233 = distinct !DILexicalBlock(scope: !222, file: !21, line: 121, column: 2)
!234 = !DILocation(line: 125, column: 30, scope: !235)
!235 = distinct !DILexicalBlock(scope: !232, file: !21, line: 125, column: 23)
!236 = !DILocation(line: 126, column: 30, scope: !237)
!237 = distinct !DILexicalBlock(scope: !232, file: !21, line: 126, column: 23)
!238 = !DILocation(line: 134, column: 28, scope: !239)
!239 = distinct !DILexicalBlock(scope: !232, file: !21, line: 134, column: 21)
!240 = !DILocation(line: 135, column: 20, scope: !241)
!241 = distinct !DILexicalBlock(scope: !232, file: !21, line: 135, column: 13)
!242 = !DILocation(line: 138, column: 2, scope: !222)
!243 = distinct !DISubprogram(name: "size", linkageName: "std.io.File.size", scope: !21, file: !21, line: 141, type: !244, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!244 = !DISubroutineType(types: !245)
!245 = !{!43, !148}
!246 = !DILocation(line: 142, column: 1, scope: !243)
!247 = !DILocalVariable(name: "self", arg: 1, scope: !243, file: !21, line: 141, type: !148)
!248 = !DILocation(line: 141, column: 21, scope: !243)
!249 = !DILocalVariable(name: "curr", scope: !243, file: !21, line: 143, type: !168, align: 64)
!250 = !DILocation(line: 143, column: 7, scope: !243)
!251 = !DILocation(line: 143, column: 14, scope: !243)
!252 = !DILocation(line: 84, column: 11, scope: !243)
!253 = !DILocation(line: 145, column: 2, scope: !243)
!254 = !DILocation(line: 76, column: 11, scope: !243)
!255 = !DILocation(line: 144, column: 14, scope: !256)
!256 = distinct !DILexicalBlock(scope: !243, file: !21, line: 144, column: 8)
!257 = !DILocation(line: 144, column: 30, scope: !256)
!258 = !DILocation(line: 76, column: 11, scope: !256)
!259 = !DILocation(line: 144, column: 8, scope: !256)
!260 = !DILocation(line: 146, column: 9, scope: !243)
!261 = !DILocation(line: 144, column: 14, scope: !262)
!262 = distinct !DILexicalBlock(scope: !243, file: !21, line: 144, column: 8)
!263 = !DILocation(line: 144, column: 30, scope: !262)
!264 = !DILocation(line: 76, column: 11, scope: !262)
!265 = !DILocation(line: 144, column: 8, scope: !262)
!266 = !DILocation(line: 144, column: 14, scope: !267)
!267 = distinct !DILexicalBlock(scope: !243, file: !21, line: 144, column: 8)
!268 = !DILocation(line: 144, column: 30, scope: !267)
!269 = !DILocation(line: 76, column: 11, scope: !267)
!270 = !DILocation(line: 144, column: 8, scope: !267)
!271 = distinct !DISubprogram(name: "eof", linkageName: "std.io.File.eof", scope: !21, file: !21, line: 152, type: !272, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!272 = !DISubroutineType(types: !273)
!273 = !{!73, !148}
!274 = !DILocation(line: 153, column: 1, scope: !271)
!275 = !DILocalVariable(name: "self", arg: 1, scope: !271, file: !21, line: 152, type: !148)
!276 = !DILocation(line: 152, column: 18, scope: !271)
!277 = !DILocation(line: 150, column: 11, scope: !278)
!278 = distinct !DILexicalBlock(scope: !271, file: !21, line: 153, column: 1)
!279 = !DILocation(line: 154, column: 20, scope: !271)
!280 = !DILocation(line: 154, column: 9, scope: !271)
!281 = distinct !DISubprogram(name: "read", linkageName: "std.io.File.read", scope: !21, file: !21, line: 160, type: !282, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!282 = !DISubroutineType(types: !283)
!283 = !{!43, !148, !36}
!284 = !DILocation(line: 161, column: 1, scope: !281)
!285 = !DILocalVariable(name: "self", arg: 1, scope: !281, file: !21, line: 160, type: !148)
!286 = !DILocation(line: 160, column: 19, scope: !281)
!287 = !DILocalVariable(name: "buffer", arg: 2, scope: !281, file: !21, line: 160, type: !36)
!288 = !DILocation(line: 160, column: 33, scope: !281)
!289 = !DILocation(line: 162, column: 26, scope: !281)
!290 = !DILocation(line: 162, column: 9, scope: !281)
!291 = distinct !DISubprogram(name: "write", linkageName: "std.io.File.write", scope: !21, file: !21, line: 169, type: !282, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!292 = !DILocation(line: 170, column: 1, scope: !291)
!293 = !DILocalVariable(name: "self", arg: 1, scope: !291, file: !21, line: 169, type: !148)
!294 = !DILocation(line: 169, column: 20, scope: !291)
!295 = !DILocalVariable(name: "buffer", arg: 2, scope: !291, file: !21, line: 169, type: !36)
!296 = !DILocation(line: 169, column: 34, scope: !291)
!297 = !DILocation(line: 167, column: 11, scope: !298)
!298 = distinct !DILexicalBlock(scope: !291, file: !21, line: 170, column: 1)
!299 = !DILocation(line: 171, column: 27, scope: !291)
!300 = !DILocation(line: 171, column: 9, scope: !291)
!301 = distinct !DISubprogram(name: "read_byte", linkageName: "std.io.File.read_byte", scope: !21, file: !21, line: 184, type: !302, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!302 = !DISubroutineType(types: !303)
!303 = !{!40, !148}
!304 = !DILocation(line: 185, column: 1, scope: !301)
!305 = !DILocalVariable(name: "self", arg: 1, scope: !301, file: !21, line: 184, type: !148)
!306 = !DILocation(line: 184, column: 25, scope: !301)
!307 = !DILocalVariable(name: "c", scope: !301, file: !21, line: 186, type: !10, align: 32)
!308 = !DILocation(line: 186, column: 6, scope: !301)
!309 = !DILocation(line: 186, column: 22, scope: !301)
!310 = !DILocation(line: 186, column: 10, scope: !301)
!311 = !DILocation(line: 187, column: 6, scope: !301)
!312 = !DILocation(line: 187, column: 22, scope: !301)
!313 = !DILocation(line: 188, column: 9, scope: !301)
!314 = distinct !DISubprogram(name: "flush", linkageName: "std.io.File.flush", scope: !21, file: !21, line: 249, type: !223, scopeLine: 249, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!315 = !DILocation(line: 250, column: 1, scope: !314)
!316 = !DILocalVariable(name: "self", arg: 1, scope: !314, file: !21, line: 249, type: !148)
!317 = !DILocation(line: 249, column: 21, scope: !314)
!318 = !DILocation(line: 247, column: 11, scope: !319)
!319 = distinct !DILexicalBlock(scope: !314, file: !21, line: 250, column: 1)
!320 = !DILocation(line: 251, column: 15, scope: !314)
!321 = !DILocation(line: 251, column: 2, scope: !314)
!322 = distinct !DISubprogram(name: "fd", linkageName: "std.io.File.fd", scope: !21, file: !21, line: 174, type: !323, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !61}
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "Fd", scope: !21, file: !21, line: 56, baseType: !10, align: 32)
!326 = !DILocalVariable(name: "self", arg: 1, scope: !322, file: !21, line: 174, type: !61)
!327 = !DILocation(line: 174, column: 15, scope: !322)
!328 = !DILocation(line: 176, column: 22, scope: !322)
!329 = !DILocation(line: 176, column: 9, scope: !322)
!330 = distinct !DISubprogram(name: "isatty", linkageName: "std.io.File.isatty", scope: !21, file: !21, line: 179, type: !331, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!331 = !DISubroutineType(types: !332)
!332 = !{!73, !61}
!333 = !DILocalVariable(name: "self", arg: 1, scope: !330, file: !21, line: 179, type: !61)
!334 = !DILocation(line: 179, column: 21, scope: !330)
!335 = !DILocation(line: 181, column: 22, scope: !330)
!336 = !DILocation(line: 181, column: 9, scope: !330)
!337 = distinct !DISubprogram(name: "open", linkageName: "std.io.file.open", scope: !21, file: !21, line: 12, type: !338, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!338 = !DISubroutineType(types: !339)
!339 = !{!61, !35, !35}
!340 = !DILocalVariable(name: "filename", arg: 1, scope: !337, file: !21, line: 12, type: !35)
!341 = !DILocation(line: 12, column: 22, scope: !337)
!342 = !DILocalVariable(name: "mode", arg: 2, scope: !337, file: !21, line: 12, type: !35)
!343 = !DILocation(line: 12, column: 39, scope: !337)
!344 = !DILocation(line: 14, column: 38, scope: !337)
!345 = !DILocation(line: 14, column: 48, scope: !337)
!346 = !DILocation(line: 5, column: 11, scope: !337)
!347 = !DILocation(line: 14, column: 21, scope: !337)
!348 = !DILocation(line: 6, column: 11, scope: !337)
!349 = !DILocation(line: 14, column: 9, scope: !337)
!350 = distinct !DISubprogram(name: "open_path", linkageName: "std.io.file.open_path", scope: !21, file: !21, line: 17, type: !351, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!351 = !DISubroutineType(types: !352)
!352 = !{!61, !32, !35}
!353 = !DILocalVariable(name: "path", arg: 1, scope: !350, file: !21, line: 17, type: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !21, file: !21, line: 14, baseType: !32, align: 64)
!355 = !DILocation(line: 17, column: 25, scope: !350)
!356 = !DILocalVariable(name: "mode", arg: 2, scope: !350, file: !21, line: 17, type: !35)
!357 = !DILocation(line: 17, column: 38, scope: !350)
!358 = !DILocation(line: 19, column: 38, scope: !350)
!359 = !DILocation(line: 19, column: 55, scope: !350)
!360 = !DILocation(line: 5, column: 11, scope: !350)
!361 = !DILocation(line: 19, column: 21, scope: !350)
!362 = !DILocation(line: 6, column: 11, scope: !350)
!363 = !DILocation(line: 19, column: 9, scope: !350)
!364 = distinct !DISubprogram(name: "exists", linkageName: "std.io.file.exists", scope: !21, file: !21, line: 22, type: !365, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!365 = !DISubroutineType(types: !366)
!366 = !{!73, !35}
!367 = !DILocalVariable(name: "file", arg: 1, scope: !364, file: !21, line: 22, type: !35)
!368 = !DILocation(line: 22, column: 23, scope: !364)
!369 = !DILocalVariable(name: "state", scope: !370, file: !21, line: 679, type: !372, align: 64)
!370 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !371, file: !371, line: 677, scopeLine: 677, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !74)
!371 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PoolState", scope: !21, file: !21, line: 496, baseType: !373, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64, dwarfAddressSpace: 0)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !21, file: !21, line: 31, size: 704, align: 64, elements: !375, identifier: "std.core.mem.allocator.TempAllocator")
!375 = !{!376, !377, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !374, file: !21, line: 33, baseType: !46, size: 128, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !374, file: !21, line: 34, baseType: !378, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64, dwarfAddressSpace: 0)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !21, file: !21, line: 54, size: 256, align: 64, elements: !380, identifier: "std.core.mem.allocator.TempAllocatorPage")
!380 = !{!381, !382, !383, !384, !385}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !379, file: !21, line: 56, baseType: !378, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !379, file: !21, line: 57, baseType: !49, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !379, file: !21, line: 58, baseType: !42, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !379, file: !21, line: 59, baseType: !42, size: 64, align: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !21, line: 60, baseType: !386, align: 8, offset: 256)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, align: 8, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 0, lowerBound: 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "derived", scope: !374, file: !21, line: 35, baseType: !373, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !374, file: !21, line: 36, baseType: !73, size: 8, align: 8, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reserve_size", scope: !374, file: !21, line: 37, baseType: !42, size: 64, align: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_size", scope: !374, file: !21, line: 38, baseType: !42, size: 64, align: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !374, file: !21, line: 39, baseType: !42, size: 64, align: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !374, file: !21, line: 40, baseType: !42, size: 64, align: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !374, file: !21, line: 41, baseType: !42, size: 64, align: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "original_capacity", scope: !374, file: !21, line: 42, baseType: !42, size: 64, align: 64, offset: 640)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !374, file: !21, line: 43, baseType: !386, align: 8, offset: 704)
!398 = !DILocation(line: 679, column: 12, scope: !370, inlinedAt: !399)
!399 = !DILocation(line: 22, column: 32, scope: !364)
!400 = !DILocation(line: 679, column: 41, scope: !370, inlinedAt: !399)
!401 = !DILocation(line: 679, column: 20, scope: !370, inlinedAt: !399)
!402 = !DILocation(line: 24, column: 39, scope: !403)
!403 = distinct !DILexicalBlock(scope: !364, file: !21, line: 23, column: 1)
!404 = !DILocation(line: 24, column: 9, scope: !403)
!405 = !DILocation(line: 682, column: 23, scope: !406, inlinedAt: !399)
!406 = distinct !DILexicalBlock(scope: !370, file: !371, line: 681, column: 2)
!407 = !DILocation(line: 682, column: 3, scope: !406, inlinedAt: !399)
!408 = distinct !DISubprogram(name: "from_handle", linkageName: "std.io.file.from_handle", scope: !21, file: !21, line: 27, type: !409, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!409 = !DISubroutineType(types: !410)
!410 = !{!61, !49}
!411 = !DILocalVariable(name: "file", arg: 1, scope: !408, file: !21, line: 27, type: !64)
!412 = !DILocation(line: 27, column: 27, scope: !408)
!413 = !DILocation(line: 29, column: 19, scope: !408)
!414 = distinct !DISubprogram(name: "is_file", linkageName: "std.io.file.is_file", scope: !21, file: !21, line: 32, type: !365, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!415 = !DILocalVariable(name: "path", arg: 1, scope: !414, file: !21, line: 32, type: !35)
!416 = !DILocation(line: 32, column: 24, scope: !414)
!417 = !DILocation(line: 34, column: 28, scope: !414)
!418 = !DILocation(line: 34, column: 9, scope: !414)
!419 = distinct !DISubprogram(name: "is_dir", linkageName: "std.io.file.is_dir", scope: !21, file: !21, line: 37, type: !365, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!420 = !DILocalVariable(name: "path", arg: 1, scope: !419, file: !21, line: 37, type: !35)
!421 = !DILocation(line: 37, column: 23, scope: !419)
!422 = !DILocation(line: 39, column: 27, scope: !419)
!423 = !DILocation(line: 39, column: 9, scope: !419)
!424 = distinct !DISubprogram(name: "get_size", linkageName: "std.io.file.get_size", scope: !21, file: !21, line: 42, type: !425, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!425 = !DISubroutineType(types: !426)
!426 = !{!43, !35}
!427 = !DILocalVariable(name: "path", arg: 1, scope: !424, file: !21, line: 42, type: !35)
!428 = !DILocation(line: 42, column: 27, scope: !424)
!429 = !DILocation(line: 44, column: 9, scope: !424)
!430 = distinct !DISubprogram(name: "set_modified_time", linkageName: "std.io.file.set_modified_time", scope: !21, file: !21, line: 47, type: !431, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !35, !168}
!433 = !DILocalVariable(name: "path", arg: 1, scope: !430, file: !21, line: 47, type: !35)
!434 = !DILocation(line: 47, column: 35, scope: !430)
!435 = !DILocalVariable(name: "time", arg: 2, scope: !430, file: !21, line: 47, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !21, file: !21, line: 67, baseType: !168, align: 64)
!437 = !DILocation(line: 47, column: 48, scope: !430)
!438 = !DILocation(line: 49, column: 44, scope: !430)
!439 = !DILocation(line: 49, column: 9, scope: !430)
!440 = distinct !DISubprogram(name: "delete", linkageName: "std.io.file.delete", scope: !21, file: !21, line: 52, type: !441, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !74)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !35}
!443 = !DILocalVariable(name: "filename", arg: 1, scope: !440, file: !21, line: 52, type: !35)
!444 = !DILocation(line: 52, column: 24, scope: !440)
