; ModuleID = 'std::hash::hmac'
source_filename = "std::hash::hmac"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx11.0.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"Hmac{Md5, 16, 64}" = type { %Md5, %Md5 }
%Md5 = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }
%"Hmac{Sha1, 20, 64}" = type { %Sha1, %Sha1 }
%Sha1 = type { [5 x i32], [2 x i32], [64 x i8] }
%"Hmac{Sha256, 32, 64}" = type { %Sha256, %Sha256 }
%Sha256 = type { [8 x i32], [64 x i8], i64 }
%"Hmac{Whirlpool, 64, 64}" = type { %Whirlpool, %Whirlpool }
%Whirlpool = type { [8 x i64], %.anon, i128, i128 }
%.anon = type { [4 x i128] }
%"Hmac{Sha512, 64, 128}" = type { %Sha512, %Sha512 }
%Sha512 = type { i64, [8 x i64], [128 x i8] }

@"$ct.std.hash.hmac.Hmac$std.hash.md5.Md5$16$64$" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 304, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.hash.hmac.Hmac$std.hash.sha1.Sha1$20$64$" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 184, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.hash.hmac.Hmac$std.hash.sha256.Sha256$32$64$" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 208, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "IPAD{Md5, 16, 64}", linkageName: "std.hash.hmac.IPAD$std.hash.md5.Md5$16$64$", scope: !2, file: !2, line: 83, type: !3, isLocal: true, isDefinition: true, align: 32)
!2 = !DIFile(filename: "hmac.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/hash")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OPAD{Md5, 16, 64}", linkageName: "std.hash.hmac.OPAD$std.hash.md5.Md5$16$64$", scope: !2, file: !2, line: 84, type: !3, isLocal: true, isDefinition: true, align: 32)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "IPAD{Sha1, 20, 64}", linkageName: "std.hash.hmac.IPAD$std.hash.sha1.Sha1$20$64$", scope: !2, file: !2, line: 83, type: !3, isLocal: true, isDefinition: true, align: 32)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "OPAD{Sha1, 20, 64}", linkageName: "std.hash.hmac.OPAD$std.hash.sha1.Sha1$20$64$", scope: !2, file: !2, line: 84, type: !3, isLocal: true, isDefinition: true, align: 32)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "IPAD{Sha256, 32, 64}", linkageName: "std.hash.hmac.IPAD$std.hash.sha256.Sha256$32$64$", scope: !2, file: !2, line: 83, type: !3, isLocal: true, isDefinition: true, align: 32)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "OPAD{Sha256, 32, 64}", linkageName: "std.hash.hmac.OPAD$std.hash.sha256.Sha256$32$64$", scope: !2, file: !2, line: 84, type: !3, isLocal: true, isDefinition: true, align: 32)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "IPAD{Whirlpool, 64, 64}", linkageName: "std.hash.hmac.IPAD$std.hash.whirlpool.Whirlpool$64$64$", scope: !2, file: !2, line: 83, type: !3, isLocal: true, isDefinition: true, align: 32)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "OPAD{Whirlpool, 64, 64}", linkageName: "std.hash.hmac.OPAD$std.hash.whirlpool.Whirlpool$64$64$", scope: !2, file: !2, line: 84, type: !3, isLocal: true, isDefinition: true, align: 32)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "IPAD{Sha512, 64, 128}", linkageName: "std.hash.hmac.IPAD$std.hash.sha512.Sha512$64$128$", scope: !2, file: !2, line: 83, type: !3, isLocal: true, isDefinition: true, align: 32)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "OPAD{Sha512, 64, 128}", linkageName: "std.hash.hmac.OPAD$std.hash.sha512.Sha512$64$128$", scope: !2, file: !2, line: 84, type: !3, isLocal: true, isDefinition: true, align: 32)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 2, !"wchar_size", i32 4}
!25 = !{i32 4, !"PIC Level", i32 2}
!26 = !{i32 1, !"uwtable", i32 1}
!27 = !{i32 2, !"frame-pointer", i32 1}
!28 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !29, splitDebugInlining: false)
!29 = !{!0, !4, !6, !8, !10, !12, !14, !16, !18, !20}
!30 = distinct !DISubprogram(name: "init", linkageName: "std.hash.hmac.Hmac$std.hash.md5.Md5$16$64$.init", scope: !2, file: !2, line: 45, type: !31, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33, !55}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hmac{Md5, 16, 64}", scope: !2, file: !2, line: 4, size: 2432, align: 32, elements: !35, identifier: "std.hash.hmac.Hmac$std.hash.md5.Md5$16$64$")
!35 = !{!36, !54}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !34, file: !2, line: 6, baseType: !37, size: 1216, align: 32)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Md5", scope: !34, file: !2, line: 8, size: 1216, align: 32, elements: !38, identifier: "std.hash.md5.Md5")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !50}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !37, file: !2, line: 10, baseType: !3, size: 32, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !37, file: !2, line: 10, baseType: !3, size: 32, align: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !37, file: !2, line: 11, baseType: !3, size: 32, align: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !37, file: !2, line: 11, baseType: !3, size: 32, align: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !37, file: !2, line: 11, baseType: !3, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !37, file: !2, line: 11, baseType: !3, size: 32, align: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !37, file: !2, line: 12, baseType: !46, size: 512, align: 8, offset: 192)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 512, align: 8, elements: !48)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !{!49}
!49 = !DISubrange(count: 64, lowerBound: 0)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !37, file: !2, line: 13, baseType: !51, size: 512, align: 32, offset: 704)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 512, align: 32, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 16, lowerBound: 0)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !34, file: !2, line: 6, baseType: !37, size: 1216, align: 32, offset: 1216)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !56, identifier: "char[]")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !55, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !61)
!61 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!62 = !{}
!63 = !DILocation(line: 46, column: 1, scope: !30)
!64 = !DILocalVariable(name: "self", arg: 1, scope: !30, file: !2, line: 45, type: !33)
!65 = !DILocation(line: 45, column: 19, scope: !30)
!66 = !DILocalVariable(name: "key", arg: 2, scope: !30, file: !2, line: 45, type: !55)
!67 = !DILocation(line: 45, column: 33, scope: !30)
!68 = !DILocalVariable(name: "buffer", scope: !30, file: !2, line: 47, type: !46, align: 8)
!69 = !DILocation(line: 47, column: 20, scope: !30)
!70 = !DILocation(line: 48, column: 6, scope: !30)
!71 = !DILocation(line: 50, column: 3, scope: !72)
!72 = distinct !DILexicalBlock(scope: !30, file: !2, line: 49, column: 2)
!73 = !DILocation(line: 51, column: 3, scope: !72)
!74 = !DILocation(line: 51, column: 17, scope: !72)
!75 = !DILocation(line: 52, column: 25, scope: !72)
!76 = !DILocation(line: 52, column: 3, scope: !72)
!77 = !DILocation(line: 56, column: 22, scope: !78)
!78 = distinct !DILexicalBlock(scope: !30, file: !2, line: 55, column: 2)
!79 = !DILocation(line: 56, column: 26, scope: !78)
!80 = !DILocation(line: 56, column: 11, scope: !78)
!81 = !DILocation(line: 56, column: 3, scope: !78)
!82 = !DILocalVariable(name: ".temp", scope: !83, file: !2, line: 59, type: !60, align: 64)
!83 = distinct !DILexicalBlock(scope: !30, file: !2, line: 59, column: 2)
!84 = !DILocation(line: 59, column: 16, scope: !83)
!85 = !DILocalVariable(name: "b", scope: !86, file: !2, line: 59, type: !58, align: 64)
!86 = distinct !DILexicalBlock(scope: !83, file: !2, line: 59, column: 24)
!87 = !DILocation(line: 59, column: 12, scope: !86)
!88 = !DILocation(line: 59, column: 16, scope: !86)
!89 = !DILocation(line: 59, column: 25, scope: !86)
!90 = !DILocation(line: 59, column: 24, scope: !86)
!91 = !DILocation(line: 61, column: 2, scope: !30)
!92 = !DILocation(line: 62, column: 2, scope: !30)
!93 = !DILocation(line: 62, column: 17, scope: !30)
!94 = !DILocalVariable(name: ".temp", scope: !95, file: !2, line: 64, type: !60, align: 64)
!95 = distinct !DILexicalBlock(scope: !30, file: !2, line: 64, column: 2)
!96 = !DILocation(line: 64, column: 16, scope: !95)
!97 = !DILocalVariable(name: "b", scope: !98, file: !2, line: 64, type: !58, align: 64)
!98 = distinct !DILexicalBlock(scope: !95, file: !2, line: 64, column: 24)
!99 = !DILocation(line: 64, column: 12, scope: !98)
!100 = !DILocation(line: 64, column: 16, scope: !98)
!101 = !DILocation(line: 64, column: 25, scope: !98)
!102 = !DILocation(line: 64, column: 24, scope: !98)
!103 = !DILocation(line: 66, column: 2, scope: !30)
!104 = !DILocation(line: 67, column: 2, scope: !30)
!105 = !DILocation(line: 67, column: 17, scope: !30)
!106 = !DILocation(line: 69, column: 22, scope: !30)
!107 = !DILocation(line: 369, column: 11, scope: !108, inlinedAt: !110)
!108 = distinct !DISubprogram(name: "zero_volatile", linkageName: "zero_volatile", scope: !109, file: !109, line: 367, scopeLine: 367, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!109 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/core")
!110 = !DILocation(line: 69, column: 2, scope: !30)
!111 = !DILocation(line: 369, column: 30, scope: !108, inlinedAt: !110)
!112 = !DILocation(line: 369, column: 40, scope: !108, inlinedAt: !110)
!113 = distinct !DISubprogram(name: "update", linkageName: "std.hash.hmac.Hmac$std.hash.md5.Md5$16$64$.update", scope: !2, file: !2, line: 72, type: !31, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!114 = !DILocation(line: 73, column: 1, scope: !113)
!115 = !DILocalVariable(name: "self", arg: 1, scope: !113, file: !2, line: 72, type: !33)
!116 = !DILocation(line: 72, column: 21, scope: !113)
!117 = !DILocalVariable(name: "data", arg: 2, scope: !113, file: !2, line: 72, type: !55)
!118 = !DILocation(line: 72, column: 35, scope: !113)
!119 = !DILocation(line: 74, column: 2, scope: !113)
!120 = !DILocation(line: 74, column: 16, scope: !113)
!121 = distinct !DISubprogram(name: "final", linkageName: "std.hash.hmac.Hmac$std.hash.md5.Md5$16$64$.final", scope: !2, file: !2, line: 77, type: !122, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !33}
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 128, align: 8, elements: !52)
!125 = !DILocation(line: 78, column: 1, scope: !121)
!126 = !DILocalVariable(name: "self", arg: 1, scope: !121, file: !2, line: 77, type: !33)
!127 = !DILocation(line: 77, column: 32, scope: !121)
!128 = !DILocation(line: 79, column: 2, scope: !121)
!129 = !DILocation(line: 79, column: 18, scope: !121)
!130 = !DILocation(line: 80, column: 9, scope: !121)
!131 = distinct !DISubprogram(name: "init", linkageName: "std.hash.hmac.Hmac$std.hash.sha1.Sha1$20$64$.init", scope: !2, file: !2, line: 45, type: !132, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !134, !55}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64, dwarfAddressSpace: 0)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hmac{Sha1, 20, 64}", scope: !2, file: !2, line: 4, size: 1472, align: 32, elements: !136, identifier: "std.hash.hmac.Hmac$std.hash.sha1.Sha1$20$64$")
!136 = !{!137, !149}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !135, file: !2, line: 6, baseType: !138, size: 736, align: 32)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sha1", scope: !135, file: !2, line: 14, size: 736, align: 32, elements: !139, identifier: "std.hash.sha1.Sha1")
!139 = !{!140, !144, !148}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !138, file: !2, line: 16, baseType: !141, size: 160, align: 32)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 160, align: 32, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 5, lowerBound: 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !138, file: !2, line: 17, baseType: !145, size: 64, align: 32, offset: 160)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 64, align: 32, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 2, lowerBound: 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !138, file: !2, line: 18, baseType: !46, size: 512, align: 8, offset: 224)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !135, file: !2, line: 6, baseType: !138, size: 736, align: 32, offset: 736)
!150 = !DILocation(line: 46, column: 1, scope: !131)
!151 = !DILocalVariable(name: "self", arg: 1, scope: !131, file: !2, line: 45, type: !134)
!152 = !DILocation(line: 45, column: 19, scope: !131)
!153 = !DILocalVariable(name: "key", arg: 2, scope: !131, file: !2, line: 45, type: !55)
!154 = !DILocation(line: 45, column: 33, scope: !131)
!155 = !DILocalVariable(name: "buffer", scope: !131, file: !2, line: 47, type: !46, align: 8)
!156 = !DILocation(line: 47, column: 20, scope: !131)
!157 = !DILocation(line: 48, column: 6, scope: !131)
!158 = !DILocation(line: 50, column: 3, scope: !159)
!159 = distinct !DILexicalBlock(scope: !131, file: !2, line: 49, column: 2)
!160 = !DILocation(line: 51, column: 3, scope: !159)
!161 = !DILocation(line: 51, column: 17, scope: !159)
!162 = !DILocation(line: 49, column: 11, scope: !159)
!163 = !DILocation(line: 52, column: 25, scope: !159)
!164 = !DILocation(line: 52, column: 3, scope: !159)
!165 = !DILocation(line: 56, column: 22, scope: !166)
!166 = distinct !DILexicalBlock(scope: !131, file: !2, line: 55, column: 2)
!167 = !DILocation(line: 56, column: 26, scope: !166)
!168 = !DILocation(line: 56, column: 11, scope: !166)
!169 = !DILocation(line: 56, column: 3, scope: !166)
!170 = !DILocalVariable(name: ".temp", scope: !171, file: !2, line: 59, type: !60, align: 64)
!171 = distinct !DILexicalBlock(scope: !131, file: !2, line: 59, column: 2)
!172 = !DILocation(line: 59, column: 16, scope: !171)
!173 = !DILocalVariable(name: "b", scope: !174, file: !2, line: 59, type: !58, align: 64)
!174 = distinct !DILexicalBlock(scope: !171, file: !2, line: 59, column: 24)
!175 = !DILocation(line: 59, column: 12, scope: !174)
!176 = !DILocation(line: 59, column: 16, scope: !174)
!177 = !DILocation(line: 59, column: 25, scope: !174)
!178 = !DILocation(line: 59, column: 24, scope: !174)
!179 = !DILocation(line: 61, column: 2, scope: !131)
!180 = !DILocation(line: 62, column: 2, scope: !131)
!181 = !DILocation(line: 62, column: 17, scope: !131)
!182 = !DILocation(line: 49, column: 11, scope: !131)
!183 = !DILocalVariable(name: ".temp", scope: !184, file: !2, line: 64, type: !60, align: 64)
!184 = distinct !DILexicalBlock(scope: !131, file: !2, line: 64, column: 2)
!185 = !DILocation(line: 64, column: 16, scope: !184)
!186 = !DILocalVariable(name: "b", scope: !187, file: !2, line: 64, type: !58, align: 64)
!187 = distinct !DILexicalBlock(scope: !184, file: !2, line: 64, column: 24)
!188 = !DILocation(line: 64, column: 12, scope: !187)
!189 = !DILocation(line: 64, column: 16, scope: !187)
!190 = !DILocation(line: 64, column: 25, scope: !187)
!191 = !DILocation(line: 64, column: 24, scope: !187)
!192 = !DILocation(line: 66, column: 2, scope: !131)
!193 = !DILocation(line: 67, column: 2, scope: !131)
!194 = !DILocation(line: 67, column: 17, scope: !131)
!195 = !DILocation(line: 69, column: 22, scope: !131)
!196 = !DILocation(line: 369, column: 11, scope: !197, inlinedAt: !198)
!197 = distinct !DISubprogram(name: "zero_volatile", linkageName: "zero_volatile", scope: !109, file: !109, line: 367, scopeLine: 367, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!198 = !DILocation(line: 69, column: 2, scope: !131)
!199 = !DILocation(line: 369, column: 30, scope: !197, inlinedAt: !198)
!200 = !DILocation(line: 369, column: 40, scope: !197, inlinedAt: !198)
!201 = distinct !DISubprogram(name: "update", linkageName: "std.hash.hmac.Hmac$std.hash.sha1.Sha1$20$64$.update", scope: !2, file: !2, line: 72, type: !132, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!202 = !DILocation(line: 73, column: 1, scope: !201)
!203 = !DILocalVariable(name: "self", arg: 1, scope: !201, file: !2, line: 72, type: !134)
!204 = !DILocation(line: 72, column: 21, scope: !201)
!205 = !DILocalVariable(name: "data", arg: 2, scope: !201, file: !2, line: 72, type: !55)
!206 = !DILocation(line: 72, column: 35, scope: !201)
!207 = !DILocation(line: 74, column: 2, scope: !201)
!208 = !DILocation(line: 74, column: 16, scope: !201)
!209 = !DILocation(line: 49, column: 11, scope: !201)
!210 = distinct !DISubprogram(name: "final", linkageName: "std.hash.hmac.Hmac$std.hash.sha1.Sha1$20$64$.final", scope: !2, file: !2, line: 77, type: !211, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !134}
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, align: 8, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 20, lowerBound: 0)
!216 = !DILocation(line: 78, column: 1, scope: !210)
!217 = !DILocalVariable(name: "self", arg: 1, scope: !210, file: !2, line: 77, type: !134)
!218 = !DILocation(line: 77, column: 32, scope: !210)
!219 = !DILocation(line: 79, column: 2, scope: !210)
!220 = !DILocation(line: 79, column: 18, scope: !210)
!221 = !DILocation(line: 49, column: 11, scope: !210)
!222 = !DILocation(line: 80, column: 9, scope: !210)
!223 = distinct !DISubprogram(name: "init", linkageName: "std.hash.hmac.Hmac$std.hash.sha256.Sha256$32$64$.init", scope: !2, file: !2, line: 45, type: !224, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !226, !55}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64, dwarfAddressSpace: 0)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hmac{Sha256, 32, 64}", scope: !2, file: !2, line: 4, size: 1664, align: 64, elements: !228, identifier: "std.hash.hmac.Hmac$std.hash.sha256.Sha256$32$64$")
!228 = !{!229, !238}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !227, file: !2, line: 6, baseType: !230, size: 832, align: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sha256", scope: !227, file: !2, line: 29, size: 832, align: 64, elements: !231, identifier: "std.hash.sha256.Sha256")
!231 = !{!232, !236, !237}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !230, file: !2, line: 31, baseType: !233, size: 256, align: 32)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 256, align: 32, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 8, lowerBound: 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !230, file: !2, line: 32, baseType: !46, size: 512, align: 8, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bitcount", scope: !230, file: !2, line: 33, baseType: !61, size: 64, align: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !227, file: !2, line: 6, baseType: !230, size: 832, align: 64, offset: 832)
!239 = !DILocation(line: 46, column: 1, scope: !223)
!240 = !DILocalVariable(name: "self", arg: 1, scope: !223, file: !2, line: 45, type: !226)
!241 = !DILocation(line: 45, column: 19, scope: !223)
!242 = !DILocalVariable(name: "key", arg: 2, scope: !223, file: !2, line: 45, type: !55)
!243 = !DILocation(line: 45, column: 33, scope: !223)
!244 = !DILocalVariable(name: "buffer", scope: !223, file: !2, line: 47, type: !46, align: 8)
!245 = !DILocation(line: 47, column: 20, scope: !223)
!246 = !DILocation(line: 48, column: 6, scope: !223)
!247 = !DILocation(line: 50, column: 3, scope: !248)
!248 = distinct !DILexicalBlock(scope: !223, file: !2, line: 49, column: 2)
!249 = !DILocation(line: 51, column: 3, scope: !248)
!250 = !DILocation(line: 51, column: 17, scope: !248)
!251 = !DILocation(line: 58, column: 11, scope: !248)
!252 = !DILocation(line: 52, column: 25, scope: !248)
!253 = !DILocation(line: 52, column: 3, scope: !248)
!254 = !DILocation(line: 56, column: 22, scope: !255)
!255 = distinct !DILexicalBlock(scope: !223, file: !2, line: 55, column: 2)
!256 = !DILocation(line: 56, column: 26, scope: !255)
!257 = !DILocation(line: 56, column: 11, scope: !255)
!258 = !DILocation(line: 56, column: 3, scope: !255)
!259 = !DILocalVariable(name: ".temp", scope: !260, file: !2, line: 59, type: !60, align: 64)
!260 = distinct !DILexicalBlock(scope: !223, file: !2, line: 59, column: 2)
!261 = !DILocation(line: 59, column: 16, scope: !260)
!262 = !DILocalVariable(name: "b", scope: !263, file: !2, line: 59, type: !58, align: 64)
!263 = distinct !DILexicalBlock(scope: !260, file: !2, line: 59, column: 24)
!264 = !DILocation(line: 59, column: 12, scope: !263)
!265 = !DILocation(line: 59, column: 16, scope: !263)
!266 = !DILocation(line: 59, column: 25, scope: !263)
!267 = !DILocation(line: 59, column: 24, scope: !263)
!268 = !DILocation(line: 61, column: 2, scope: !223)
!269 = !DILocation(line: 62, column: 2, scope: !223)
!270 = !DILocation(line: 62, column: 17, scope: !223)
!271 = !DILocation(line: 58, column: 11, scope: !223)
!272 = !DILocalVariable(name: ".temp", scope: !273, file: !2, line: 64, type: !60, align: 64)
!273 = distinct !DILexicalBlock(scope: !223, file: !2, line: 64, column: 2)
!274 = !DILocation(line: 64, column: 16, scope: !273)
!275 = !DILocalVariable(name: "b", scope: !276, file: !2, line: 64, type: !58, align: 64)
!276 = distinct !DILexicalBlock(scope: !273, file: !2, line: 64, column: 24)
!277 = !DILocation(line: 64, column: 12, scope: !276)
!278 = !DILocation(line: 64, column: 16, scope: !276)
!279 = !DILocation(line: 64, column: 25, scope: !276)
!280 = !DILocation(line: 64, column: 24, scope: !276)
!281 = !DILocation(line: 66, column: 2, scope: !223)
!282 = !DILocation(line: 67, column: 2, scope: !223)
!283 = !DILocation(line: 67, column: 17, scope: !223)
!284 = !DILocation(line: 69, column: 22, scope: !223)
!285 = !DILocation(line: 369, column: 11, scope: !286, inlinedAt: !287)
!286 = distinct !DISubprogram(name: "zero_volatile", linkageName: "zero_volatile", scope: !109, file: !109, line: 367, scopeLine: 367, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!287 = !DILocation(line: 69, column: 2, scope: !223)
!288 = !DILocation(line: 369, column: 30, scope: !286, inlinedAt: !287)
!289 = !DILocation(line: 369, column: 40, scope: !286, inlinedAt: !287)
!290 = distinct !DISubprogram(name: "update", linkageName: "std.hash.hmac.Hmac$std.hash.sha256.Sha256$32$64$.update", scope: !2, file: !2, line: 72, type: !224, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!291 = !DILocation(line: 73, column: 1, scope: !290)
!292 = !DILocalVariable(name: "self", arg: 1, scope: !290, file: !2, line: 72, type: !226)
!293 = !DILocation(line: 72, column: 21, scope: !290)
!294 = !DILocalVariable(name: "data", arg: 2, scope: !290, file: !2, line: 72, type: !55)
!295 = !DILocation(line: 72, column: 35, scope: !290)
!296 = !DILocation(line: 74, column: 2, scope: !290)
!297 = !DILocation(line: 74, column: 16, scope: !290)
!298 = !DILocation(line: 58, column: 11, scope: !290)
!299 = distinct !DISubprogram(name: "final", linkageName: "std.hash.hmac.Hmac$std.hash.sha256.Sha256$32$64$.final", scope: !2, file: !2, line: 77, type: !300, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!300 = !DISubroutineType(types: !301)
!301 = !{!302, !226}
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 256, align: 8, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 32, lowerBound: 0)
!305 = !DILocation(line: 78, column: 1, scope: !299)
!306 = !DILocalVariable(name: "self", arg: 1, scope: !299, file: !2, line: 77, type: !226)
!307 = !DILocation(line: 77, column: 32, scope: !299)
!308 = !DILocation(line: 79, column: 2, scope: !299)
!309 = !DILocation(line: 79, column: 18, scope: !299)
!310 = !DILocation(line: 58, column: 11, scope: !299)
!311 = !DILocation(line: 80, column: 9, scope: !299)
!312 = distinct !DISubprogram(name: "init", linkageName: "std.hash.hmac.Hmac$std.hash.whirlpool.Whirlpool$64$64$.init", scope: !2, file: !2, line: 45, type: !313, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !315, !55}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64, dwarfAddressSpace: 0)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hmac{Whirlpool, 64, 64}", scope: !2, file: !2, line: 4, size: 2560, align: 128, elements: !317, identifier: "std.hash.hmac.Hmac$std.hash.whirlpool.Whirlpool$64$64$")
!317 = !{!318, !335}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !316, file: !2, line: 6, baseType: !319, size: 1280, align: 128)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "Whirlpool", scope: !316, file: !2, line: 15, size: 1280, align: 128, elements: !320, identifier: "std.hash.whirlpool.Whirlpool")
!320 = !{!321, !323, !332, !334}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !319, file: !2, line: 17, baseType: !322, size: 512, align: 64)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 512, align: 64, elements: !234)
!323 = !DIDerivedType(tag: DW_TAG_member, scope: !319, file: !2, line: 18, baseType: !324, size: 512, align: 128, offset: 512)
!324 = !DICompositeType(tag: DW_TAG_union_type, scope: !319, file: !2, line: 18, size: 512, align: 128, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !324, file: !2, line: 20, baseType: !46, size: 512, align: 8)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "block_128", scope: !324, file: !2, line: 21, baseType: !328, size: 512, align: 128)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 512, align: 128, elements: !330)
!329 = !DIBasicType(name: "int128", size: 128, encoding: DW_ATE_signed)
!330 = !{!331}
!331 = !DISubrange(count: 4, lowerBound: 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "counter_high", scope: !319, file: !2, line: 25, baseType: !333, size: 128, align: 128, offset: 1024)
!333 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "counter_low", scope: !319, file: !2, line: 26, baseType: !333, size: 128, align: 128, offset: 1152)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !316, file: !2, line: 6, baseType: !319, size: 1280, align: 128, offset: 1280)
!336 = !DILocation(line: 46, column: 1, scope: !312)
!337 = !DILocalVariable(name: "self", arg: 1, scope: !312, file: !2, line: 45, type: !315)
!338 = !DILocation(line: 45, column: 19, scope: !312)
!339 = !DILocalVariable(name: "key", arg: 2, scope: !312, file: !2, line: 45, type: !55)
!340 = !DILocation(line: 45, column: 33, scope: !312)
!341 = !DILocalVariable(name: "buffer", scope: !312, file: !2, line: 47, type: !46, align: 8)
!342 = !DILocation(line: 47, column: 20, scope: !312)
!343 = !DILocation(line: 48, column: 6, scope: !312)
!344 = !DILocation(line: 50, column: 3, scope: !345)
!345 = distinct !DILexicalBlock(scope: !312, file: !2, line: 49, column: 2)
!346 = !DILocation(line: 41, column: 27, scope: !347, inlinedAt: !344)
!347 = distinct !DILexicalBlock(scope: !349, file: !348, line: 41, column: 37)
!348 = !DIFile(filename: "whirlpool.c3", directory: "/opt/homebrew/Cellar/c3c/0.7.10/lib/c3/std/hash/whirlpool")
!349 = distinct !DISubprogram(name: "init", linkageName: "init", scope: !348, file: !348, line: 41, scopeLine: 41, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!350 = !DILocation(line: 41, column: 38, scope: !349, inlinedAt: !344)
!351 = !DILocation(line: 51, column: 3, scope: !345)
!352 = !DILocation(line: 51, column: 17, scope: !345)
!353 = !DILocation(line: 44, column: 11, scope: !345)
!354 = !DILocation(line: 52, column: 25, scope: !345)
!355 = !DILocation(line: 52, column: 3, scope: !345)
!356 = !DILocation(line: 56, column: 22, scope: !357)
!357 = distinct !DILexicalBlock(scope: !312, file: !2, line: 55, column: 2)
!358 = !DILocation(line: 56, column: 26, scope: !357)
!359 = !DILocation(line: 56, column: 11, scope: !357)
!360 = !DILocation(line: 56, column: 3, scope: !357)
!361 = !DILocalVariable(name: ".temp", scope: !362, file: !2, line: 59, type: !60, align: 64)
!362 = distinct !DILexicalBlock(scope: !312, file: !2, line: 59, column: 2)
!363 = !DILocation(line: 59, column: 16, scope: !362)
!364 = !DILocalVariable(name: "b", scope: !365, file: !2, line: 59, type: !58, align: 64)
!365 = distinct !DILexicalBlock(scope: !362, file: !2, line: 59, column: 24)
!366 = !DILocation(line: 59, column: 12, scope: !365)
!367 = !DILocation(line: 59, column: 16, scope: !365)
!368 = !DILocation(line: 59, column: 25, scope: !365)
!369 = !DILocation(line: 59, column: 24, scope: !365)
!370 = !DILocation(line: 61, column: 2, scope: !312)
!371 = !DILocation(line: 41, column: 27, scope: !372, inlinedAt: !370)
!372 = distinct !DILexicalBlock(scope: !373, file: !348, line: 41, column: 37)
!373 = distinct !DISubprogram(name: "init", linkageName: "init", scope: !348, file: !348, line: 41, scopeLine: 41, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!374 = !DILocation(line: 41, column: 38, scope: !373, inlinedAt: !370)
!375 = !DILocation(line: 62, column: 2, scope: !312)
!376 = !DILocation(line: 62, column: 17, scope: !312)
!377 = !DILocation(line: 44, column: 11, scope: !312)
!378 = !DILocalVariable(name: ".temp", scope: !379, file: !2, line: 64, type: !60, align: 64)
!379 = distinct !DILexicalBlock(scope: !312, file: !2, line: 64, column: 2)
!380 = !DILocation(line: 64, column: 16, scope: !379)
!381 = !DILocalVariable(name: "b", scope: !382, file: !2, line: 64, type: !58, align: 64)
!382 = distinct !DILexicalBlock(scope: !379, file: !2, line: 64, column: 24)
!383 = !DILocation(line: 64, column: 12, scope: !382)
!384 = !DILocation(line: 64, column: 16, scope: !382)
!385 = !DILocation(line: 64, column: 25, scope: !382)
!386 = !DILocation(line: 64, column: 24, scope: !382)
!387 = !DILocation(line: 66, column: 2, scope: !312)
!388 = !DILocation(line: 41, column: 27, scope: !389, inlinedAt: !387)
!389 = distinct !DILexicalBlock(scope: !390, file: !348, line: 41, column: 37)
!390 = distinct !DISubprogram(name: "init", linkageName: "init", scope: !348, file: !348, line: 41, scopeLine: 41, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!391 = !DILocation(line: 41, column: 38, scope: !390, inlinedAt: !387)
!392 = !DILocation(line: 67, column: 2, scope: !312)
!393 = !DILocation(line: 67, column: 17, scope: !312)
!394 = !DILocation(line: 69, column: 22, scope: !312)
!395 = !DILocation(line: 369, column: 11, scope: !396, inlinedAt: !397)
!396 = distinct !DISubprogram(name: "zero_volatile", linkageName: "zero_volatile", scope: !109, file: !109, line: 367, scopeLine: 367, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!397 = !DILocation(line: 69, column: 2, scope: !312)
!398 = !DILocation(line: 369, column: 30, scope: !396, inlinedAt: !397)
!399 = !DILocation(line: 369, column: 40, scope: !396, inlinedAt: !397)
!400 = distinct !DISubprogram(name: "update", linkageName: "std.hash.hmac.Hmac$std.hash.whirlpool.Whirlpool$64$64$.update", scope: !2, file: !2, line: 72, type: !313, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!401 = !DILocation(line: 73, column: 1, scope: !400)
!402 = !DILocalVariable(name: "self", arg: 1, scope: !400, file: !2, line: 72, type: !315)
!403 = !DILocation(line: 72, column: 21, scope: !400)
!404 = !DILocalVariable(name: "data", arg: 2, scope: !400, file: !2, line: 72, type: !55)
!405 = !DILocation(line: 72, column: 35, scope: !400)
!406 = !DILocation(line: 74, column: 2, scope: !400)
!407 = !DILocation(line: 74, column: 16, scope: !400)
!408 = !DILocation(line: 44, column: 11, scope: !400)
!409 = distinct !DISubprogram(name: "final", linkageName: "std.hash.hmac.Hmac$std.hash.whirlpool.Whirlpool$64$64$.final", scope: !2, file: !2, line: 77, type: !410, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!410 = !DISubroutineType(types: !411)
!411 = !{!46, !315}
!412 = !DILocation(line: 78, column: 1, scope: !409)
!413 = !DILocalVariable(name: "self", arg: 1, scope: !409, file: !2, line: 77, type: !315)
!414 = !DILocation(line: 77, column: 32, scope: !409)
!415 = !DILocation(line: 79, column: 2, scope: !409)
!416 = !DILocation(line: 79, column: 18, scope: !409)
!417 = !DILocation(line: 44, column: 11, scope: !409)
!418 = !DILocation(line: 80, column: 9, scope: !409)
!419 = distinct !DISubprogram(name: "init", linkageName: "std.hash.hmac.Hmac$std.hash.sha512.Sha512$64$128$.init", scope: !2, file: !2, line: 45, type: !420, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !422, !55}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64, dwarfAddressSpace: 0)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hmac{Sha512, 64, 128}", scope: !2, file: !2, line: 4, size: 3200, align: 64, elements: !424, identifier: "std.hash.hmac.Hmac$std.hash.sha512.Sha512$64$128$")
!424 = !{!425, !434}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !423, file: !2, line: 6, baseType: !426, size: 1600, align: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sha512", scope: !423, file: !2, line: 18, size: 1600, align: 64, elements: !427, identifier: "std.hash.sha512.Sha512")
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !426, file: !2, line: 20, baseType: !61, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "hash_state", scope: !426, file: !2, line: 21, baseType: !322, size: 512, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !426, file: !2, line: 22, baseType: !431, size: 1024, align: 8, offset: 576)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1024, align: 8, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 128, lowerBound: 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !423, file: !2, line: 6, baseType: !426, size: 1600, align: 64, offset: 1600)
!435 = !DILocation(line: 46, column: 1, scope: !419)
!436 = !DILocalVariable(name: "self", arg: 1, scope: !419, file: !2, line: 45, type: !422)
!437 = !DILocation(line: 45, column: 19, scope: !419)
!438 = !DILocalVariable(name: "key", arg: 2, scope: !419, file: !2, line: 45, type: !55)
!439 = !DILocation(line: 45, column: 33, scope: !419)
!440 = !DILocalVariable(name: "buffer", scope: !419, file: !2, line: 47, type: !431, align: 8)
!441 = !DILocation(line: 47, column: 20, scope: !419)
!442 = !DILocation(line: 48, column: 6, scope: !419)
!443 = !DILocation(line: 50, column: 3, scope: !444)
!444 = distinct !DILexicalBlock(scope: !419, file: !2, line: 49, column: 2)
!445 = !DILocation(line: 51, column: 3, scope: !444)
!446 = !DILocation(line: 51, column: 17, scope: !444)
!447 = !DILocation(line: 135, column: 11, scope: !444)
!448 = !DILocation(line: 52, column: 25, scope: !444)
!449 = !DILocation(line: 52, column: 3, scope: !444)
!450 = !DILocation(line: 56, column: 22, scope: !451)
!451 = distinct !DILexicalBlock(scope: !419, file: !2, line: 55, column: 2)
!452 = !DILocation(line: 56, column: 26, scope: !451)
!453 = !DILocation(line: 56, column: 11, scope: !451)
!454 = !DILocation(line: 56, column: 3, scope: !451)
!455 = !DILocalVariable(name: ".temp", scope: !456, file: !2, line: 59, type: !60, align: 64)
!456 = distinct !DILexicalBlock(scope: !419, file: !2, line: 59, column: 2)
!457 = !DILocation(line: 59, column: 16, scope: !456)
!458 = !DILocalVariable(name: "b", scope: !459, file: !2, line: 59, type: !58, align: 64)
!459 = distinct !DILexicalBlock(scope: !456, file: !2, line: 59, column: 24)
!460 = !DILocation(line: 59, column: 12, scope: !459)
!461 = !DILocation(line: 59, column: 16, scope: !459)
!462 = !DILocation(line: 59, column: 25, scope: !459)
!463 = !DILocation(line: 59, column: 24, scope: !459)
!464 = !DILocation(line: 61, column: 2, scope: !419)
!465 = !DILocation(line: 62, column: 2, scope: !419)
!466 = !DILocation(line: 62, column: 17, scope: !419)
!467 = !DILocation(line: 135, column: 11, scope: !419)
!468 = !DILocalVariable(name: ".temp", scope: !469, file: !2, line: 64, type: !60, align: 64)
!469 = distinct !DILexicalBlock(scope: !419, file: !2, line: 64, column: 2)
!470 = !DILocation(line: 64, column: 16, scope: !469)
!471 = !DILocalVariable(name: "b", scope: !472, file: !2, line: 64, type: !58, align: 64)
!472 = distinct !DILexicalBlock(scope: !469, file: !2, line: 64, column: 24)
!473 = !DILocation(line: 64, column: 12, scope: !472)
!474 = !DILocation(line: 64, column: 16, scope: !472)
!475 = !DILocation(line: 64, column: 25, scope: !472)
!476 = !DILocation(line: 64, column: 24, scope: !472)
!477 = !DILocation(line: 66, column: 2, scope: !419)
!478 = !DILocation(line: 67, column: 2, scope: !419)
!479 = !DILocation(line: 67, column: 17, scope: !419)
!480 = !DILocation(line: 69, column: 22, scope: !419)
!481 = !DILocation(line: 369, column: 11, scope: !482, inlinedAt: !483)
!482 = distinct !DISubprogram(name: "zero_volatile", linkageName: "zero_volatile", scope: !109, file: !109, line: 367, scopeLine: 367, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!483 = !DILocation(line: 69, column: 2, scope: !419)
!484 = !DILocation(line: 369, column: 30, scope: !482, inlinedAt: !483)
!485 = !DILocation(line: 369, column: 40, scope: !482, inlinedAt: !483)
!486 = distinct !DISubprogram(name: "update", linkageName: "std.hash.hmac.Hmac$std.hash.sha512.Sha512$64$128$.update", scope: !2, file: !2, line: 72, type: !420, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !62)
!487 = !DILocation(line: 73, column: 1, scope: !486)
!488 = !DILocalVariable(name: "self", arg: 1, scope: !486, file: !2, line: 72, type: !422)
!489 = !DILocation(line: 72, column: 21, scope: !486)
